<?xml version="1.0"?>
<xml><product><SKU>CF-01-SLV</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Cool Feet</Name><Description>&#x3A4;&#x3B1; Cool Feet &#x3AD;&#x3C7;&#x3BF;&#x3C5;&#x3BD; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3C4;&#x3B5;&#x3AF; &#x3C9;&#x3C2; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3C6;&#x3B1;&#x3B9;&#x3C1;&#x3BF;&#x3CD;&#x3BC;&#x3B5;&#x3BD;&#x3B1; &#x3C3;&#x3C4;&#x3B7;&#x3C1;&#x3AF;&#x3B3;&#x3BC;&#x3B1;&#x3C4;&#x3B1; &#x3C0;&#x3BF;&#x3C5; &#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B8;&#x3B5;&#x3C4;&#x3BF;&#x3CD;&#x3BD;&#x3C4;&#x3B1;&#x3B9; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C9;&#x3C1;&#x3B9;&#x3BD;&#x3AC; &#x3C3;&#x3C4;&#x3B7; &#x3B2;&#x3AC;&#x3C3;&#x3B7; &#x3C4;&#x3BF;&#x3C5; laptop &#x3C3;&#x3B1;&#x3C2;.&#xD;
&#x39A;&#x3BF;&#x3BC;&#x3C8;&#x3AC;, &#x3B1;&#x3C0;&#x3BB;&#x3AC; &#x3C3;&#x3C4;&#x3B7; &#x3C3;&#x3CD;&#x3BD;&#x3B4;&#x3B5;&#x3C3;&#x3B7; &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3C0;&#x3BF;&#x3C3;&#x3CD;&#x3BD;&#x3B4;&#x3B5;&#x3C3;&#x3B7; &#x3BC;&#x3B5; &#x3B2;&#x3B5;&#x3BD;&#x3C4;&#x3BF;&#x3CD;&#x3B6;&#x3B5;&#x3C2;,&#x3C5;&#x3C0;&#x3B5;&#x3C1;&#x3C5;&#x3C8;&#x3CE;&#x3BD;&#x3BF;&#x3C5;&#x3BD; &#x3C4;&#x3BF; laptop &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3B5;&#x3C0;&#x3B9;&#x3C4;&#x3C1;&#x3AD;&#x3C0;&#x3B5;&#x3C4;&#x3B1;&#x3B9; &#x3B7; &#x3C3;&#x3C5;&#x3BD;&#x3B5;&#x3C7;&#x3AE;&#x3C2; &#x3BA;&#x3C5;&#x3BA;&#x3BB;&#x3BF;&#x3C6;&#x3BF;&#x3C1;&#x3AF;&#x3B1; &#x3C4;&#x3BF;&#x3C5; &#x3C8;&#x3C5;&#x3C7;&#x3C1;&#x3BF;&#x3CD; &#x3B1;&#x3AD;&#x3C1;&#x3B1;.</Description><Price>13.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/c/f/cf_016.jpg</Image></product><product><SKU>MD-EU</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - MiniDock - 30Pin (iPhone 4/4S)</Name><Description>&#x3A4;&#x3BF; MiniDock &#x3AD;&#x3C7;&#x3B5;&#x3B9; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3C4;&#x3B5;&#x3AF; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BC;&#x3B7;&#x3BD; &#x3BA;&#x3B5;&#x3AF;&#x3C4;&#x3B5;&#x3C4;&#x3B1;&#x3B9; &#x3C4;&#x3BF; iPhone 4/4s &#x3C3;&#x3B1;&#x3C2; &#x3C3;&#x3C4;&#x3BF; &#x3C0;&#x3AC;&#x3C4;&#x3C9;&#x3BC;&#x3B1; &#x3BF;&#x3C3;&#x3BF; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3AF;&#x3B6;&#x3B5;&#x3B9;. &#x395;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BF; &#x3B9;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3CC;&#x3C2; &#x3C3;&#x3CD;&#x3BD;&#x3C4;&#x3C1;&#x3BF;&#x3C6;&#x3BF;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B1;&#x3BE;&#x3AF;&#x3B4;&#x3B9;&#x3B1;, &#x3BA;&#x3B1;&#x3B8;&#x3CE;&#x3C2; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B5;&#x3BB;&#x3B1;&#x3C6;&#x3C1;&#x3CD;, &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC;, &#x3C0;&#x3C1;&#x3B1;&#x3BA;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3C5;&#x3AD;&#x3BB;&#x3B9;&#x3BA;&#x3C4;&#x3BF;. &#x3A4;&#x3BF; iPhone &#x3AE; &#x3C4;&#x3BF; iPad &#x3C3;&#x3B1;&#x3C2; &#x3B4;&#x3B5;&#x3BD; &#x3B8;&#x3B1; &#x3B2;&#x3C1;&#x3AF;&#x3C3;&#x3BA;&#x3BF;&#x3BD;&#x3C4;&#x3B1;&#x3B9; &#x3C0;&#x3BB;&#x3AD;&#x3BF;&#x3BD; &#x3C3;&#x3C4;&#x3BF; &#x3C0;&#x3AC;&#x3C4;&#x3C9;&#x3BC;&#x3B1; &#x3C4;&#x3BF;&#x3C5; &#x3B4;&#x3C9;&#x3BC;&#x3B1;&#x3C4;&#x3AF;&#x3BF;&#x3C5; &#x3C4;&#x3BF;&#x3C5; &#x3BE;&#x3B5;&#x3BD;&#x3BF;&#x3B4;&#x3BF;&#x3C7;&#x3B5;&#x3AF;&#x3BF;&#x3C5; &#x3C3;&#x3B1;&#x3C2; &#x3BF;&#x3CD;&#x3C4;&#x3B5; &#x3B8;&#x3B1; &#x3C0;&#x3B9;&#x3AC;&#x3BD;&#x3B5;&#x3B9; &#x3C7;&#x3CE;&#x3C1;&#x3BF; &#x3C3;&#x3C4;&#x3BF;&#x3BD; &#x3C0;&#x3AC;&#x3B3;&#x3BA;&#x3BF; &#x3C4;&#x3BF;&#x3C5; &#x3BC;&#x3C0;&#x3AC;&#x3BD;&#x3B9;&#x3BF;&#x3C5;.&#xD;
&#x3A4;&#x3CE;&#x3C1;&#x3B1; &#x3CC;&#x3C0;&#x3BF;&#x3C5; &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3BD; &#x3B5;&#x3AF;&#x3C3;&#x3C4;&#x3B5;, &#x3BF; &#x3C7;&#x3CE;&#x3C1;&#x3BF;&#x3C2; &#x3C3;&#x3B1;&#x3C2; &#x3B8;&#x3B1; &#x3C0;&#x3B1;&#x3C1;&#x3B1;&#x3BC;&#x3AD;&#x3BD;&#x3B5;&#x3B9; &#x3B5;&#x3BB;&#x3B5;&#x3CD;&#x3B8;&#x3B5;&#x3C1;&#x3BF;&#x3C2; &#x3B1;&#x3C0;&#x3CC;&#xD;
&#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; &#x3C0;&#x3BF;&#x3C5; &#x3BA;&#x3C1;&#x3AD;&#x3BC;&#x3BF;&#x3BD;&#x3C4;&#x3B1;&#x3B9; &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3BA;&#x3B1;&#x3C4;&#x3B1;&#x3C3;&#x3C4;&#x3B1;&#x3C3;&#x3AF;&#x3B1;.</Description><Price>19.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/m/d/md_001.jpg</Image></product><product><SKU>KS-GRY</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Kicks</Name><Description>&#x3A0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3AD;&#x3C8;&#x3C4;&#x3B5; &#x3C4;&#x3BF; iPad &#x3AE; &#x3C4;&#x3BF; tablet &#x3C3;&#x3B1;&#x3C2;, &#x3C7;&#x3C9;&#x3C1;&#x3AF;&#x3C2; &#x3BD;&#x3B1; &#x3BA;&#x3C1;&#x3CD;&#x3B2;&#x3B5;&#x3C4;&#x3B5; &#x3C4;&#x3BF; &#x3CC;&#x3BC;&#x3BF;&#x3C1;&#x3C6;&#x3BF; &#x3C3;&#x3C7;&#x3AD;&#x3B4;&#x3B9;&#x3CC; &#x3C4;&#x3BF;&#x3C5; &#x3BC;&#x3B5; &#x3C4;&#x3B1; Kicks &#x3BC;&#x3B1;&#x3C2;: &#x39C;&#x3B9;&#x3BA;&#x3C1;&#x3AC;, &#x3BB;&#x3B5;&#x3C0;&#x3C4;&#x3AC;, &#x3BB;&#x3B1;&#x3C3;&#x3C4;&#x3B9;&#x3C7;&#x3AD;&#x3BD;&#x3B9;&#x3B1; &#x201C;&#x3BC;&#x3B1;&#x3BE;&#x3B9;&#x3BB;&#x3B1;&#x3C1;&#x3AC;&#x3BA;&#x3B9;&#x3B1;&#x201D; &#x3C0;&#x3BF;&#x3C5; &#x3B5;&#x3BC;&#x3C0;&#x3BF;&#x3B4;&#x3AF;&#x3B6;&#x3BF;&#x3C5;&#x3BD; &#x3C4;&#x3BF; iPad &#x3C3;&#x3B1;&#x3C2; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3B7;&#x3BD; &#x3BF;&#x3BB;&#x3AF;&#x3C3;&#x3B8;&#x3B7;&#x3C3;&#x3B7;. &#x39C;&#x3B9;&#x3B1; &#x3B4;&#x3B9;&#x3B1;&#x3BA;&#x3C1;&#x3B9;&#x3C4;&#x3B9;&#x3BA;&#x3AE; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C3;&#x3AF;&#x3B1; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3B1;&#x3C0;&#x3BF;&#x3C6;&#x3B5;&#x3CD;&#x3B3;&#x3BF;&#x3BD;&#x3C4;&#x3B1;&#x3B9; &#x3B3;&#x3C1;&#x3B1;&#x3C4;&#x3B6;&#x3BF;&#x3C5;&#x3BD;&#x3B9;&#x3AD;&#x3C2;, &#x3BF;&#x3BB;&#x3AF;&#x3C3;&#x3B8;&#x3B7;&#x3C3;&#x3B7; &#x3BA;&#x3B1;&#x3B9; &#x3B6;&#x3B7;&#x3BC;&#x3B9;&#x3AD;&#x3C2;. &#x39F;&#x3B9; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3C5;&#x3C4;&#x3B9;&#x3BA;&#x3AD;&#x3C2; &#x3C1;&#x3AC;&#x3B3;&#x3B5;&#x3C2; &#x3C4;&#x3C1;&#x3AD;&#x3C7;&#x3BF;&#x3C5;&#x3BD; &#x3BA;&#x3B1;&#x3C4;&#x3AC; &#x3BC;&#x3AE;&#x3BA;&#x3BF;&#x3C2; &#x3C4;&#x3B7;&#x3C2; &#x3C0;&#x3AF;&#x3C3;&#x3C9; &#x3CC;&#x3C8;&#x3B7;&#x3C2;, &#x3C0;&#x3B1;&#x3C1;&#x3AD;&#x3C7;&#x3BF;&#x3BD;&#x3C4;&#x3B1;&#x3C2; &#x3BC;&#x3B9;&#x3B1; minimal &#x3C0;&#x3C1;&#x3BF;&#x3C6;&#x3CD;&#x3BB;&#x3B1;&#x3BE;&#x3B7; &#x3C4;&#x3BF;&#x3C5; &#x3C0;&#x3BF;&#x3BB;&#x3CD;&#x3C4;&#x3B9;&#x3BC;&#x3BF;&#x3C5; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3BB;&#x3B5;&#x3AF;&#x3BF;&#x3C5; &#x3C3;&#x3B1;&#x3C2;. &#x39A;&#x3BF;&#x3BB;&#x3BB;&#x3AC;&#x3BD;&#x3B5; &#x3C3;&#x3C4;&#x3B7; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE; &#x3C3;&#x3B1;&#x3C2; &#x3C7;&#x3C1;&#x3B7;&#x3C3;&#x3B9;&#x3BC;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3CE;&#x3BD;&#x3C4;&#x3B1;&#x3C2; 3M Damage-Free &#x3C3;&#x3C5;&#x3B3;&#x3BA;&#x3BF;&#x3BB;&#x3BB;&#x3B7;&#x3C4;&#x3B9;&#x3BA;&#x3CC;. &#x395;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B1; &#x3C3;&#x3C4;&#x3B7; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3B7; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3B7;&#x3BD; &#x3B5;&#x3C6;&#x3B1;&#x3C1;&#x3BC;&#x3BF;&#x3B3;&#x3AE;, &#x3B1;&#x3C6;&#x3B1;&#x3B9;&#x3C1;&#x3BF;&#x3CD;&#x3BD;&#x3C4;&#x3B1;&#x3B9; &#x3C7;&#x3C9;&#x3C1;&#x3AF;&#x3C2; &#x3BD;&#x3B1; &#x3B1;&#x3C6;&#x3AE;&#x3BD;&#x3BF;&#x3C5;&#x3BD; &#x3C3;&#x3B7;&#x3BC;&#x3AC;&#x3B4;&#x3B9;&#x3B1;.</Description><Price>10.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/k/s/ks_003.jpg</Image></product><product><SKU>MA-AL-EU</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Mika</Name><Description>&#x3A4;&#x3BF; Mika &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C4;&#x3BF; &#x3B1;&#x3C0;&#x3CC;&#x3BB;&#x3C5;&#x3C4;&#x3BF; stand, &#x3BC;&#x3B5; &#x3C4;&#x3B9;&#x3C2; &#x3C3;&#x3C9;&#x3C3;&#x3C4;&#x3AD;&#x3C2; &#x3B1;&#x3BD;&#x3B1;&#x3BB;&#x3BF;&#x3B3;&#x3AF;&#x3B5;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3CC;&#x3BB;&#x3B1;&#xD;
&#x3C4;&#x3B1; tablets.&#xD;
&#x3A4;&#x3BF; Mika &#x3B5;&#x3BD;&#x3C3;&#x3C9;&#x3BC;&#x3B1;&#x3C4;&#x3CE;&#x3BD;&#x3B5;&#x3C4;&#x3B1;&#x3B9; &#x3C0;&#x3BB;&#x3AE;&#x3C1;&#x3C9;&#x3C2; &#x3BC;&#x3B5; &#x3C4;&#x3B7;&#x3BD; &#x3B5;&#x3C0;&#x3B9;&#x3C6;&#x3AC;&#x3BD;&#x3B5;&#x3B9;&#x3B1; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3C3;&#x3AF;&#x3B1;&#x3C2; &#x3C3;&#x3B1;&#x3C2;.&#xD;
&#x391;&#x3C0;&#x3BF;&#x3C4;&#x3B5;&#x3BB;&#x3B5;&#x3AF; &#x3C4;&#x3BF;&#x3BD; &#x3C4;&#x3AD;&#x3BB;&#x3B5;&#x3B9;&#x3BF; &#x3C7;&#x3CE;&#x3C1;&#x3BF; &#x2018;&#x3BE;&#x3B5;&#x3BA;&#x3BF;&#x3CD;&#x3C1;&#x3B1;&#x3C3;&#x3B7;&#x3C2;' &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3BF; tablet &#x3AE; &#x3C4;&#x3BF; laptop &#x3C3;&#x3B1;&#x3C2;, &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3CE;&#x3BD;&#x3C4;&#x3B1;&#x3C2; &#x3C4;&#x3BF; &#x3C7;&#x3CE;&#x3C1;&#x3BF; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3C3;&#x3AF;&#x3B1;&#x3C2; &#x3C3;&#x3B1;&#x3C2; &#x3C4;&#x3B1;&#x3BA;&#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B7;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3BA;&#x3B1;&#x3B9; &#x3BA;&#x3B1;&#x3B8;&#x3B1;&#x3C1;&#x3CC;.&#xD;
&#x3A4;&#x3BF; Mika &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3CC;&#x3BC;&#x3BF;&#x3C1;&#x3C6;&#x3B1; &#x3BA;&#x3B1;&#x3C4;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3B1;&#x3C0;&#x3CC; &#x3C3;&#x3C5;&#x3BC;&#x3C0;&#x3B1;&#x3B3;&#x3AD;&#x3C2; &#x3B1;&#x3BB;&#x3BF;&#x3C5;&#x3BC;&#x3AF;&#x3BD;&#x3B9;&#x3BF; &#x3BC;&#x3B5; &#x3B1;&#x3C0;&#x3B1;&#x3BB;&#x3AD;&#x3C2; &#x3AC;&#x3BA;&#x3C1;&#x3B5;&#x3C2; &#x3B1;&#x3C0;&#x3CC; &#x3BA;&#x3B1;&#x3BF;&#x3C5;&#x3C4;&#x3C3;&#x3BF;&#x3CD;&#x3BA; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3BD;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3CD;&#x3B5;&#x3B9; &#x3C4;&#x3B9;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3C3;&#x3B1;&#x3C2;. &#x388;&#x3C7;&#x3B5;&#x3B9; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3C4;&#x3B5;&#x3AF; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AC;&#x3B5;&#x3B9; &#x3C4;&#x3BF; tablet &#x3C3;&#x3B1;&#x3C2; &#x3C3;&#x3B5; &#x3B5;&#x3C1;&#x3B3;&#x3BF;&#x3BD;&#x3BF;&#x3BC;&#x3B9;&#x3BA;&#x3AE; &#x3BA;&#x3BB;&#x3AF;&#x3C3;&#x3B7;, &#x3B5;&#x3C0;&#x3B9;&#x3C4;&#x3C1;&#x3AD;&#x3C0;&#x3BF;&#x3BD;&#x3C4;&#x3AC;&#x3C2; &#x3C3;&#x3B1;&#x3C2; &#x3BD;&#x3B1; &#x3B1;&#x3C0;&#x3BF;&#x3BA;&#x3C4;&#x3AE;&#x3C3;&#x3B5;&#x3C4;&#x3B5; &#x3C0;&#x3C1;&#x3CC;&#x3C3;&#x3B2;&#x3B1;&#x3C3;&#x3B7; &#x3C3;&#x3B5; &#x3B5;&#x3C6;&#x3B1;&#x3C1;&#x3BC;&#x3BF;&#x3B3;&#x3AD;&#x3C2;, &#x3BD;&#x3B1; &#x3C3;&#x3B5;&#x3C1;&#x3C6;&#x3AC;&#x3C1;&#x3B5;&#x3C4;&#x3B5; &#x3C3;&#x3C4;&#x3BF; &#x3B4;&#x3B9;&#x3B1;&#x3B4;&#x3AF;&#x3BA;&#x3C4;&#x3C5;&#x3BF;, &#x3BD;&#x3B1; &#x3C0;&#x3B1;&#x3C1;&#x3B1;&#x3BA;&#x3BF;&#x3BB;&#x3BF;&#x3C5;&#x3B8;&#x3AE;&#x3C3;&#x3B5;&#x3C4;&#x3B5; &#x3B2;&#x3AF;&#x3BD;&#x3C4;&#x3B5;&#x3BF; &#x3AE; &#x3BD;&#x3B1; &#x3B4;&#x3B9;&#x3B1;&#x3B2;&#x3AC;&#x3C3;&#x3B5;&#x3C4;&#x3B5; &#x3BC;&#x3B5; &#x3B5;&#x3C5;&#x3BA;&#x3BF;&#x3BB;&#x3AF;&#x3B1;.&#xD;
</Description><Price>39.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/m/a/ma_25.jpg</Image></product><product><SKU>POP-01</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - POP</Name><Description>&#x3A3;&#x3C5;&#x3BC;&#x3B2;&#x3B1;&#x3C4;&#x3CC; &#x3BC;&#x3B5; &#x3CC;&#x3BB;&#x3B1; &#x3C4;&#x3B1; iPhone, iPods &#x3BA;&#x3B1;&#x3B9; &#x3CC;&#x3BB;&#x3B5;&#x3C2; &#x3C4;&#x3B9;&#x3C2; &#x3C0;&#x3B1;&#x3C1;&#x3CC;&#x3BC;&#x3BF;&#x3B9;&#x3B5;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2;. &#x3A0;&#x3AC;&#x3C1;&#x3C4;&#x3B5; &#x3AD;&#x3BD;&#x3B1; POP &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3B1;&#x3C0;&#x3BF;&#x3C6;&#x3B5;&#x3CD;&#x3B3;&#x3B5;&#x3C4;&#x3B5; &#x3C4;&#x3BF; &#x3BC;&#x3C0;&#x3BB;&#x3AD;&#x3BE;&#x3B9;&#x3BC;&#x3BF; &#x3C4;&#x3C9;&#x3BD; &#x3BA;&#x3B1;&#x3BB;&#x3C9;&#x3B4;&#x3AF;&#x3C9;&#x3BD; &#x3C4;&#x3C9;&#x3BD; &#x3B1;&#x3BA;&#x3BF;&#x3C5;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CE;&#x3BD; &#x3C3;&#x3B1;&#x3C2;. &#x3A4;&#x3BF; POP &#x3B2;&#x3B5;&#x3BD;&#x3C4;&#x3BF;&#x3C5;&#x3B6;&#x3AC;&#x3C1;&#x3B5;&#x3B9; &#x3C3;&#x3C4;&#x3BF; &#x3C0;&#x3AF;&#x3C3;&#x3C9; &#x3BC;&#x3AD;&#x3C1;&#x3BF;&#x3C2; &#x3C4;&#x3BF;&#x3C5; iPhone/iPod &#x3BA;&#x3B1;&#x3B9; &#x3C3;&#x3B1;&#x3C2; &#x3B5;&#x3C0;&#x3B9;&#x3C4;&#x3C1;&#x3AD;&#x3C0;&#x3B5;&#x3B9; &#x3BD;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3CD;&#x3B5;&#x3C4;&#x3B5; &#x3C0;&#x3BB;&#x3AE;&#x3C1;&#x3C9;&#x3C2; &#x3C4;&#x3B1; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; &#x3C3;&#x3B1;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3BD;&#x3B1; &#x3C4;&#x3B1; &#x3AD;&#x3C7;&#x3B5;&#x3C4;&#x3B5; &#x3C0;&#x3AC;&#x3BD;&#x3C4;&#x3B1; &#x3C3;&#x3B5; &#x3C4;&#x3AC;&#x3BE;&#x3B7;.</Description><Price>9.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/p/o/pop_024_1.jpg</Image></product><product><SKU>KI-BK</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Kii - 30Pin (iPod/iPhone 4/4s)</Name><Description>&#x3A4;&#x3BF; Kii &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3AD;&#x3BD;&#x3B1;&#x3C2; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC;&#x3C2; &#x3C3;&#x3C5;&#x3BC;&#x3C0;&#x3B1;&#x3B3;&#x3AE;&#x3C2; USB &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3C4;&#x3AE;&#x3C2;, &#x3C3;&#x3C5;&#x3BC;&#x3B2;&#x3B1;&#x3C4;&#x3CC;&#x3C2; &#x3BC;&#x3B5; &#x3C4;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3CA;&#x3CC;&#x3BD;&#x3C4;&#x3B1; &#x3C4;&#x3B7;&#x3C2;  Apple, &#x3C0;&#x3BF;&#x3C5; &#x3BA;&#x3C1;&#x3B5;&#x3BC;&#x3B9;&#x3AD;&#x3C4;&#x3B1;&#x3B9; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3BA;&#x3BB;&#x3B5;&#x3B9;&#x3B4;&#x3BF;&#x3B8;&#x3AE;&#x3BA;&#x3B7; &#x3C3;&#x3B1;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3B1;&#x3C0;&#x3CC;&#x3BB;&#x3C5;&#x3C4;&#x3B7; &#x3B5;&#x3C5;&#x3BA;&#x3BF;&#x3BB;&#x3AF;&#x3B1;, &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3B2;&#x3B1;&#x3C3;&#x3B9;&#x3BC;&#x3CC;&#x3C4;&#x3B7;&#x3C4;&#x3B1; &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3BB;&#x3B5;&#x3C5;&#x3B8;&#x3B5;&#x3C1;&#x3AF;&#x3B1; &#x3BA;&#x3B9;&#x3BD;&#x3AE;&#x3C3;&#x3B5;&#x3C9;&#x3BD;. &#x395;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C4;&#x3CC;&#x3C3;&#x3BF; &#x3B5;&#x3BB;&#x3B1;&#x3C6;&#x3C1;&#x3CD;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3B4;&#x3B9;&#x3B1;&#x3BA;&#x3C1;&#x3B9;&#x3C4;&#x3B9;&#x3BA;&#x3CC;&#x3C2; &#x3CC;&#x3C0;&#x3C9;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3AD;&#x3BD;&#x3B1; &#x3B1;&#x3C0;&#x3BB;&#x3CC; &#x3BA;&#x3BB;&#x3B5;&#x3B9;&#x3B4;&#x3AF;, &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3C0;&#x3B9;&#x3C4;&#x3C1;&#x3AD;&#x3C0;&#x3B5;&#x3B9; &#x3C3;&#x3C4;&#x3BF;&#x3C5;&#x3C2; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3C4;&#x3B5;&#x3C2; &#x3BD;&#x3B1; &#x3C3;&#x3C5;&#x3BD;&#x3B4;&#x3AD;&#x3BF;&#x3BD;&#x3C4;&#x3B1;&#x3B9;  &#x3BA;&#x3B1;&#x3B9; &#x3BD;&#x3B1; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3AF;&#x3B6;&#x3BF;&#x3C5;&#x3BD; &#x3C4;&#x3B9;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3C4;&#x3BF;&#x3C5;&#x3C2; &#x3B1;&#x3C0;&#x3CC; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3BF;&#x3BD;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3C5;&#x3C0;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B9;&#x3C3;&#x3C4;&#x3AE; &#x3AE; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B1;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3B8;&#x3CD;&#x3C1;&#x3B1; USB, &#x3C7;&#x3C9;&#x3C1;&#x3AF;&#x3C2; &#x3BD;&#x3B1; &#x3C7;&#x3C1;&#x3B5;&#x3B9;&#x3AC;&#x3B6;&#x3B5;&#x3C4;&#x3B1;&#x3B9; &#x3BD;&#x3B1; &#x3BC;&#x3B5;&#x3C4;&#x3B1;&#x3C6;&#x3AD;&#x3C1;&#x3BF;&#x3C5;&#x3BD; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3C4;&#x3AE; &#x3BC;&#x3B5; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3BF; &#x3C3;&#x3CD;&#x3BD;&#x3B4;&#x3B5;&#x3C3;&#x3B7;&#x3C2;.</Description><Price>19.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/k/i/ki_30-_1_.jpg</Image></product><product><SKU>SK-BK</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Saidoka - 30Pin (Iphone 4/4s)</Name><Description>&#x393;&#x3BD;&#x3CE;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3B5; &#x3C4;&#x3BF; &#x3BD;&#x3AD;&#x3BF; &#x3B2;&#x3BF;&#x3B7;&#x3B8;&#x3CC; &#x3C3;&#x3B1;&#x3C2;. &#x3A4;&#x3BF; Saidoka &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BF; &#x3B1;&#x3C0;&#x3CC;&#x3BB;&#x3C5;&#x3C4;&#x3BF;&#x3C2; &#x3C3;&#x3CD;&#x3BD;&#x3C4;&#x3C1;&#x3BF;&#x3C6;&#x3BF;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7; &#x3C6;&#x3CC;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3B7; &#x3C4;&#x3BF;&#x3C5; iPhone &#x3C3;&#x3B1;&#x3C2;, &#x3C0;&#x3AC;&#x3BD;&#x3C4;&#x3B1; &#x3B4;&#x3AF;&#x3C0;&#x3BB;&#x3B1; &#x3C3;&#x3B1;&#x3C2;, &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C6;&#x3AD;&#x3C1;&#x3BF;&#x3BD;&#x3C4;&#x3B1;&#x3C2; &#x3B5;&#x3C5;&#x3BA;&#x3BF;&#x3BB;&#x3AF;&#x3B1; &#x3BA;&#x3B1;&#x3B9; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3B2;&#x3B1;&#x3C3;&#x3B9;&#x3BC;&#x3CC;&#x3C4;&#x3B7;&#x3C4;&#x3B1; &#x3C3;&#x3C4;&#x3BF; &#x3BA;&#x3B9;&#x3BD;&#x3B7;&#x3C4;&#x3CC; &#x3C3;&#x3B1;&#x3C2; &#x3BA;&#x3AC;&#x3B8;&#x3B5; &#x3C3;&#x3C4;&#x3B9;&#x3B3;&#x3BC;&#x3AE;. &#x3A4;&#x3BF; Saidoka &#x3C3;&#x3C5;&#x3BD;&#x3B4;&#x3AD;&#x3B5;&#x3C4;&#x3B1;&#x3B9; &#x3C3;&#x3C4;&#x3B7; &#x3B8;&#x3CD;&#x3C1;&#x3B1; USB &#x3C4;&#x3BF;&#x3C5; &#x3C5;&#x3C0;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B9;&#x3C3;&#x3C4;&#x3AE; &#x3C3;&#x3B1;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3AF;&#x3B6;&#x3B5;&#x3C4;&#x3B5; &#x3C4;&#x3BF; &#x3BA;&#x3B9;&#x3BD;&#x3B7;&#x3C4;&#x3CC; &#x3C3;&#x3B1;&#x3C2; &#x3BA;&#x3B1;&#x3B8;&#x3CE;&#x3C2; &#x3B5;&#x3C1;&#x3B3;&#x3AC;&#x3B6;&#x3B5;&#x3C3;&#x3C4;&#x3B5;, &#x3B2;&#x3C1;&#x3AF;&#x3C3;&#x3BA;&#x3B5;&#x3C4;&#x3B1;&#x3B9; &#x3B4;&#x3AF;&#x3C0;&#x3BB;&#x3B1; &#x3C3;&#x3C4;&#x3BF; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3CC;&#x3B3;&#x3B9;&#x3CC; &#x3C3;&#x3B1;&#x3C2;, &#x3CE;&#x3C3;&#x3C4;&#x3B5; &#x3C0;&#x3BF;&#x3C4;&#x3AD; &#x3B4;&#x3B5;&#x3BD; &#x3B8;&#x3B1; &#x3C7;&#x3AC;&#x3C3;&#x3B5;&#x3C4;&#x3B5; &#x3BA;&#x3BB;&#x3AE;&#x3C3;&#x3B7; &#x3AE; &#x3BC;&#x3AE;&#x3BD;&#x3C5;&#x3BC;&#x3B1; &#x3BA;&#x3B1;&#x3B9; &#x3B8;&#x3B1; &#x3AD;&#x3C7;&#x3B5;&#x3C4;&#x3B5; &#x3C0;&#x3AC;&#x3BD;&#x3C4;&#x3BF;&#x3C4;&#x3B5; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B7; &#x3C0;&#x3C1;&#x3CC;&#x3C3;&#x3B2;&#x3B1;&#x3C3;&#x3B7; &#x3C3;&#x3C4;&#x3B9;&#x3C2; &#x3B5;&#x3C6;&#x3B1;&#x3C1;&#x3BC;&#x3BF;&#x3B3;&#x3AD;&#x3C2; &#x3C3;&#x3B1;&#x3C2; &#x3CC;&#x3C4;&#x3B1;&#x3BD; &#x3C4;&#x3BF; &#x3C7;&#x3C1;&#x3B5;&#x3B9;&#x3AC;&#x3B6;&#x3B5;&#x3C3;&#x3C4;&#x3B5;.</Description><Price>29.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/s/k/sk_14_1.jpg</Image></product><product><SKU>MD-EU-L</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - MiniDock  - Lightning (iPhone 5/5S)</Name><Description>&#x3A3;&#x3C5;&#x3BD;&#x3B4;&#x3AD;&#x3C3;&#x3C4;&#x3B5; &#x3C4;&#x3BF; MiniDock &#x3C3;&#x3B5; &#x3BC;&#x3B9;&#x3B1; &#x3B7;&#x3BB;&#x3B5;&#x3BA;&#x3C4;&#x3C1;&#x3B9;&#x3BA;&#x3AE; &#x3C0;&#x3C1;&#x3AF;&#x3B6;&#x3B1; &#x3BA;&#x3B1;&#x3B9; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3AF;&#x3C3;&#x3C4;&#x3B5; &#x3C4;&#x3B7; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE; &#x3C3;&#x3B1;&#x3C2; &#x3C3;&#x3B5; &#x3CC;&#x3C1;&#x3B8;&#x3B9;&#x3B1; &#x3B8;&#x3AD;&#x3C3;&#x3B7;, &#x3C3;&#x3B5; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3BF;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3C7;&#x3CE;&#x3C1;&#x3BF;. &#x395;&#x3BD;&#x3C4;&#x3B5;&#x3BB;&#x3CE;&#x3C2; &#x3B5;&#x3C5;&#x3AD;&#x3BB;&#x3B9;&#x3BA;&#x3C4;&#x3BF; &#x3B3;&#x3B9;&#x3B1; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3B7; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3BA;&#x3BF;&#x3C5;&#x3B6;&#x3AF;&#x3BD;&#x3B1;, &#x3BC;&#x3C0;&#x3AC;&#x3BD;&#x3B9;&#x3BF;, &#x3C5;&#x3C0;&#x3BD;&#x3BF;&#x3B4;&#x3C9;&#x3BC;&#x3AC;&#x3C4;&#x3B9;&#x3BF; &#x3AE; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3BF;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3B4;&#x3C9;&#x3BC;&#x3AC;&#x3C4;&#x3B9;&#x3BF; &#x3CC;&#x3C0;&#x3BF;&#x3C5; &#x3B3;&#x3AF;&#x3BD;&#x3B5;&#x3C4;&#x3B1;&#x3B9; &#x3B7; &#x3C6;&#x3CC;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3B7; &#x3C4;&#x3BF;&#x3C5; iPhone &#x3AE; &#x3C4;&#x3BF; iPod &#x3B1;&#x3C0;&#x3B5;&#x3C5;&#x3B8;&#x3B5;&#x3AF;&#x3B1;&#x3C2; &#x3C3;&#x3C4;&#x3BF;&#x3BD; &#x3C4;&#x3BF;&#x3AF;&#x3C7;&#x3BF;. &#x3A4;&#x3BF; MiniDock &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B5;&#x3C0;&#x3AF;&#x3C3;&#x3B7;&#x3C2; &#x3BF; &#x3B9;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3CC;&#x3C2; &#x3C3;&#x3CD;&#x3BD;&#x3C4;&#x3C1;&#x3BF;&#x3C6;&#x3BF;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B1;&#x3BE;&#x3AF;&#x3B4;&#x3B9;&#x3B1;, &#x3BA;&#x3B1;&#x3B8;&#x3CE;&#x3C2; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B5;&#x3BB;&#x3B1;&#x3C6;&#x3C1;&#x3CD;, &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC;, &#x3C0;&#x3C1;&#x3B1;&#x3BA;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3C5;&#x3AD;&#x3BB;&#x3B9;&#x3BA;&#x3C4;&#x3BF;. &#x3A4;&#x3BF; iPhone &#x3AE; &#x3C4;&#x3BF; iPad &#x3C3;&#x3B1;&#x3C2; &#x3B4;&#x3B5;&#x3BD; &#x3B8;&#x3B1; &#x3BA;&#x3B5;&#x3AF;&#x3C4;&#x3B5;&#x3C4;&#x3B1;&#x3B9; &#x3C0;&#x3BB;&#x3AD;&#x3BF;&#x3BD; &#x3C3;&#x3C4;&#x3BF; &#x3C0;&#x3AC;&#x3C4;&#x3C9;&#x3BC;&#x3B1; &#x3C4;&#x3BF;&#x3C5; &#x3B4;&#x3C9;&#x3BC;&#x3B1;&#x3C4;&#x3AF;&#x3BF;&#x3C5; &#x3C4;&#x3BF;&#x3C5; &#x3BE;&#x3B5;&#x3BD;&#x3BF;&#x3B4;&#x3BF;&#x3C7;&#x3B5;&#x3AF;&#x3BF;&#x3C5; &#x3C3;&#x3B1;&#x3C2; &#x3BF;&#x3CD;&#x3C4;&#x3B5; &#x3B8;&#x3B1; &#x3C0;&#x3B9;&#x3AC;&#x3BD;&#x3B5;&#x3B9; &#x3C7;&#x3CE;&#x3C1;&#x3BF; &#x3C3;&#x3C4;&#x3BF;&#x3BD; &#x3C0;&#x3AC;&#x3B3;&#x3BA;&#x3BF; &#x3C4;&#x3BF;&#x3C5; &#x3BC;&#x3C0;&#x3AC;&#x3BD;&#x3B9;&#x3BF;&#x3C5;. &#x3A4;&#x3CE;&#x3C1;&#x3B1; &#x3CC;&#x3C0;&#x3BF;&#x3C5; &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3BD; &#x3B5;&#x3AF;&#x3C3;&#x3C4;&#x3B5;, &#x3BF; &#x3C7;&#x3CE;&#x3C1;&#x3BF;&#x3C2; &#x3C3;&#x3B1;&#x3C2; &#x3B8;&#x3B1; &#x3C0;&#x3B1;&#x3C1;&#x3B1;&#x3BC;&#x3AD;&#x3BD;&#x3B5;&#x3B9; &#x3B5;&#x3BB;&#x3B5;&#x3CD;&#x3B8;&#x3B5;&#x3C1;&#x3BF;&#x3C2; &#x3B1;&#x3C0;&#x3CC; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; &#x3C0;&#x3BF;&#x3C5; &#x3BA;&#x3C1;&#x3AD;&#x3BC;&#x3BF;&#x3BD;&#x3C4;&#x3B1;&#x3B9; &#x3BA;&#x3B1;&#x3B9; &#x3B4;&#x3B7;&#x3BC;&#x3B9;&#x3BF;&#x3C5;&#x3C1;&#x3B3;&#x3BF;&#x3CD;&#x3BD; &#x3B1;&#x3BA;&#x3B1;&#x3C4;&#x3B1;&#x3C3;&#x3C4;&#x3B1;&#x3C3;&#x3AF;&#x3B1;.</Description><Price>39.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/m/d/md_063_1.jpg</Image></product><product><SKU>BL-MO</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Milo</Name><Description>&#x3A4;&#x3BF; Milo &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C4;&#x3BF; &#x3B9;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3CC; &#x3BC;&#x3AD;&#x3C1;&#x3BF;c; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; "&#x3BE;&#x3B5;&#x3BA;&#x3BF;&#x3C5;&#x3C1;&#x3B1;&#x3B1;&#x3C4;&#x3B5;&#x3AF;" &#x3C4;&#x3BF; &#x3BA;&#x3B9;&#x3BD;&#x3B7;&#x3C4;&#x3CC; &#x3AE; &#x3C4;&#x3BF; tablet  &#x3C3;&#x3B1;&#x3C2;. &#x388;&#x3BD;&#x3B1;&#x3C2; &#x3C0;&#x3C1;&#x3B1;&#x3B3;&#x3BC;&#x3B1;&#x3C4;&#x3B9;&#x3BA;&#x3CC;&#x3C2; &#x3C3;&#x3C5;&#x3BD;&#x3B5;&#x3C1;&#x3B3;&#x3AC;&#x3C4;&#x3B7;&#x3C2;, &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3BF; &#x3B3;&#x3C1;&#x3B1;&#x3C6;&#x3B5;&#x3AF;&#x3BF;, &#x3C4;&#x3BF; &#x3BA;&#x3BF;&#x3BC;&#x3BF;&#x3B4;&#x3AF;&#x3BD;&#x3BF; n &#x3C4;&#x3BF;&#x3BD; &#x3C0;&#x3AC;&#x3B3;&#x3BA;&#x3BF; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3C3;&#x3AF;&#x3B1;&#x3C2; &#x3C3;&#x3B1;&#x3C2;, &#x3B1;&#x3C6;&#x3BF;&#x3C3;&#x3B9;&#x3C9;&#x3BC;&#x3AD;&#x3BD;&#x3BF;&#x3C2; &#x3C3;&#x3C4;&#x3BF; &#x3BD;&#x3B1; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AC;&#x3B5;&#x3B9;  &#x3C4;&#x3B7; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE; &#x3C3;&#x3B1;&#x3C2;, &#x3B5;&#x3AF;&#x3C4;&#x3B5; &#x3B1;&#x3C5;&#x3C4;&#x3AE; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C3;&#x3B5; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3B7;, &#x3B5;&#x3AF;&#x3C4;&#x3B5; &#x3C3;&#x3B5; &#x3BA;&#x3B1;&#x3C4;&#x3AC;&#x3C3;&#x3C4;&#x3B1;&#x3C3;&#x3B7;  &#x3B1;&#x3BD;&#x3B1;&#x3BC;&#x3BF;&#x3BD;&#x3AE;&#x3C2;.&#xD;
&#x3A4;&#x3BF; Milo &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3AD;&#x3BD;&#x3B1; minimal &#x3BA;&#x3B1;&#x3B9; &#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3B4;&#x3B1;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3B1;&#x3BE;&#x3B5;&#x3C3;&#x3BF;&#x3C5;&#x3AC;&#x3C1; &#x3B3;&#x3C1;&#x3B1;&#x3C6;&#x3B5;&#x3AF;&#x3BF;&#x3C5;. &#x399;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3CC; &#x3B3;&#x3B9;&#x3B1; hands-free &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3AD;&#x3C8;&#x3B5;&#x3B9;&#x3C2;, &#x3C0;&#x3C1;&#x3BF;&#x3B2;&#x3BF;&#x3BB;&#x3AE; &#x3B2;&#x3AF;&#x3BD;&#x3C4;&#x3B5;&#x3BF; n &#x3C3;&#x3B1;&#x3BD; &#x3BC;&#x3AD;&#x3C1;&#x3BF;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3B1;&#x3BA;&#x3BF;&#x3C5;&#x3BC;&#x3C0;&#x3AC;&#x3C4;&#x3B5; &#x3C4;&#x3B7;&#x3BD; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE; &#x3C3;&#x3B1;&#x3C2;. &#x391;&#x3C5;&#x3C4;&#x3CC; &#x3C4;&#x3BF; &#x3AD;&#x3BE;&#x3C5;&#x3C0;&#x3BD;&#x3BF; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC; stand &#x3AD;&#x3C7;&#x3B5;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x3C5;&#x3C8;&#x3B7;&#x3BB;&#x3CE;&#x3BD; &#x3C0;&#x3C1;&#x3BF;&#x3B4;&#x3B9;&#x3B1;&#x3B3;&#x3C1;&#x3B1;&#x3C6;&#x3CE;&#x3BD; &#x399;&#x3B1;&#x3C0;&#x3C9;&#x3BD;&#x3B9;&#x3BA;&#x3AE; &#x3C4;&#x3B5;&#x3C7;&#x3BD;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3AF;&#x3B1;  &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3BF;-&#x3B1;&#x3BD;&#x3B1;&#x3C1;&#x3C1;&#x3CC;&#x3C6;&#x3B7;&#x3C3;&#x3B7;&#x3C2; &#x3C0;&#x3BF;&#x3C5; &#x3B5;&#x3C0;&#x3B9;&#x3C4;&#x3C1;&#x3AD;&#x3C0;&#x3B5;&#x3B9; &#x3C3;&#x3C4;&#x3BF; Milo &#x3BD;&#x3B1; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AC;&#x3B5;&#x3B9;  &#x3C4;&#x3BF; &#x3BA;&#x3B9;&#x3BD;&#x3B7;&#x3C4;&#x3CC; &#x3BF;&#x3B1;&#x3B1;&#x3C2; &#x3C3;&#x3B5; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B1;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3B5;&#x3C0;&#x3B9;&#x3B8;&#x3C5;&#x3BC;&#x3B7;&#x3C4;&#x3AE; &#x3B3;&#x3C9;&#x3BD;&#x3AF;&#x3B1;. &#x397; &#x3B5;&#x3C0;&#x3B9;&#x3C6;&#x3AC;&#x3BD;&#x3B5;&#x3B9;&#x3B1; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3BF;-&#x3B1;&#x3BD;&#x3B1;&#x3C1;&#x3C1;&#x3CC;&#x3C6;&#x3B7;&#x3C3;&#x3B7;&#x3C3;&#x3C2; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B5;&#x3C0;&#x3B1;&#x3BD;&#x3B1;&#x3C7;&#x3C1;&#x3B7;&#x3C3;&#x3B9;&#x3BC;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3AE;&#x3C3;&#x3B9;&#x3BC;&#x3B7; , &#x3BA;&#x3B1;&#x3B8;&#x3B1;&#x3C1;&#x3AF;&#x3B6;&#x3B5;&#x3C4;&#x3B1;&#x3B9; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B1;  &#x3BA;&#x3B1;&#x3B9; &#x3B4;&#x3B5;&#x3BD; &#x3B1;&#x3C6;&#x3AE;&#x3BD;&#x3B5;&#x3B9;  &#x3BA;&#x3B1;&#x3C4;&#x3AC;&#x3BB;&#x3BF;&#x3B9;&#x3C0;&#x3B1; &#x3C3;&#x3C4;&#x3B9;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3B5;&#x3C2; &#x3AE; &#x3C3;&#x3C4;&#x3B9;&#x3C2; &#x3B5;&#x3C0;&#x3B9;&#x3C6;&#x3AC;&#x3BD;&#x3B5;&#x3B9;&#x3B5;&#x3C2;.&#xD;
</Description><Price>16.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/m/o/mo_009_1.jpg</Image></product><product><SKU>BL-NS</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Nest</Name><Description>&#x394;&#x3B9;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3B4;&#x3B1;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC;, &#x3BC;&#x3B5; &#x3C0;&#x3BF;&#x3BB;&#x3BB;&#x3B1;&#x3C0;&#x3BB;&#x3AD;&#x3C2; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3B5;&#x3B9;&#x3C2; &#x3C3;&#x3B5; &#x3B1;&#x3C0;&#x3AF;&#x3B8;&#x3B1;&#x3BD;&#x3B1; &#x3C7;&#x3C1;&#x3CE;&#x3BC;&#x3B1;&#x3C4;&#x3B1; &#x3C4;&#x3BF; Nest &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C4;&#x3BF; &#x3B9;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3CC; &#x3BC;&#x3AD;&#x3C1;&#x3BF;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3C7;&#x3C1;&#x3B7;&#x3C3;&#x3B9;&#x3BC;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B5;&#x3AF;&#x3C4;&#x3B1;&#x3B9; &#x3C4;&#x3BF; tablet &#x3C3;&#x3B1;&#x3C2;. &#x395;&#x3AF;&#x3C4;&#x3B5; &#x3BF;&#x3C1;&#x3B9;&#x3B6;&#x3CC;&#x3BD;&#x3C4;&#x3B9;&#x3B1;, &#x3CC;&#x3C0;&#x3BF;&#x3C5; &#x3B7; &#x3B5;&#x3C0;&#x3AD;&#x3BD;&#x3B4;&#x3C5;&#x3C3;&#x3B7; &#x3B1;&#x3C0;&#x3CC; &#x3BA;&#x3B1;&#x3BF;&#x3C5;&#x3C4;&#x3C3;&#x3BF;&#x3CD;&#x3BA; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3CD;&#x3B5;&#x3B9; &#x3C4;&#x3BF; &#x3C0;&#x3AF;&#x3C3;&#x3C9; &#x3BC;&#x3AD;&#x3C1;&#x3BF;&#x3C2;, &#x3AE; &#x3BA;&#x3AC;&#x3B8;&#x3B5;&#x3C4;&#x3B1; &#x3CC;&#x3C0;&#x3BF;&#x3C5; &#x3B7; &#x3BA;&#x3C1;&#x3C5;&#x3C6;&#x3AE; &#x3B2;&#x3AC;&#x3C3;&#x3B7; &#x3B3;&#x3BB;&#x3C5;&#x3C3;&#x3C4;&#x3C1;&#x3AC;&#x3B5;&#x3B9; &#x3C0;&#x3C1;&#x3BF;&#x3C2; &#x3C4;&#x3B1; &#x3AD;&#x3BE;&#x3C9; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3BF; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AC; &#x3C3;&#x3C4;&#x3B7; &#x3B8;&#x3AD;&#x3C3;&#x3B7; &#x3C4;&#x3BF;&#x3C5;. &#x3A4;&#x3BF; &#x3C0;&#x3AC;&#x3BD;&#x3C4;&#x3B1; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3B9;&#x3BC;&#x3BF; Nest &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3AF;&#x3B1; &#x3BF;&#x3BB;&#x3BF;&#x3BA;&#x3BB;&#x3B7;&#x3C1;&#x3C9;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3BA;&#x3B1;&#x3B9; &#x3B4;&#x3B9;&#x3B1;&#x3BA;&#x3C1;&#x3B9;&#x3C4;&#x3B9;&#x3BA;&#x3AE; &#x3BB;&#x3CD;&#x3C3;&#x3B7;,&#xD;
&#x3C0;&#x3BF;&#x3C5; &#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B8;&#x3B5;&#x3C4;&#x3B5;&#x3AF;&#x3C4;&#x3B1;&#x3B9; &#x3C3;&#x3B5; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3BF;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3B3;&#x3C1;&#x3B1;&#x3C6;&#x3B5;&#x3AF;&#x3BF;, &#x3B4;&#x3AF;&#x3C0;&#x3BB;&#x3B1; &#x3C3;&#x3C4;&#x3BF;&#x3BD; &#x3C6;&#x3BF;&#x3C1;&#x3B7;&#x3C4;&#x3CC; &#x3C3;&#x3B1;&#x3C2; &#x3C5;&#x3C0;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B9;&#x3C3;&#x3C4;&#x3AE; &#x3AE; &#x3C3;&#x3C4;&#x3BF; &#x3BA;&#x3BF;&#x3BC;&#x3BF;&#x3B4;&#x3AF;&#x3BD;&#x3BF; &#x3C3;&#x3B1;&#x3C2;.&#xD;
</Description><Price>13.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/n/s/ns_002_1.jpg</Image></product><product><SKU>BL-NS-BK</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Nest - Black</Name><Description>&#x394;&#x3B9;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3B4;&#x3B1;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC;, &#x3BC;&#x3B5; &#x3C0;&#x3BF;&#x3BB;&#x3BB;&#x3B1;&#x3C0;&#x3BB;&#x3AD;&#x3C2; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3B5;&#x3B9;&#x3C2; &#x3C3;&#x3B5; &#x3B1;&#x3C0;&#x3AF;&#x3B8;&#x3B1;&#x3BD;&#x3B1; &#x3C7;&#x3C1;&#x3CE;&#x3BC;&#x3B1;&#x3C4;&#x3B1;, &#x3C4;&#x3BF; Nest &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C4;&#x3BF; &#x3B9;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3CC; &#x3BC;&#x3AD;&#x3C1;&#x3BF;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BE;&#x3B5;&#x3BA;&#x3BF;&#x3C5;&#x3C1;&#x3B1;&#x3C3;&#x3C4;&#x3B5;&#x3AF; &#x3C4;&#x3BF; tablet &#x3C3;&#x3B1;&#x3C2;. &#x395;&#x3AF;&#x3C4;&#x3B5; &#x3BF;&#x3C1;&#x3B9;&#x3B6;&#x3CC;&#x3BD;&#x3C4;&#x3B9;&#x3B1;, &#x3CC;&#x3C0;&#x3BF;&#x3C5; &#x3B7; &#x3B5;&#x3C0;&#x3AD;&#x3BD;&#x3B4;&#x3C5;&#x3C3;&#x3B7; &#x3B1;&#x3C0;&#x3CC; &#x3BA;&#x3B1;&#x3BF;&#x3C5;&#x3C4;&#x3C3;&#x3BF;&#x3CD;&#x3BA; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3CD;&#x3B5;&#x3B9; &#x3C4;&#x3BF; &#x3C0;&#x3AF;&#x3C3;&#x3C9; &#x3BC;&#x3AD;&#x3C1;&#x3BF;&#x3C2;, &#x3AE; &#x3BA;&#x3AC;&#x3B8;&#x3B5;&#x3C4;&#x3B1;, &#x3CC;&#x3C0;&#x3BF;&#x3C5; &#x3B7; &#x3BA;&#x3C1;&#x3C5;&#x3C6;&#x3AE; &#x3B2;&#x3AC;&#x3C3;&#x3B7; &#x3B3;&#x3BB;&#x3C5;&#x3C3;&#x3C4;&#x3C1;&#x3AC;&#x3B5;&#x3B9; &#x3C0;&#x3C1;&#x3BF;&#x3C2; &#x3C4;&#x3B1; &#x3AD;&#x3BE;&#x3C9; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3BF; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AC; &#x3C3;&#x3C4;&#x3B7; &#x3B8;&#x3AD;&#x3C3;&#x3B7; &#x3C4;&#x3BF;&#x3C5;.</Description><Price>13.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/n/s/ns_018.jpg</Image></product><product><SKU>BL-NS-BLU</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Nest - Blue</Name><Description>&#x394;&#x3B9;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3B4;&#x3B1;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC;, &#x3BC;&#x3B5; &#x3C0;&#x3BF;&#x3BB;&#x3BB;&#x3B1;&#x3C0;&#x3BB;&#x3AD;&#x3C2; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3B5;&#x3B9;&#x3C2; &#x3C3;&#x3B5; &#x3B1;&#x3C0;&#x3AF;&#x3B8;&#x3B1;&#x3BD;&#x3B1; &#x3C7;&#x3C1;&#x3CE;&#x3BC;&#x3B1;&#x3C4;&#x3B1;, &#x3C4;&#x3BF; Nest &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C4;&#x3BF; &#x3B9;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3CC; &#x3BC;&#x3AD;&#x3C1;&#x3BF;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BE;&#x3B5;&#x3BA;&#x3BF;&#x3C5;&#x3C1;&#x3B1;&#x3C3;&#x3C4;&#x3B5;&#x3AF; &#x3C4;&#x3BF; tablet &#x3C3;&#x3B1;&#x3C2;. &#x395;&#x3AF;&#x3C4;&#x3B5; &#x3BF;&#x3C1;&#x3B9;&#x3B6;&#x3CC;&#x3BD;&#x3C4;&#x3B9;&#x3B1;, &#x3CC;&#x3C0;&#x3BF;&#x3C5; &#x3B7; &#x3B5;&#x3C0;&#x3AD;&#x3BD;&#x3B4;&#x3C5;&#x3C3;&#x3B7; &#x3B1;&#x3C0;&#x3CC; &#x3BA;&#x3B1;&#x3BF;&#x3C5;&#x3C4;&#x3C3;&#x3BF;&#x3CD;&#x3BA; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3CD;&#x3B5;&#x3B9; &#x3C4;&#x3BF; &#x3C0;&#x3AF;&#x3C3;&#x3C9; &#x3BC;&#x3AD;&#x3C1;&#x3BF;&#x3C2;, &#x3AE; &#x3BA;&#x3AC;&#x3B8;&#x3B5;&#x3C4;&#x3B1;, &#x3CC;&#x3C0;&#x3BF;&#x3C5; &#x3B7; &#x3BA;&#x3C1;&#x3C5;&#x3C6;&#x3AE; &#x3B2;&#x3AC;&#x3C3;&#x3B7; &#x3B3;&#x3BB;&#x3C5;&#x3C3;&#x3C4;&#x3C1;&#x3AC;&#x3B5;&#x3B9; &#x3C0;&#x3C1;&#x3BF;&#x3C2; &#x3C4;&#x3B1; &#x3AD;&#x3BE;&#x3C9; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3BF; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AC; &#x3C3;&#x3C4;&#x3B7; &#x3B8;&#x3AD;&#x3C3;&#x3B7; &#x3C4;&#x3BF;&#x3C5;.</Description><Price>13.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/n/s/ns_020.jpg</Image></product><product><SKU>BL-NS-GR</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Nest - Green</Name><Description>&#x394;&#x3B9;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3B4;&#x3B1;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC;, &#x3BC;&#x3B5; &#x3C0;&#x3BF;&#x3BB;&#x3BB;&#x3B1;&#x3C0;&#x3BB;&#x3AD;&#x3C2; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3B5;&#x3B9;&#x3C2; &#x3C3;&#x3B5; &#x3B1;&#x3C0;&#x3AF;&#x3B8;&#x3B1;&#x3BD;&#x3B1; &#x3C7;&#x3C1;&#x3CE;&#x3BC;&#x3B1;&#x3C4;&#x3B1;, &#x3C4;&#x3BF; Nest &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C4;&#x3BF; &#x3B9;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3CC; &#x3BC;&#x3AD;&#x3C1;&#x3BF;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BE;&#x3B5;&#x3BA;&#x3BF;&#x3C5;&#x3C1;&#x3B1;&#x3C3;&#x3C4;&#x3B5;&#x3AF; &#x3C4;&#x3BF; tablet &#x3C3;&#x3B1;&#x3C2;. &#x395;&#x3AF;&#x3C4;&#x3B5; &#x3BF;&#x3C1;&#x3B9;&#x3B6;&#x3CC;&#x3BD;&#x3C4;&#x3B9;&#x3B1;, &#x3CC;&#x3C0;&#x3BF;&#x3C5; &#x3B7; &#x3B5;&#x3C0;&#x3AD;&#x3BD;&#x3B4;&#x3C5;&#x3C3;&#x3B7; &#x3B1;&#x3C0;&#x3CC; &#x3BA;&#x3B1;&#x3BF;&#x3C5;&#x3C4;&#x3C3;&#x3BF;&#x3CD;&#x3BA; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3CD;&#x3B5;&#x3B9; &#x3C4;&#x3BF; &#x3C0;&#x3AF;&#x3C3;&#x3C9; &#x3BC;&#x3AD;&#x3C1;&#x3BF;&#x3C2;, &#x3AE; &#x3BA;&#x3AC;&#x3B8;&#x3B5;&#x3C4;&#x3B1;, &#x3CC;&#x3C0;&#x3BF;&#x3C5; &#x3B7; &#x3BA;&#x3C1;&#x3C5;&#x3C6;&#x3AE; &#x3B2;&#x3AC;&#x3C3;&#x3B7; &#x3B3;&#x3BB;&#x3C5;&#x3C3;&#x3C4;&#x3C1;&#x3AC;&#x3B5;&#x3B9; &#x3C0;&#x3C1;&#x3BF;&#x3C2; &#x3C4;&#x3B1; &#x3AD;&#x3BE;&#x3C9; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3BF; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AC; &#x3C3;&#x3C4;&#x3B7; &#x3B8;&#x3AD;&#x3C3;&#x3B7; &#x3C4;&#x3BF;&#x3C5;.</Description><Price>13.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/n/s/ns_021.jpg</Image></product><product><SKU>BL-NS-OR</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Nest - Orange</Name><Description>&#x394;&#x3B9;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3B4;&#x3B1;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC;, &#x3BC;&#x3B5; &#x3C0;&#x3BF;&#x3BB;&#x3BB;&#x3B1;&#x3C0;&#x3BB;&#x3AD;&#x3C2; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3B5;&#x3B9;&#x3C2; &#x3C3;&#x3B5; &#x3B1;&#x3C0;&#x3AF;&#x3B8;&#x3B1;&#x3BD;&#x3B1; &#x3C7;&#x3C1;&#x3CE;&#x3BC;&#x3B1;&#x3C4;&#x3B1;, &#x3C4;&#x3BF; Nest &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C4;&#x3BF; &#x3B9;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3CC; &#x3BC;&#x3AD;&#x3C1;&#x3BF;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BE;&#x3B5;&#x3BA;&#x3BF;&#x3C5;&#x3C1;&#x3B1;&#x3C3;&#x3C4;&#x3B5;&#x3AF; &#x3C4;&#x3BF; tablet &#x3C3;&#x3B1;&#x3C2;. &#x395;&#x3AF;&#x3C4;&#x3B5; &#x3BF;&#x3C1;&#x3B9;&#x3B6;&#x3CC;&#x3BD;&#x3C4;&#x3B9;&#x3B1;, &#x3CC;&#x3C0;&#x3BF;&#x3C5; &#x3B7; &#x3B5;&#x3C0;&#x3AD;&#x3BD;&#x3B4;&#x3C5;&#x3C3;&#x3B7; &#x3B1;&#x3C0;&#x3CC; &#x3BA;&#x3B1;&#x3BF;&#x3C5;&#x3C4;&#x3C3;&#x3BF;&#x3CD;&#x3BA; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3CD;&#x3B5;&#x3B9; &#x3C4;&#x3BF; &#x3C0;&#x3AF;&#x3C3;&#x3C9; &#x3BC;&#x3AD;&#x3C1;&#x3BF;&#x3C2;, &#x3AE; &#x3BA;&#x3AC;&#x3B8;&#x3B5;&#x3C4;&#x3B1;, &#x3CC;&#x3C0;&#x3BF;&#x3C5; &#x3B7; &#x3BA;&#x3C1;&#x3C5;&#x3C6;&#x3AE; &#x3B2;&#x3AC;&#x3C3;&#x3B7; &#x3B3;&#x3BB;&#x3C5;&#x3C3;&#x3C4;&#x3C1;&#x3AC;&#x3B5;&#x3B9; &#x3C0;&#x3C1;&#x3BF;&#x3C2; &#x3C4;&#x3B1; &#x3AD;&#x3BE;&#x3C9; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3BF; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AC; &#x3C3;&#x3C4;&#x3B7; &#x3B8;&#x3AD;&#x3C3;&#x3B7; &#x3C4;&#x3BF;&#x3C5;.</Description><Price>13.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/n/s/ns_022.jpg</Image></product><product><SKU>BL-NS-PNK</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Nest - Pink</Name><Description>&#x394;&#x3B9;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3B4;&#x3B1;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC;, &#x3BC;&#x3B5; &#x3C0;&#x3BF;&#x3BB;&#x3BB;&#x3B1;&#x3C0;&#x3BB;&#x3AD;&#x3C2; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3B5;&#x3B9;&#x3C2; &#x3C3;&#x3B5; &#x3B1;&#x3C0;&#x3AF;&#x3B8;&#x3B1;&#x3BD;&#x3B1; &#x3C7;&#x3C1;&#x3CE;&#x3BC;&#x3B1;&#x3C4;&#x3B1;, &#x3C4;&#x3BF; Nest &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C4;&#x3BF; &#x3B9;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3CC; &#x3BC;&#x3AD;&#x3C1;&#x3BF;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BE;&#x3B5;&#x3BA;&#x3BF;&#x3C5;&#x3C1;&#x3B1;&#x3C3;&#x3C4;&#x3B5;&#x3AF; &#x3C4;&#x3BF; tablet &#x3C3;&#x3B1;&#x3C2;. &#x395;&#x3AF;&#x3C4;&#x3B5; &#x3BF;&#x3C1;&#x3B9;&#x3B6;&#x3CC;&#x3BD;&#x3C4;&#x3B9;&#x3B1;, &#x3CC;&#x3C0;&#x3BF;&#x3C5; &#x3B7; &#x3B5;&#x3C0;&#x3AD;&#x3BD;&#x3B4;&#x3C5;&#x3C3;&#x3B7; &#x3B1;&#x3C0;&#x3CC; &#x3BA;&#x3B1;&#x3BF;&#x3C5;&#x3C4;&#x3C3;&#x3BF;&#x3CD;&#x3BA; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3CD;&#x3B5;&#x3B9; &#x3C4;&#x3BF; &#x3C0;&#x3AF;&#x3C3;&#x3C9; &#x3BC;&#x3AD;&#x3C1;&#x3BF;&#x3C2;, &#x3AE; &#x3BA;&#x3AC;&#x3B8;&#x3B5;&#x3C4;&#x3B1;, &#x3CC;&#x3C0;&#x3BF;&#x3C5; &#x3B7; &#x3BA;&#x3C1;&#x3C5;&#x3C6;&#x3AE; &#x3B2;&#x3AC;&#x3C3;&#x3B7; &#x3B3;&#x3BB;&#x3C5;&#x3C3;&#x3C4;&#x3C1;&#x3AC;&#x3B5;&#x3B9; &#x3C0;&#x3C1;&#x3BF;&#x3C2; &#x3C4;&#x3B1; &#x3AD;&#x3BE;&#x3C9; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3BF; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AC; &#x3C3;&#x3C4;&#x3B7; &#x3B8;&#x3AD;&#x3C3;&#x3B7; &#x3C4;&#x3BF;&#x3C5;.</Description><Price>13.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/n/s/ns_023.jpg</Image></product><product><SKU>BL-NS-WH</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Nest - White</Name><Description>&#x394;&#x3B9;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3B4;&#x3B1;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC;, &#x3BC;&#x3B5; &#x3C0;&#x3BF;&#x3BB;&#x3BB;&#x3B1;&#x3C0;&#x3BB;&#x3AD;&#x3C2; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3B5;&#x3B9;&#x3C2; &#x3C3;&#x3B5; &#x3B1;&#x3C0;&#x3AF;&#x3B8;&#x3B1;&#x3BD;&#x3B1; &#x3C7;&#x3C1;&#x3CE;&#x3BC;&#x3B1;&#x3C4;&#x3B1;, &#x3C4;&#x3BF; Nest &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C4;&#x3BF; &#x3B9;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3CC; &#x3BC;&#x3AD;&#x3C1;&#x3BF;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BE;&#x3B5;&#x3BA;&#x3BF;&#x3C5;&#x3C1;&#x3B1;&#x3C3;&#x3C4;&#x3B5;&#x3AF; &#x3C4;&#x3BF; tablet &#x3C3;&#x3B1;&#x3C2;. &#x395;&#x3AF;&#x3C4;&#x3B5; &#x3BF;&#x3C1;&#x3B9;&#x3B6;&#x3CC;&#x3BD;&#x3C4;&#x3B9;&#x3B1;, &#x3CC;&#x3C0;&#x3BF;&#x3C5; &#x3B7; &#x3B5;&#x3C0;&#x3AD;&#x3BD;&#x3B4;&#x3C5;&#x3C3;&#x3B7; &#x3B1;&#x3C0;&#x3CC; &#x3BA;&#x3B1;&#x3BF;&#x3C5;&#x3C4;&#x3C3;&#x3BF;&#x3CD;&#x3BA; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3CD;&#x3B5;&#x3B9; &#x3C4;&#x3BF; &#x3C0;&#x3AF;&#x3C3;&#x3C9; &#x3BC;&#x3AD;&#x3C1;&#x3BF;&#x3C2;, &#x3AE; &#x3BA;&#x3AC;&#x3B8;&#x3B5;&#x3C4;&#x3B1;, &#x3CC;&#x3C0;&#x3BF;&#x3C5; &#x3B7; &#x3BA;&#x3C1;&#x3C5;&#x3C6;&#x3AE; &#x3B2;&#x3AC;&#x3C3;&#x3B7; &#x3B3;&#x3BB;&#x3C5;&#x3C3;&#x3C4;&#x3C1;&#x3AC;&#x3B5;&#x3B9; &#x3C0;&#x3C1;&#x3BF;&#x3C2; &#x3C4;&#x3B1; &#x3AD;&#x3BE;&#x3C9; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3BF; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AC; &#x3C3;&#x3C4;&#x3B7; &#x3B8;&#x3AD;&#x3C3;&#x3B7; &#x3C4;&#x3BF;&#x3C5;.</Description><Price>13.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/n/s/ns_019.jpg</Image></product><product><SKU>BL-MO-AL-WH</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Milo Aluminium - White</Name><Description>&#x3A4;&#x3BF; Milo &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C4;&#x3BF; &#x3B9;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3CC; &#x3BC;&#x3AD;&#x3C1;&#x3BF;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BE;&#x3B5;&#x3BA;&#x3BF;&#x3C5;&#x3C1;&#x3B1;&#x3C3;&#x3C4;&#x3B5;&#x3AF;&#x201D; &#x3C4;&#x3BF; smartphone &#x3C3;&#x3B1;&#x3C2;. &#x388;&#x3BD;&#x3B1;&#x3C2; &#x3C0;&#x3C1;&#x3B1;&#x3B3;&#x3BC;&#x3B1;&#x3C4;&#x3B9;&#x3BA;&#x3CC;&#x3C2; &#x3C3;&#x3C5;&#x3BD;&#x3B5;&#x3C1;&#x3B3;&#x3AC;&#x3C4;&#x3B7;&#x3C2;, &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3BF; &#x3B3;&#x3C1;&#x3B1;&#x3C6;&#x3B5;&#x3AF;&#x3BF;, &#x3C4;&#x3BF; &#x3BA;&#x3BF;&#x3BC;&#x3BF;&#x3B4;&#x3AF;&#x3BD;&#x3BF; &#x3AE; &#x3C4;&#x3BF;&#x3BD; &#x3C0;&#x3AC;&#x3B3;&#x3BA;&#x3BF; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3C3;&#x3AF;&#x3B1;&#x3C2; &#x3C3;&#x3B1;&#x3C2;, &#x3B1;&#x3C6;&#x3BF;&#x3C3;&#x3B9;&#x3C9;&#x3BC;&#x3AD;&#x3BD;&#x3BF;&#x3C2; &#x3C3;&#x3C4;&#x3BF; &#x3BD;&#x3B1; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AC;&#x3B5;&#x3B9; &#x3C4;&#x3B7; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE;&#xD;
&#x3C3;&#x3B1;&#x3C2;, &#x3B5;&#x3AF;&#x3C4;&#x3B5; &#x3B1;&#x3C5;&#x3C4;&#x3AE; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C3;&#x3B5; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3B7;, &#x3B5;&#x3AF;&#x3C4;&#x3B5; &#x3C3;&#x3B5; &#x3BA;&#x3B1;&#x3C4;&#x3AC;&#x3C3;&#x3C4;&#x3B1;&#x3C3;&#x3B7; &#x3B1;&#x3BD;&#x3B1;&#x3BC;&#x3BF;&#x3BD;&#x3AE;&#x3C2;.&#xD;
&#x391;&#x3C5;&#x3C4;&#x3CC; &#x3C4;&#x3BF; &#x3AD;&#x3BE;&#x3C5;&#x3C0;&#x3BD;&#x3BF; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC; stand &#x3AD;&#x3C7;&#x3B5;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x3C5;&#x3C8;&#x3B7;&#x3BB;&#x3CE;&#x3BD; &#x3C0;&#x3C1;&#x3BF;&#x3B4;&#x3B9;&#x3B1;&#x3B3;&#x3C1;&#x3B1;&#x3C6;&#x3CE;&#x3BD; &#x399;&#x3B1;&#x3C0;&#x3C9;&#x3BD;&#x3B9;&#x3BA;&#x3AE; &#x3C4;&#x3B5;&#x3C7;&#x3BD;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3AF;&#x3B1; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3BF;-&#x3B1;&#x3BD;&#x3B1;&#x3C1;&#x3C1;&#x3CC;&#x3C6;&#x3B7;&#x3C3;&#x3B7;&#x3C2; &#x3C0;&#x3BF;&#x3C5; &#x3B5;&#x3C0;&#x3B9;&#x3C4;&#x3C1;&#x3AD;&#x3C0;&#x3B5;&#x3B9; &#x3C3;&#x3C4;&#x3BF; Milo &#x3BD;&#x3B1; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AC;&#x3B5;&#x3B9; &#x3C4;&#x3BF; &#x3BA;&#x3B9;&#x3BD;&#x3B7;&#x3C4;&#x3CC; &#x3C3;&#x3B1;&#x3C2; &#x3C3;&#x3B5; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B1;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3B5;&#x3C0;&#x3B9;&#x3B8;&#x3C5;&#x3BC;&#x3B7;&#x3C4;&#x3AE; &#x3B3;&#x3C9;&#x3BD;&#x3AF;&#x3B1;. &#x397; &#x3B5;&#x3C0;&#x3B9;&#x3C6;&#x3AC;&#x3BD;&#x3B5;&#x3B9;&#x3B1; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3BF;&#x3B1;&#x3BD;&#x3B1;&#x3C1;&#x3C1;&#x3CC;&#x3C6;&#x3B7;&#x3C3;&#x3B7;&#x3C2; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B5;&#x3C0;&#x3B1;&#x3BD;&#x3B1;&#x3C7;&#x3C1;&#x3B7;&#x3C3;&#x3B9;&#x3BC;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3AE;&#x3C3;&#x3B9;&#x3BC;&#x3B7;, &#x3BA;&#x3B1;&#x3B8;&#x3B1;&#x3C1;&#x3AF;&#x3B6;&#x3B5;&#x3C4;&#x3B1;&#x3B9; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B1; &#x3BA;&#x3B1;&#x3B9; &#x3B4;&#x3B5;&#x3BD; &#x3B1;&#x3C6;&#x3AE;&#x3BD;&#x3B5;&#x3B9; &#x3BA;&#x3B1;&#x3C4;&#x3AC;&#x3BB;&#x3BF;&#x3B9;&#x3C0;&#x3B1; &#x3C3;&#x3C4;&#x3B9;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3AE; &#x3C3;&#x3C4;&#x3B9;&#x3C2; &#x3B5;&#x3C0;&#x3B9;&#x3C6;&#x3AC;&#x3BD;&#x3B5;&#x3B9;&#x3B5;&#x3C2;.&#xD;
</Description><Price>29.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/m/o/mo_025.jpg</Image></product><product><SKU>BL-ML-AL-BK</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Milo Aluminium - Black</Name><Description>&#x3A4;&#x3BF; Milo &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C4;&#x3BF; &#x3B9;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3CC; &#x3BC;&#x3AD;&#x3C1;&#x3BF;c; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; "&#x3BE;&#x3B5;&#x3BA;&#x3BF;&#x3C5;&#x3C1;&#x3B1;&#x3B1;&#x3C4;&#x3B5;&#x3AF;" &#x3C4;&#x3BF; &#x3BA;&#x3B9;&#x3BD;&#x3B7;&#x3C4;&#x3CC; &#x3AE; &#x3C4;&#x3BF; tablet &#x3C3;&#x3B1;&#x3C2;. &#x388;&#x3BD;&#x3B1;&#x3C2; &#x3C0;&#x3C1;&#x3B1;&#x3B3;&#x3BC;&#x3B1;&#x3C4;&#x3B9;&#x3BA;&#x3CC;&#x3C2; &#x3C3;&#x3C5;&#x3BD;&#x3B5;&#x3C1;&#x3B3;&#x3AC;&#x3C4;&#x3B7;&#x3C2;, &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3BF; &#x3B3;&#x3C1;&#x3B1;&#x3C6;&#x3B5;&#x3AF;&#x3BF;, &#x3C4;&#x3BF; &#x3BA;&#x3BF;&#x3BC;&#x3BF;&#x3B4;&#x3AF;&#x3BD;&#x3BF; n &#x3C4;&#x3BF;&#x3BD; &#x3C0;&#x3AC;&#x3B3;&#x3BA;&#x3BF; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3C3;&#x3AF;&#x3B1;&#x3C2; &#x3C3;&#x3B1;&#x3C2;, &#x3B1;&#x3C6;&#x3BF;&#x3C3;&#x3B9;&#x3C9;&#x3BC;&#x3AD;&#x3BD;&#x3BF;&#x3C2; &#x3C3;&#x3C4;&#x3BF; &#x3BD;&#x3B1; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AC;&#x3B5;&#x3B9; &#x3C4;&#x3B7; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE; &#x3C3;&#x3B1;&#x3C2;, &#x3B5;&#x3AF;&#x3C4;&#x3B5; &#x3B1;&#x3C5;&#x3C4;&#x3AE; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C3;&#x3B5; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3B7;, &#x3B5;&#x3AF;&#x3C4;&#x3B5; &#x3C3;&#x3B5; &#x3BA;&#x3B1;&#x3C4;&#x3AC;&#x3C3;&#x3C4;&#x3B1;&#x3C3;&#x3B7; &#x3B1;&#x3BD;&#x3B1;&#x3BC;&#x3BF;&#x3BD;&#x3AE;&#x3C2;. &#x3A4;&#x3BF; Milo &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3AD;&#x3BD;&#x3B1; minimal &#x3BA;&#x3B1;&#x3B9; &#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3B4;&#x3B1;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3B1;&#x3BE;&#x3B5;&#x3C3;&#x3BF;&#x3C5;&#x3AC;&#x3C1; &#x3B3;&#x3C1;&#x3B1;&#x3C6;&#x3B5;&#x3AF;&#x3BF;&#x3C5;. &#x399;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3CC; &#x3B3;&#x3B9;&#x3B1; hands-free &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3AD;&#x3C8;&#x3B5;&#x3B9;&#x3C2;, &#x3C0;&#x3C1;&#x3BF;&#x3B2;&#x3BF;&#x3BB;&#x3AE; &#x3B2;&#x3AF;&#x3BD;&#x3C4;&#x3B5;&#x3BF; n &#x3C3;&#x3B1;&#x3BD; &#x3BC;&#x3AD;&#x3C1;&#x3BF;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3B1;&#x3BA;&#x3BF;&#x3C5;&#x3BC;&#x3C0;&#x3AC;&#x3C4;&#x3B5; &#x3C4;&#x3B7;&#x3BD; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE; &#x3C3;&#x3B1;&#x3C2;. &#x391;&#x3C5;&#x3C4;&#x3CC; &#x3C4;&#x3BF; &#x3AD;&#x3BE;&#x3C5;&#x3C0;&#x3BD;&#x3BF; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC; stand &#x3AD;&#x3C7;&#x3B5;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x3C5;&#x3C8;&#x3B7;&#x3BB;&#x3CE;&#x3BD; &#x3C0;&#x3C1;&#x3BF;&#x3B4;&#x3B9;&#x3B1;&#x3B3;&#x3C1;&#x3B1;&#x3C6;&#x3CE;&#x3BD; &#x399;&#x3B1;&#x3C0;&#x3C9;&#x3BD;&#x3B9;&#x3BA;&#x3AE; &#x3C4;&#x3B5;&#x3C7;&#x3BD;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3AF;&#x3B1; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3BF;-&#x3B1;&#x3BD;&#x3B1;&#x3C1;&#x3C1;&#x3CC;&#x3C6;&#x3B7;&#x3C3;&#x3B7;&#x3C2; &#x3C0;&#x3BF;&#x3C5; &#x3B5;&#x3C0;&#x3B9;&#x3C4;&#x3C1;&#x3AD;&#x3C0;&#x3B5;&#x3B9; &#x3C3;&#x3C4;&#x3BF; Milo &#x3BD;&#x3B1; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AC;&#x3B5;&#x3B9; &#x3C4;&#x3BF; &#x3BA;&#x3B9;&#x3BD;&#x3B7;&#x3C4;&#x3CC; &#x3BF;&#x3B1;&#x3B1;&#x3C2; &#x3C3;&#x3B5; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B1;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3B5;&#x3C0;&#x3B9;&#x3B8;&#x3C5;&#x3BC;&#x3B7;&#x3C4;&#x3AE; &#x3B3;&#x3C9;&#x3BD;&#x3AF;&#x3B1;. &#x397; &#x3B5;&#x3C0;&#x3B9;&#x3C6;&#x3AC;&#x3BD;&#x3B5;&#x3B9;&#x3B1; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3BF;-&#x3B1;&#x3BD;&#x3B1;&#x3C1;&#x3C1;&#x3CC;&#x3C6;&#x3B7;&#x3C3;&#x3B7;&#x3C3;&#x3C2; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B5;&#x3C0;&#x3B1;&#x3BD;&#x3B1;&#x3C7;&#x3C1;&#x3B7;&#x3C3;&#x3B9;&#x3BC;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3AE;&#x3C3;&#x3B9;&#x3BC;&#x3B7; , &#x3BA;&#x3B1;&#x3B8;&#x3B1;&#x3C1;&#x3AF;&#x3B6;&#x3B5;&#x3C4;&#x3B1;&#x3B9; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B1; &#x3BA;&#x3B1;&#x3B9; &#x3B4;&#x3B5;&#x3BD; &#x3B1;&#x3C6;&#x3AE;&#x3BD;&#x3B5;&#x3B9; &#x3BA;&#x3B1;&#x3C4;&#x3AC;&#x3BB;&#x3BF;&#x3B9;&#x3C0;&#x3B1; &#x3C3;&#x3C4;&#x3B9;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3B5;&#x3C2; &#x3AE; &#x3C3;&#x3C4;&#x3B9;&#x3C2; &#x3B5;&#x3C0;&#x3B9;&#x3C6;&#x3AC;&#x3BD;&#x3B5;&#x3B9;&#x3B5;&#x3C2;. </Description><Price>29.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/m/o/mo_029.jpg</Image></product><product><SKU>BL-SO-WH</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Sumo - White</Name><Description>SUMO, &#x3B7; &#x3B5;&#x3C5;&#x3C6;&#x3C5;&#x3AD;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B7; &#x3AD;&#x3BC;&#x3C0;&#x3BD;&#x3B5;&#x3C5;&#x3C3;&#x3B7; &#x3C0;&#x3AF;&#x3C3;&#x3C9; &#x3B1;&#x3C0;&#x3CC; &#x3B1;&#x3C5;&#x3C4;&#x3CC; &#x3C4;&#x3BF; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC; &#x3B1;&#x3BB;&#x3BB;&#x3AC; &#x3C3;&#x3C4;&#x3B9;&#x3B2;&#x3B1;&#x3C1;&#x3CC; desktop accessory &#x3AE;&#x3C4;&#x3B1;&#x3BD; &#x3BD;&#x3B1; &#x3C0;&#x3B1;&#x3C1;&#x3AD;&#x3C7;&#x3B5;&#x3B9; &#x3BC;&#x3AF;&#x3B1; &#x3B4;&#x3B9;&#x3B1;&#x3BA;&#x3C1;&#x3B9;&#x3C4;&#x3B9;&#x3BA;&#x3AE; &#x3B1;&#x3BB;&#x3BB;&#x3AC; &#x3C0;&#x3B1;&#x3C1;&#x3AC;&#x3BB;&#x3BB;&#x3B7;&#x3BB;&#x3B1; &#x3C0;&#x3C1;&#x3B1;&#x3BA;&#x3C4;&#x3B9;&#x3BA;&#x3AE; &#x3BB;&#x3CD;&#x3C3;&#x3B7;, &#x3C0;&#x3BF;&#x3C5; &#x3BD;&#x3B1; &#x3BC;&#x3C0;&#x3BF;&#x3C1;&#x3B5;&#x3AF; &#x3BD;&#x3B1; &#x3C7;&#x3C1;&#x3B7;&#x3C3;&#x3B9;&#x3BC;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B7;&#x3B8;&#x3B5;&#x3AF; &#x3BF;&#x3C0;&#x3BF;&#x3C5;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3C3;&#x3C4;&#x3BF; &#x3C3;&#x3C0;&#x3AF;&#x3C4;&#x3B9; &#x3AE; &#x3C3;&#x3C4;&#x3BF;&#x3BD; &#x3C7;&#x3CE;&#x3C1;&#x3BF; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3C3;&#x3AF;&#x3B1;&#x3C2;, &#x3C7;&#x3C9;&#x3C1;&#x3AF;&#x3C2; &#x3BD;&#x3B1; &#x3C7;&#x3C1;&#x3B5;&#x3B9;&#x3AC;&#x3B6;&#x3B5;&#x3C4;&#x3B1;&#x3B9; &#x3BD;&#x3B1; &#x3BA;&#x3BF;&#x3BB;&#x3BB;&#x3AE;&#x3C3;&#x3B5;&#x3B9; &#x3AE; &#x3BD;&#x3B1; &#x3B2;&#x3B9;&#x3B4;&#x3C9;&#x3B8;&#x3B5;&#x3AF; &#x3C3;&#x3B5; &#x3AD;&#x3C0;&#x3B9;&#x3C0;&#x3BB;&#x3B1; &#x3AE; &#x3C4;&#x3BF;&#x3AF;&#x3C7;&#x3BF;&#x3C5;&#x3C2;. &#x3A4;&#x3B1; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; &#x3C3;&#x3C5;&#x3B3;&#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3BF;&#x3CD;&#x3BD;&#x3C4;&#x3B1;&#x3B9; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3BF; &#x3BD;&#x3B1; &#x3B3;&#x3BB;&#x3B9;&#x3C3;&#x3C4;&#x3C1;&#x3AE;&#x3C3;&#x3BF;&#x3C5;&#x3BD; &#x3C3;&#x3C4;&#x3BF; &#x3C0;&#x3AC;&#x3C4;&#x3C9;&#x3BC;&#x3B1; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B1; &#x3BA;&#x3B1;&#x3B9; &#x3BC;&#x3B5; &#x3B1;&#x3C3;&#x3C6;&#x3AC;&#x3BB;&#x3B5;&#x3B9;&#x3B1;. &#x391;&#x3C5;&#x3C4;&#x3CC; &#x3C4;&#x3BF; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC; &amp; &#x3C3;&#x3C5;&#x3BC;&#x3C0;&#x3B1;&#x3B3;&#x3AD;&#x3C2; &#x3B2;&#x3B1;&#x3C1;&#x3C5;&#x3B4;&#x3AC;&#x3BA;&#x3B9; &#x3B5;&#x3BA;&#x3BC;&#x3B5;&#x3C4;&#x3B1;&#x3BB;&#x3BB;&#x3B5;&#x3CD;&#x3B5;&#x3C4;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x399;&#x3B1;&#x3C0;&#x3C9;&#x3BD;&#x3B9;&#x3BA;&#x3AE; &#x3C4;&#x3B5;&#x3C7;&#x3BD;&#x3B9;&#x3BA;&#x3AE; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3BF;-&#x3B1;&#x3BD;&#x3B1;&#x3C1;&#x3C1;&#x3CC;&#x3C6;&#x3B7;&#x3C3;&#x3B7;&#x3C2;, &#x3B7; &#x3BF;&#x3C0;&#x3BF;&#x3AF;&#x3B1; &#x3C7;&#x3C9;&#x3C1;&#x3AF;&#x3C2; &#x3C3;&#x3C5;&#x3B3;&#x3BA;&#x3BF;&#x3BB;&#x3BB;&#x3B7;&#x3C4;&#x3B9;&#x3BA;&#x3AC;, &#x3B1;&#x3BD;&#x3C4;&#x3B9;&#x3C3;&#x3C4;&#x3AD;&#x3BA;&#x3B5;&#x3C4;&#x3B1;&#x3B9; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3BF;&#x3BB;&#x3AF;&#x3C3;&#x3B8;&#x3B7;&#x3C3;&#x3B7; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3B9;&#x3C2; &#x3C0;&#x3B5;&#x3C1;&#x3B9;&#x3C3;&#x3C3;&#x3CC;&#x3C4;&#x3B5;&#x3C1;&#x3B5;&#x3C2; &#x3BB;&#x3B5;&#x3AF;&#x3B5;&#x3C2; &#x3B5;&#x3C0;&#x3B9;&#x3C6;&#x3AC;&#x3BD;&#x3B5;&#x3B9;&#x3B5;&#x3C2;, &#x3B1;&#x3BA;&#x3CC;&#x3BC;&#x3B1; &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3BF; &#x3B3;&#x3C5;&#x3B1;&#x3BB;&#x3AF;. &#x39C;&#x3C0;&#x3BF;&#x3C1;&#x3B5;&#x3AF; &#x3BD;&#x3B1; &#x3B5;&#x3C0;&#x3B1;&#x3BD;&#x3B1;&#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B8;&#x3B5;&#x3C4;&#x3B7;&#x3B8;&#x3B5;&#x3AF; &#x3BA;&#x3B1;&#x3B9; &#x3BD;&#x3B1; &#x3B5;&#x3C0;&#x3B1;&#x3BD;&#x3B1;&#x3C7;&#x3C1;&#x3B7;&#x3C3;&#x3B9;&#x3BC;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B7;&#x3B8;&#x3B5;&#x3AF; &#x3CC;&#x3C3;&#x3B5;&#x3C2; &#x3C6;&#x3BF;&#x3C1;&#x3AD;&#x3C2; &#x3B8;&#x3AD;&#x3BB;&#x3B5;&#x3C4;&#x3B5;.</Description><Price>13.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/3/7/379479_10150448896049919_703785348_n.jpg</Image></product><product><SKU>BL - SO</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Sumo</Name><Description>Sumo, &#x3B7; &#x3B5;&#x3C5;&#x3C6;&#x3C5;&#x3AD;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B7; &#x3AD;&#x3BC;&#x3C0;&#x3BD;&#x3B5;&#x3C5;&#x3C3;&#x3B7; &#x3C0;&#x3AF;&#x3C3;&#x3C9; &#x3B1;&#x3C0;&#x3CC; &#x3B1;&#x3C5;&#x3C4;&#x3CC; &#x3C4;&#x3BF; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC; &#x3B1;&#x3BB;&#x3BB;&#x3AC; &#x3C3;&#x3C4;&#x3B9;&#x3B2;&#x3B1;&#x3C1;&#x3CC; desktop accessory &#x3AE;&#x3C4;&#x3B1;&#x3BD; &#x3BD;&#x3B1; &#x3C0;&#x3B1;&#x3C1;&#x3AD;&#x3C7;&#x3B5;&#x3B9; &#x3BC;&#x3AF;&#x3B1; &#x3B4;&#x3B9;&#x3B1;&#x3BA;&#x3C1;&#x3B9;&#x3C4;&#x3B9;&#x3BA;&#x3AE; &#x3B1;&#x3BB;&#x3BB;&#x3AC; &#x3C0;&#x3B1;&#x3C1;&#x3AC;&#x3BB;&#x3BB;&#x3B7;&#x3BB;&#x3B1; &#x3C0;&#x3C1;&#x3B1;&#x3BA;&#x3C4;&#x3B9;&#x3BA;&#x3AE; &#x3BB;&#x3CD;&#x3C3;&#x3B7;, &#x3C0;&#x3BF;&#x3C5; &#x3BD;&#x3B1; &#x3BC;&#x3C0;&#x3BF;&#x3C1;&#x3B5;&#x3AF; &#x3BD;&#x3B1; &#x3C7;&#x3C1;&#x3B7;&#x3C3;&#x3B9;&#x3BC;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B7;&#x3B8;&#x3B5;&#x3AF; &#x3BF;&#x3C0;&#x3BF;&#x3C5;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3C3;&#x3C4;&#x3BF; &#x3C3;&#x3C0;&#x3AF;&#x3C4;&#x3B9; &#x3AE; &#x3C3;&#x3C4;&#x3BF;&#x3BD; &#x3C7;&#x3CE;&#x3C1;&#x3BF; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3C3;&#x3AF;&#x3B1;&#x3C2;, &#x3C7;&#x3C9;&#x3C1;&#x3AF;&#x3C2; &#x3BD;&#x3B1; &#x3C7;&#x3C1;&#x3B5;&#x3B9;&#x3AC;&#x3B6;&#x3B5;&#x3C4;&#x3B1;&#x3B9; &#x3BD;&#x3B1; &#x3BA;&#x3BF;&#x3BB;&#x3BB;&#x3AE;&#x3C3;&#x3B5;&#x3B9; &#x3AE; &#x3BD;&#x3B1; &#x3B2;&#x3B9;&#x3B4;&#x3C9;&#x3B8;&#x3B5;&#x3AF; &#x3C3;&#x3B5; &#x3AD;&#x3C0;&#x3B9;&#x3C0;&#x3BB;&#x3B1; &#x3AE; &#x3C4;&#x3BF;&#x3AF;&#x3C7;&#x3BF;&#x3C5;&#x3C2;.&#xD;
&#x3A4;&#x3B1; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; &#x3C3;&#x3C5;&#x3B3;&#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3BF;&#x3CD;&#x3BD;&#x3C4;&#x3B1;&#x3B9; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3BF; &#x3BD;&#x3B1; &#x3B3;&#x3BB;&#x3B9;&#x3C3;&#x3C4;&#x3C1;&#x3AE;&#x3C3;&#x3BF;&#x3C5;&#x3BD; &#x3C3;&#x3C4;&#x3BF; &#x3C0;&#x3AC;&#x3C4;&#x3C9;&#x3BC;&#x3B1; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B1; &#x3BA;&#x3B1;&#x3B9; &#x3BC;&#x3B5; &#x3B1;&#x3C3;&#x3C6;&#x3AC;&#x3BB;&#x3B5;&#x3B9;&#x3B1;. </Description><Price>13.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/s/o/so_003_1.jpg</Image></product><product><SKU>BL-SO-BK</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Sumo - Black</Name><Description>SUMO, &#x3B7; &#x3B5;&#x3C5;&#x3C6;&#x3C5;&#x3AD;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B7; &#x3AD;&#x3BC;&#x3C0;&#x3BD;&#x3B5;&#x3C5;&#x3C3;&#x3B7; &#x3C0;&#x3AF;&#x3C3;&#x3C9; &#x3B1;&#x3C0;&#x3CC; &#x3B1;&#x3C5;&#x3C4;&#x3CC; &#x3C4;&#x3BF; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC; &#x3B1;&#x3BB;&#x3BB;&#x3AC; &#x3C3;&#x3C4;&#x3B9;&#x3B2;&#x3B1;&#x3C1;&#x3CC; desktop accessory &#x3AE;&#x3C4;&#x3B1;&#x3BD; &#x3BD;&#x3B1; &#x3C0;&#x3B1;&#x3C1;&#x3AD;&#x3C7;&#x3B5;&#x3B9; &#x3BC;&#x3AF;&#x3B1; &#x3B4;&#x3B9;&#x3B1;&#x3BA;&#x3C1;&#x3B9;&#x3C4;&#x3B9;&#x3BA;&#x3AE; &#x3B1;&#x3BB;&#x3BB;&#x3AC; &#x3C0;&#x3B1;&#x3C1;&#x3AC;&#x3BB;&#x3BB;&#x3B7;&#x3BB;&#x3B1; &#x3C0;&#x3C1;&#x3B1;&#x3BA;&#x3C4;&#x3B9;&#x3BA;&#x3AE; &#x3BB;&#x3CD;&#x3C3;&#x3B7;, &#x3C0;&#x3BF;&#x3C5; &#x3BD;&#x3B1; &#x3BC;&#x3C0;&#x3BF;&#x3C1;&#x3B5;&#x3AF; &#x3BD;&#x3B1; &#x3C7;&#x3C1;&#x3B7;&#x3C3;&#x3B9;&#x3BC;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B7;&#x3B8;&#x3B5;&#x3AF; &#x3BF;&#x3C0;&#x3BF;&#x3C5;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3C3;&#x3C4;&#x3BF; &#x3C3;&#x3C0;&#x3AF;&#x3C4;&#x3B9; &#x3AE; &#x3C3;&#x3C4;&#x3BF;&#x3BD; &#x3C7;&#x3CE;&#x3C1;&#x3BF; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3C3;&#x3AF;&#x3B1;&#x3C2;, &#x3C7;&#x3C9;&#x3C1;&#x3AF;&#x3C2; &#x3BD;&#x3B1; &#x3C7;&#x3C1;&#x3B5;&#x3B9;&#x3AC;&#x3B6;&#x3B5;&#x3C4;&#x3B1;&#x3B9; &#x3BD;&#x3B1; &#x3BA;&#x3BF;&#x3BB;&#x3BB;&#x3AE;&#x3C3;&#x3B5;&#x3B9; &#x3AE; &#x3BD;&#x3B1; &#x3B2;&#x3B9;&#x3B4;&#x3C9;&#x3B8;&#x3B5;&#x3AF; &#x3C3;&#x3B5; &#x3AD;&#x3C0;&#x3B9;&#x3C0;&#x3BB;&#x3B1; &#x3AE; &#x3C4;&#x3BF;&#x3AF;&#x3C7;&#x3BF;&#x3C5;&#x3C2;. &#x3A4;&#x3B1; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; &#x3C3;&#x3C5;&#x3B3;&#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3BF;&#x3CD;&#x3BD;&#x3C4;&#x3B1;&#x3B9; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3BF; &#x3BD;&#x3B1; &#x3B3;&#x3BB;&#x3B9;&#x3C3;&#x3C4;&#x3C1;&#x3AE;&#x3C3;&#x3BF;&#x3C5;&#x3BD; &#x3C3;&#x3C4;&#x3BF; &#x3C0;&#x3AC;&#x3C4;&#x3C9;&#x3BC;&#x3B1; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B1; &#x3BA;&#x3B1;&#x3B9; &#x3BC;&#x3B5; &#x3B1;&#x3C3;&#x3C6;&#x3AC;&#x3BB;&#x3B5;&#x3B9;&#x3B1;. &#x391;&#x3C5;&#x3C4;&#x3CC; &#x3C4;&#x3BF; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC; &amp; &#x3C3;&#x3C5;&#x3BC;&#x3C0;&#x3B1;&#x3B3;&#x3AD;&#x3C2; &#x3B2;&#x3B1;&#x3C1;&#x3C5;&#x3B4;&#x3AC;&#x3BA;&#x3B9; &#x3B5;&#x3BA;&#x3BC;&#x3B5;&#x3C4;&#x3B1;&#x3BB;&#x3BB;&#x3B5;&#x3CD;&#x3B5;&#x3C4;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x399;&#x3B1;&#x3C0;&#x3C9;&#x3BD;&#x3B9;&#x3BA;&#x3AE; &#x3C4;&#x3B5;&#x3C7;&#x3BD;&#x3B9;&#x3BA;&#x3AE; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3BF;-&#x3B1;&#x3BD;&#x3B1;&#x3C1;&#x3C1;&#x3CC;&#x3C6;&#x3B7;&#x3C3;&#x3B7;&#x3C2;, &#x3B7; &#x3BF;&#x3C0;&#x3BF;&#x3AF;&#x3B1; &#x3C7;&#x3C9;&#x3C1;&#x3AF;&#x3C2; &#x3C3;&#x3C5;&#x3B3;&#x3BA;&#x3BF;&#x3BB;&#x3BB;&#x3B7;&#x3C4;&#x3B9;&#x3BA;&#x3AC;, &#x3B1;&#x3BD;&#x3C4;&#x3B9;&#x3C3;&#x3C4;&#x3AD;&#x3BA;&#x3B5;&#x3C4;&#x3B1;&#x3B9; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3BF;&#x3BB;&#x3AF;&#x3C3;&#x3B8;&#x3B7;&#x3C3;&#x3B7; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3B9;&#x3C2; &#x3C0;&#x3B5;&#x3C1;&#x3B9;&#x3C3;&#x3C3;&#x3CC;&#x3C4;&#x3B5;&#x3C1;&#x3B5;&#x3C2; &#x3BB;&#x3B5;&#x3AF;&#x3B5;&#x3C2; &#x3B5;&#x3C0;&#x3B9;&#x3C6;&#x3AC;&#x3BD;&#x3B5;&#x3B9;&#x3B5;&#x3C2;, &#x3B1;&#x3BA;&#x3CC;&#x3BC;&#x3B1; &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3BF; &#x3B3;&#x3C5;&#x3B1;&#x3BB;&#x3AF;. &#x39C;&#x3C0;&#x3BF;&#x3C1;&#x3B5;&#x3AF; &#x3BD;&#x3B1; &#x3B5;&#x3C0;&#x3B1;&#x3BD;&#x3B1;&#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B8;&#x3B5;&#x3C4;&#x3B7;&#x3B8;&#x3B5;&#x3AF; &#x3BA;&#x3B1;&#x3B9; &#x3BD;&#x3B1; &#x3B5;&#x3C0;&#x3B1;&#x3BD;&#x3B1;&#x3C7;&#x3C1;&#x3B7;&#x3C3;&#x3B9;&#x3BC;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B7;&#x3B8;&#x3B5;&#x3AF; &#x3CC;&#x3C3;&#x3B5;&#x3C2; &#x3C6;&#x3BF;&#x3C1;&#x3AD;&#x3C2; &#x3B8;&#x3AD;&#x3BB;&#x3B5;&#x3C4;&#x3B5;.</Description><Price>13.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/3/0/305371_10150448895979919_1408232495_n.jpg</Image></product><product><SKU>BL- CBM</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - CableBox Mini</Name><Description>&#x3A4;&#x3BF; CableBox Mini &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC;&#x3C4;&#x3B5;&#x3C1;&#x3B7; &#x3AD;&#x3BA;&#x3B4;&#x3BF;&#x3C3;&#x3B7; &#x3C4;&#x3BF;&#x3C5; &#x3C0;&#x3AC;&#x3BD;&#x3C4;&#x3B1; &#x3B4;&#x3B7;&#x3BC;&#x3BF;&#x3C6;&#x3B9;&#x3BB;&#x3BF;&#x3CD;&#x3C2; CableBox. &#x391;&#x3C5;&#x3C4;&#x3AE; &#x3B7; &#x3BC;&#x3BF;&#x3BD;&#x3AC;&#x3B4;&#x3B1; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B2;&#x3BF;&#x3BB;&#x3B9;&#x3BA;&#x3AE; &#x3B3;&#x3B9;&#x3B1; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC;&#x3C4;&#x3B5;&#x3C1;&#x3B5;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3C4;&#x3AC;&#x3B4;&#x3B5;&#x3C2; &#x3BA;&#x3B1;&#x3BB;&#x3C9;&#x3B4;&#x3AF;&#x3C9;&#x3BD;.&#xD;
&#x395;&#x3C0;&#x3B9;&#x3C0;&#x3BB;&#x3AD;&#x3BF;&#x3BD;, &#x3C4;&#x3BF; CableBox Mini &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B9;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3CC;  &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BA;&#x3C1;&#x3CD;&#x3B2;&#x3B5;&#x3B9; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3C4;&#x3AD;&#x3C2;, &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; router &#x3BA;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3AC; &#x3BC;&#x3CC;&#x3BD;&#x3C4;&#x3B5;&#x3BC;. &#x391;&#x3C5;&#x3C4;&#x3AE; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x3B1;&#x3C0;&#x3BB;&#x3AE; &#x3BB;&#x3CD;&#x3C3;&#x3B7;, &#x3B9;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3AE; &#x3B3;&#x3B9;&#x3B1; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3BF;&#x3CD;&#x3C2; &#x3C7;&#x3CE;&#x3C1;&#x3BF;&#x3C5;&#x3C2; &#x3BC;&#x3B5; &#x3BC;&#x3B5;&#x3B3;&#x3AC;&#x3BB;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3B2;&#x3BB;&#x3AE;&#x3BC;&#x3B1;&#x3C4;&#x3B1;. &#x39A;&#x3B1;&#x3C4;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3C5;&#x3C4;&#x3CC; &#x3B1;&#x3C0;&#x3CC; &#x3C0;&#x3BB;&#x3B1;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3B5;&#x3C0;&#x3B9;&#x3B2;&#x3C1;&#x3B1;&#x3B4;&#x3C5;&#x3BD;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3C6;&#x3C9;&#x3C4;&#x3B9;&#x3AC;&#x3C2;.&#xD;
</Description><Price>19.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/c/b/cbm_018_1.jpg</Image></product><product><SKU>BL-CBM-WH</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - CableBox Mini - White</Name><Description>&#x3A4;&#x3BF; CableBox Mini &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC;&#x3C4;&#x3B5;&#x3C1;&#x3B7; &#x3AD;&#x3BA;&#x3B4;&#x3BF;&#x3C3;&#x3B7; &#x3C4;&#x3BF;&#x3C5; &#x3C0;&#x3AC;&#x3BD;&#x3C4;&#x3B1; &#x3B4;&#x3B7;&#x3BC;&#x3BF;&#x3C6;&#x3B9;&#x3BB;&#x3BF;&#x3CD;&#x3C2; CableBox. &#x391;&#x3C5;&#x3C4;&#x3AE; &#x3B7; &#x3BC;&#x3BF;&#x3BD;&#x3AC;&#x3B4;&#x3B1; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B2;&#x3BF;&#x3BB;&#x3B9;&#x3BA;&#x3AE; &#x3B3;&#x3B9;&#x3B1; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC;&#x3C4;&#x3B5;&#x3C1;&#x3B5;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3C4;&#x3AC;&#x3B4;&#x3B5;&#x3C2; &#x3BA;&#x3B1;&#x3BB;&#x3C9;&#x3B4;&#x3AF;&#x3C9;&#x3BD;.&#xD;
&#x395;&#x3C0;&#x3B9;&#x3C0;&#x3BB;&#x3AD;&#x3BF;&#x3BD;, &#x3C4;&#x3BF; CableBox Mini &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B9;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3CC; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BA;&#x3C1;&#x3CD;&#x3B2;&#x3B5;&#x3B9; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3C4;&#x3AD;&#x3C2;, &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; router &#x3BA;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3AC; &#x3BC;&#x3CC;&#x3BD;&#x3C4;&#x3B5;&#x3BC;. &#x391;&#x3C5;&#x3C4;&#x3AE; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x3B1;&#x3C0;&#x3BB;&#x3AE; &#x3BB;&#x3CD;&#x3C3;&#x3B7;, &#x3B9;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3AE; &#x3B3;&#x3B9;&#x3B1; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3BF;&#x3CD;&#x3C2; &#x3C7;&#x3CE;&#x3C1;&#x3BF;&#x3C5;&#x3C2; &#x3BC;&#x3B5; &#x3BC;&#x3B5;&#x3B3;&#x3AC;&#x3BB;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3B2;&#x3BB;&#x3AE;&#x3BC;&#x3B1;&#x3C4;&#x3B1;. &#x39A;&#x3B1;&#x3C4;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3C5;&#x3C4;&#x3CC; &#x3B1;&#x3C0;&#x3CC; &#x3C0;&#x3BB;&#x3B1;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3B5;&#x3C0;&#x3B9;&#x3B2;&#x3C1;&#x3B1;&#x3B4;&#x3C5;&#x3BD;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3C6;&#x3C9;&#x3C4;&#x3B9;&#x3AC;&#x3C2;.</Description><Price>19.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/1/9/198240_10150998996359919_286696854_n.jpg</Image></product><product><SKU>BL-CBM-BK</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - CableBox Mini - Black</Name><Description>&#x3A4;&#x3BF; CableBox Mini &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC;&#x3C4;&#x3B5;&#x3C1;&#x3B7; &#x3AD;&#x3BA;&#x3B4;&#x3BF;&#x3C3;&#x3B7; &#x3C4;&#x3BF;&#x3C5; &#x3C0;&#x3AC;&#x3BD;&#x3C4;&#x3B1; &#x3B4;&#x3B7;&#x3BC;&#x3BF;&#x3C6;&#x3B9;&#x3BB;&#x3BF;&#x3CD;&#x3C2; CableBox. &#x391;&#x3C5;&#x3C4;&#x3AE; &#x3B7; &#x3BC;&#x3BF;&#x3BD;&#x3AC;&#x3B4;&#x3B1; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B2;&#x3BF;&#x3BB;&#x3B9;&#x3BA;&#x3AE; &#x3B3;&#x3B9;&#x3B1; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC;&#x3C4;&#x3B5;&#x3C1;&#x3B5;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3C4;&#x3AC;&#x3B4;&#x3B5;&#x3C2; &#x3BA;&#x3B1;&#x3BB;&#x3C9;&#x3B4;&#x3AF;&#x3C9;&#x3BD;.&#xD;
&#x395;&#x3C0;&#x3B9;&#x3C0;&#x3BB;&#x3AD;&#x3BF;&#x3BD;, &#x3C4;&#x3BF; CableBox Mini &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B9;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3CC; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BA;&#x3C1;&#x3CD;&#x3B2;&#x3B5;&#x3B9; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3C4;&#x3AD;&#x3C2;, &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; router &#x3BA;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3AC; &#x3BC;&#x3CC;&#x3BD;&#x3C4;&#x3B5;&#x3BC;. &#x391;&#x3C5;&#x3C4;&#x3AE; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x3B1;&#x3C0;&#x3BB;&#x3AE; &#x3BB;&#x3CD;&#x3C3;&#x3B7;, &#x3B9;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3AE; &#x3B3;&#x3B9;&#x3B1; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3BF;&#x3CD;&#x3C2; &#x3C7;&#x3CE;&#x3C1;&#x3BF;&#x3C5;&#x3C2; &#x3BC;&#x3B5; &#x3BC;&#x3B5;&#x3B3;&#x3AC;&#x3BB;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3B2;&#x3BB;&#x3AE;&#x3BC;&#x3B1;&#x3C4;&#x3B1;. &#x39A;&#x3B1;&#x3C4;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3C5;&#x3C4;&#x3CC; &#x3B1;&#x3C0;&#x3CC; &#x3C0;&#x3BB;&#x3B1;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3B5;&#x3C0;&#x3B9;&#x3B2;&#x3C1;&#x3B1;&#x3B4;&#x3C5;&#x3BD;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3C6;&#x3C9;&#x3C4;&#x3B9;&#x3AC;&#x3C2;.</Description><Price>19.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/5/5/556520_10151001076404919_370387658_n.jpg</Image></product><product><SKU>BL-CBM-BLU</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - CableBox Mini - Blue</Name><Description>&#x3A4;&#x3BF; CableBox Mini &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC;&#x3C4;&#x3B5;&#x3C1;&#x3B7; &#x3AD;&#x3BA;&#x3B4;&#x3BF;&#x3C3;&#x3B7; &#x3C4;&#x3BF;&#x3C5; &#x3C0;&#x3AC;&#x3BD;&#x3C4;&#x3B1; &#x3B4;&#x3B7;&#x3BC;&#x3BF;&#x3C6;&#x3B9;&#x3BB;&#x3BF;&#x3CD;&#x3C2; CableBox. &#x391;&#x3C5;&#x3C4;&#x3AE; &#x3B7; &#x3BC;&#x3BF;&#x3BD;&#x3AC;&#x3B4;&#x3B1; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B2;&#x3BF;&#x3BB;&#x3B9;&#x3BA;&#x3AE; &#x3B3;&#x3B9;&#x3B1; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC;&#x3C4;&#x3B5;&#x3C1;&#x3B5;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3C4;&#x3AC;&#x3B4;&#x3B5;&#x3C2; &#x3BA;&#x3B1;&#x3BB;&#x3C9;&#x3B4;&#x3AF;&#x3C9;&#x3BD;.&#xD;
&#x395;&#x3C0;&#x3B9;&#x3C0;&#x3BB;&#x3AD;&#x3BF;&#x3BD;, &#x3C4;&#x3BF; CableBox Mini &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B9;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3CC; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BA;&#x3C1;&#x3CD;&#x3B2;&#x3B5;&#x3B9; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3C4;&#x3AD;&#x3C2;, &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; router &#x3BA;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3AC; &#x3BC;&#x3CC;&#x3BD;&#x3C4;&#x3B5;&#x3BC;. &#x391;&#x3C5;&#x3C4;&#x3AE; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x3B1;&#x3C0;&#x3BB;&#x3AE; &#x3BB;&#x3CD;&#x3C3;&#x3B7;, &#x3B9;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3AE; &#x3B3;&#x3B9;&#x3B1; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3BF;&#x3CD;&#x3C2; &#x3C7;&#x3CE;&#x3C1;&#x3BF;&#x3C5;&#x3C2; &#x3BC;&#x3B5; &#x3BC;&#x3B5;&#x3B3;&#x3AC;&#x3BB;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3B2;&#x3BB;&#x3AE;&#x3BC;&#x3B1;&#x3C4;&#x3B1;. &#x39A;&#x3B1;&#x3C4;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3C5;&#x3C4;&#x3CC; &#x3B1;&#x3C0;&#x3CC; &#x3C0;&#x3BB;&#x3B1;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3B5;&#x3C0;&#x3B9;&#x3B2;&#x3C1;&#x3B1;&#x3B4;&#x3C5;&#x3BD;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3C6;&#x3C9;&#x3C4;&#x3B9;&#x3AC;&#x3C2;.</Description><Price>19.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/5/9/598443_10150998996204919_1293348878_n.jpg</Image></product><product><SKU>BL-CBM-YL</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - CableBox Mini - Yellow</Name><Description>&#x3A4;&#x3BF; CableBox Mini &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC;&#x3C4;&#x3B5;&#x3C1;&#x3B7; &#x3AD;&#x3BA;&#x3B4;&#x3BF;&#x3C3;&#x3B7; &#x3C4;&#x3BF;&#x3C5; &#x3C0;&#x3AC;&#x3BD;&#x3C4;&#x3B1; &#x3B4;&#x3B7;&#x3BC;&#x3BF;&#x3C6;&#x3B9;&#x3BB;&#x3BF;&#x3CD;&#x3C2; CableBox. &#x391;&#x3C5;&#x3C4;&#x3AE; &#x3B7; &#x3BC;&#x3BF;&#x3BD;&#x3AC;&#x3B4;&#x3B1; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B2;&#x3BF;&#x3BB;&#x3B9;&#x3BA;&#x3AE; &#x3B3;&#x3B9;&#x3B1; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC;&#x3C4;&#x3B5;&#x3C1;&#x3B5;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3C4;&#x3AC;&#x3B4;&#x3B5;&#x3C2; &#x3BA;&#x3B1;&#x3BB;&#x3C9;&#x3B4;&#x3AF;&#x3C9;&#x3BD;.&#xD;
&#x395;&#x3C0;&#x3B9;&#x3C0;&#x3BB;&#x3AD;&#x3BF;&#x3BD;, &#x3C4;&#x3BF; CableBox Mini &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B9;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3CC; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BA;&#x3C1;&#x3CD;&#x3B2;&#x3B5;&#x3B9; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3C4;&#x3AD;&#x3C2;, &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; router &#x3BA;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3AC; &#x3BC;&#x3CC;&#x3BD;&#x3C4;&#x3B5;&#x3BC;. &#x391;&#x3C5;&#x3C4;&#x3AE; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x3B1;&#x3C0;&#x3BB;&#x3AE; &#x3BB;&#x3CD;&#x3C3;&#x3B7;, &#x3B9;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3AE; &#x3B3;&#x3B9;&#x3B1; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3BF;&#x3CD;&#x3C2; &#x3C7;&#x3CE;&#x3C1;&#x3BF;&#x3C5;&#x3C2; &#x3BC;&#x3B5; &#x3BC;&#x3B5;&#x3B3;&#x3AC;&#x3BB;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3B2;&#x3BB;&#x3AE;&#x3BC;&#x3B1;&#x3C4;&#x3B1;. &#x39A;&#x3B1;&#x3C4;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3C5;&#x3C4;&#x3CC; &#x3B1;&#x3C0;&#x3CC; &#x3C0;&#x3BB;&#x3B1;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3B5;&#x3C0;&#x3B9;&#x3B2;&#x3C1;&#x3B1;&#x3B4;&#x3C5;&#x3BD;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3C6;&#x3C9;&#x3C4;&#x3B9;&#x3AC;&#x3C2;.</Description><Price>19.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/5/6/564773_10150998996394919_1200964524_n.jpg</Image></product><product><SKU>BL-CBM-GR</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - CableBox Mini - Green</Name><Description>&#x3A4;&#x3BF; CableBox Mini &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC;&#x3C4;&#x3B5;&#x3C1;&#x3B7; &#x3AD;&#x3BA;&#x3B4;&#x3BF;&#x3C3;&#x3B7; &#x3C4;&#x3BF;&#x3C5; &#x3C0;&#x3AC;&#x3BD;&#x3C4;&#x3B1; &#x3B4;&#x3B7;&#x3BC;&#x3BF;&#x3C6;&#x3B9;&#x3BB;&#x3BF;&#x3CD;&#x3C2; CableBox. &#x391;&#x3C5;&#x3C4;&#x3AE; &#x3B7; &#x3BC;&#x3BF;&#x3BD;&#x3AC;&#x3B4;&#x3B1; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B2;&#x3BF;&#x3BB;&#x3B9;&#x3BA;&#x3AE; &#x3B3;&#x3B9;&#x3B1; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC;&#x3C4;&#x3B5;&#x3C1;&#x3B5;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3C4;&#x3AC;&#x3B4;&#x3B5;&#x3C2; &#x3BA;&#x3B1;&#x3BB;&#x3C9;&#x3B4;&#x3AF;&#x3C9;&#x3BD;.&#xD;
&#x395;&#x3C0;&#x3B9;&#x3C0;&#x3BB;&#x3AD;&#x3BF;&#x3BD;, &#x3C4;&#x3BF; CableBox Mini &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B9;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3CC; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BA;&#x3C1;&#x3CD;&#x3B2;&#x3B5;&#x3B9; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3C4;&#x3AD;&#x3C2;, &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; router &#x3BA;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3AC; &#x3BC;&#x3CC;&#x3BD;&#x3C4;&#x3B5;&#x3BC;. &#x391;&#x3C5;&#x3C4;&#x3AE; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x3B1;&#x3C0;&#x3BB;&#x3AE; &#x3BB;&#x3CD;&#x3C3;&#x3B7;, &#x3B9;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3AE; &#x3B3;&#x3B9;&#x3B1; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3BF;&#x3CD;&#x3C2; &#x3C7;&#x3CE;&#x3C1;&#x3BF;&#x3C5;&#x3C2; &#x3BC;&#x3B5; &#x3BC;&#x3B5;&#x3B3;&#x3AC;&#x3BB;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3B2;&#x3BB;&#x3AE;&#x3BC;&#x3B1;&#x3C4;&#x3B1;. &#x39A;&#x3B1;&#x3C4;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3C5;&#x3C4;&#x3CC; &#x3B1;&#x3C0;&#x3CC; &#x3C0;&#x3BB;&#x3B1;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3B5;&#x3C0;&#x3B9;&#x3B2;&#x3C1;&#x3B1;&#x3B4;&#x3C5;&#x3BD;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3C6;&#x3C9;&#x3C4;&#x3B9;&#x3AC;&#x3C2;.</Description><Price>19.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/5/5/555317_10150998996254919_1811836455_n.jpg</Image></product><product><SKU>BL-CBM-OR</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - CableBox Mini - Orange</Name><Description>&#x3A4;&#x3BF; CableBox Mini &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC;&#x3C4;&#x3B5;&#x3C1;&#x3B7; &#x3AD;&#x3BA;&#x3B4;&#x3BF;&#x3C3;&#x3B7; &#x3C4;&#x3BF;&#x3C5; &#x3C0;&#x3AC;&#x3BD;&#x3C4;&#x3B1; &#x3B4;&#x3B7;&#x3BC;&#x3BF;&#x3C6;&#x3B9;&#x3BB;&#x3BF;&#x3CD;&#x3C2; CableBox. &#x391;&#x3C5;&#x3C4;&#x3AE; &#x3B7; &#x3BC;&#x3BF;&#x3BD;&#x3AC;&#x3B4;&#x3B1; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B2;&#x3BF;&#x3BB;&#x3B9;&#x3BA;&#x3AE; &#x3B3;&#x3B9;&#x3B1; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC;&#x3C4;&#x3B5;&#x3C1;&#x3B5;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3C4;&#x3AC;&#x3B4;&#x3B5;&#x3C2; &#x3BA;&#x3B1;&#x3BB;&#x3C9;&#x3B4;&#x3AF;&#x3C9;&#x3BD;.&#xD;
&#x395;&#x3C0;&#x3B9;&#x3C0;&#x3BB;&#x3AD;&#x3BF;&#x3BD;, &#x3C4;&#x3BF; CableBox Mini &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B9;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3CC; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BA;&#x3C1;&#x3CD;&#x3B2;&#x3B5;&#x3B9; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3C4;&#x3AD;&#x3C2;, &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; router &#x3BA;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3AC; &#x3BC;&#x3CC;&#x3BD;&#x3C4;&#x3B5;&#x3BC;. &#x391;&#x3C5;&#x3C4;&#x3AE; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x3B1;&#x3C0;&#x3BB;&#x3AE; &#x3BB;&#x3CD;&#x3C3;&#x3B7;, &#x3B9;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3AE; &#x3B3;&#x3B9;&#x3B1; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3BF;&#x3CD;&#x3C2; &#x3C7;&#x3CE;&#x3C1;&#x3BF;&#x3C5;&#x3C2; &#x3BC;&#x3B5; &#x3BC;&#x3B5;&#x3B3;&#x3AC;&#x3BB;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3B2;&#x3BB;&#x3AE;&#x3BC;&#x3B1;&#x3C4;&#x3B1;. &#x39A;&#x3B1;&#x3C4;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3C5;&#x3C4;&#x3CC; &#x3B1;&#x3C0;&#x3CC; &#x3C0;&#x3BB;&#x3B1;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3B5;&#x3C0;&#x3B9;&#x3B2;&#x3C1;&#x3B1;&#x3B4;&#x3C5;&#x3BD;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3C6;&#x3C9;&#x3C4;&#x3B9;&#x3AC;&#x3C2;.</Description><Price>19.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/1/9/196048_10150998996279919_445023359_n.jpg</Image></product><product><SKU>BL-CBM-PNK</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - CableBox Mini - Pink</Name><Description>&#x3A4;&#x3BF; CableBox Mini &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC;&#x3C4;&#x3B5;&#x3C1;&#x3B7; &#x3AD;&#x3BA;&#x3B4;&#x3BF;&#x3C3;&#x3B7; &#x3C4;&#x3BF;&#x3C5; &#x3C0;&#x3AC;&#x3BD;&#x3C4;&#x3B1; &#x3B4;&#x3B7;&#x3BC;&#x3BF;&#x3C6;&#x3B9;&#x3BB;&#x3BF;&#x3CD;&#x3C2; CableBox. &#x391;&#x3C5;&#x3C4;&#x3AE; &#x3B7; &#x3BC;&#x3BF;&#x3BD;&#x3AC;&#x3B4;&#x3B1; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B2;&#x3BF;&#x3BB;&#x3B9;&#x3BA;&#x3AE; &#x3B3;&#x3B9;&#x3B1; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC;&#x3C4;&#x3B5;&#x3C1;&#x3B5;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3C4;&#x3AC;&#x3B4;&#x3B5;&#x3C2; &#x3BA;&#x3B1;&#x3BB;&#x3C9;&#x3B4;&#x3AF;&#x3C9;&#x3BD;.&#xD;
&#x395;&#x3C0;&#x3B9;&#x3C0;&#x3BB;&#x3AD;&#x3BF;&#x3BD;, &#x3C4;&#x3BF; CableBox Mini &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B9;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3CC; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BA;&#x3C1;&#x3CD;&#x3B2;&#x3B5;&#x3B9; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3C4;&#x3AD;&#x3C2;, &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; router &#x3BA;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3AC; &#x3BC;&#x3CC;&#x3BD;&#x3C4;&#x3B5;&#x3BC;. &#x391;&#x3C5;&#x3C4;&#x3AE; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x3B1;&#x3C0;&#x3BB;&#x3AE; &#x3BB;&#x3CD;&#x3C3;&#x3B7;, &#x3B9;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3AE; &#x3B3;&#x3B9;&#x3B1; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3BF;&#x3CD;&#x3C2; &#x3C7;&#x3CE;&#x3C1;&#x3BF;&#x3C5;&#x3C2; &#x3BC;&#x3B5; &#x3BC;&#x3B5;&#x3B3;&#x3AC;&#x3BB;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3B2;&#x3BB;&#x3AE;&#x3BC;&#x3B1;&#x3C4;&#x3B1;. &#x39A;&#x3B1;&#x3C4;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3C5;&#x3C4;&#x3CC; &#x3B1;&#x3C0;&#x3CC; &#x3C0;&#x3BB;&#x3B1;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3B5;&#x3C0;&#x3B9;&#x3B2;&#x3C1;&#x3B1;&#x3B4;&#x3C5;&#x3BD;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3C6;&#x3C9;&#x3C4;&#x3B9;&#x3AC;&#x3C2;.</Description><Price>19.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/5/2/522327_10150998996334919_2034159471_n.jpg</Image></product><product><SKU>BL-CB</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - CableBox</Name><Description>&#x3A4;&#x3BF; CableBox &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B7; &#x3BB;&#x3CD;&#x3C3;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BA;&#x3C1;&#x3CD;&#x3C8;&#x3B5;&#x3C4;&#x3B5; &#x3B1;&#x3BA;&#x3B1;&#x3C4;&#x3AC;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B1;, &#x3C7;&#x3B1;&#x3BB;&#x3B1;&#x3C1;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3BC;&#x3C0;&#x3B5;&#x3C1;&#x3B4;&#x3B5;&#x3BC;&#x3AD;&#x3BD;&#x3B1; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; &#x3BA;&#x3AC;&#x3C4;&#x3C9; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3BF; &#x3B3;&#x3C1;&#x3B1;&#x3C6;&#x3B5;&#x3AF;&#x3BF;, &#x3B4;&#x3AF;&#x3C0;&#x3BB;&#x3B1; &#x3C3;&#x3C4;&#x3BF;&#x3BD; &#x3C5;&#x3C0;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B9;&#x3C3;&#x3C4;&#x3AE;, &#x3AE; &#x3C0;&#x3AF;&#x3C3;&#x3C9; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3B7;&#x3BD; &#x3C4;&#x3B7;&#x3BB;&#x3B5;&#x3CC;&#x3C1;&#x3B1;&#x3C3;&#x3B7;. &#x3A4;&#x3BF;&#x3C0;&#x3BF;&#x3B8;&#x3B5;&#x3C4;&#x3AE;&#x3C3;&#x3C4;&#x3B5; &#x3C4;&#x3BF; &#x3C0;&#x3BF;&#x3BB;&#x3CD;&#x3C0;&#x3C1;&#x3B9;&#x3B6;&#x3CC; &#x3C3;&#x3B1;&#x3C2; &#x3C3;&#x3C4;&#x3BF; &#x3B5;&#x3C3;&#x3C9;&#x3C4;&#x3B5;&#x3C1;&#x3B9;&#x3BA;&#x3CC; &#x3C4;&#x3BF;&#x3C5; CableBox, &#x3C6;&#x3C4;&#x3B9;&#x3B1;&#x3B3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3B1;&#x3C0;&#x3CC; &#x3B5;&#x3C0;&#x3B9;&#x3B2;&#x3C1;&#x3B1;&#x3B4;&#x3C5;&#x3BD;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3C6;&#x3C9;&#x3C4;&#x3B9;&#x3AC;&#x3C2;, &#x3B2;&#x3AC;&#x3BB;&#x3C4;&#x3B5; &#x3BC;&#x3AD;&#x3C3;&#x3B1; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3BF;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3C0;&#x3BB;&#x3B5;&#x3CC;&#x3BD;&#x3B1;&#x3C3;&#x3BC;&#x3B1; &#x3BA;&#x3B1;&#x3BB;&#x3C9;&#x3B4;&#x3AF;&#x3BF;&#x3C5;, &#x3BA;&#x3BB;&#x3B5;&#x3AF;&#x3C3;&#x3C4;&#x3B5; &#x3C4;&#x3BF; &#x3BA;&#x3B1;&#x3C0;&#x3AC;&#x3BA;&#x3B9; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3AD;&#x3BB;&#x3BF;&#x3C2;!&#xD;
</Description><Price>32.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/c/b/cb_010.jpg</Image></product><product><SKU>BL-CB-WH</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - CableBox - White</Name><Description>&#x3A4;&#x3BF; CableBox &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B7; &#x3BB;&#x3CD;&#x3C3;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BA;&#x3C1;&#x3CD;&#x3C8;&#x3B5;&#x3C4;&#x3B5; &#x3B1;&#x3BA;&#x3B1;&#x3C4;&#x3AC;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B1;, &#x3C7;&#x3B1;&#x3BB;&#x3B1;&#x3C1;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3BC;&#x3C0;&#x3B5;&#x3C1;&#x3B4;&#x3B5;&#x3BC;&#x3AD;&#x3BD;&#x3B1; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; &#x3BA;&#x3AC;&#x3C4;&#x3C9; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3BF; &#x3B3;&#x3C1;&#x3B1;&#x3C6;&#x3B5;&#x3AF;&#x3BF;, &#x3B4;&#x3AF;&#x3C0;&#x3BB;&#x3B1; &#x3C3;&#x3C4;&#x3BF;&#x3BD; &#x3C5;&#x3C0;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B9;&#x3C3;&#x3C4;&#x3AE; &#x3AE; &#x3C0;&#x3AF;&#x3C3;&#x3C9; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3B7;&#x3BD; &#x3C4;&#x3B7;&#x3BB;&#x3B5;&#x3CC;&#x3C1;&#x3B1;&#x3C3;&#x3B7;. &#x3A4;&#x3BF;&#x3C0;&#x3BF;&#x3B8;&#x3B5;&#x3C4;&#x3AE;&#x3C3;&#x3C4;&#x3B5; &#x3C4;&#x3BF; &#x3C0;&#x3BF;&#x3BB;&#x3CD;&#x3C0;&#x3C1;&#x3B9;&#x3B6;&#x3CC; &#x3C3;&#x3B1;&#x3C2; &#x3C3;&#x3C4;&#x3BF; &#x3B5;&#x3C3;&#x3C9;&#x3C4;&#x3B5;&#x3C1;&#x3B9;&#x3BA;&#x3CC; &#x3C4;&#x3BF;&#x3C5; CableBox,&#xD;
&#x3C6;&#x3C4;&#x3B9;&#x3B1;&#x3B3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3B1;&#x3C0;&#x3CC; &#x3B5;&#x3C0;&#x3B9;&#x3B2;&#x3C1;&#x3B1;&#x3B4;&#x3C5;&#x3BD;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3C6;&#x3C9;&#x3C4;&#x3B9;&#x3AC;&#x3C2;, &#x3B2;&#x3AC;&#x3BB;&#x3C4;&#x3B5; &#x3BC;&#x3AD;&#x3C3;&#x3B1; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3BF;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3C0;&#x3BB;&#x3B5;&#x3CC;&#x3BD;&#x3B1;&#x3C3;&#x3BC;&#x3B1; &#x3BA;&#x3B1;&#x3BB;&#x3C9;&#x3B4;&#x3AF;&#x3BF;&#x3C5;, &#x3BA;&#x3BB;&#x3B5;&#x3AF;&#x3C3;&#x3C4;&#x3B5; &#x3C4;&#x3BF; &#x3BA;&#x3B1;&#x3C0;&#x3AC;&#x3BA;&#x3B9; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3AD;&#x3BB;&#x3BF;&#x3C2;!</Description><Price>32.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/c/b/cb_001_3.jpg</Image></product><product><SKU>BL-CB-BK</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - CableBox - Black</Name><Description>&#x3A4;&#x3BF; CableBox &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B7; &#x3BB;&#x3CD;&#x3C3;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BA;&#x3C1;&#x3CD;&#x3C8;&#x3B5;&#x3C4;&#x3B5; &#x3B1;&#x3BA;&#x3B1;&#x3C4;&#x3AC;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B1;, &#x3C7;&#x3B1;&#x3BB;&#x3B1;&#x3C1;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3BC;&#x3C0;&#x3B5;&#x3C1;&#x3B4;&#x3B5;&#x3BC;&#x3AD;&#x3BD;&#x3B1;&#xD;
&#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; &#x3BA;&#x3AC;&#x3C4;&#x3C9; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3BF; &#x3B3;&#x3C1;&#x3B1;&#x3C6;&#x3B5;&#x3AF;&#x3BF;, &#x3B4;&#x3AF;&#x3C0;&#x3BB;&#x3B1; &#x3C3;&#x3C4;&#x3BF;&#x3BD; &#x3C5;&#x3C0;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B9;&#x3C3;&#x3C4;&#x3AE; &#x3AE; &#x3C0;&#x3AF;&#x3C3;&#x3C9; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3B7;&#x3BD;&#xD;
&#x3C4;&#x3B7;&#x3BB;&#x3B5;&#x3CC;&#x3C1;&#x3B1;&#x3C3;&#x3B7;. &#x3A4;&#x3BF;&#x3C0;&#x3BF;&#x3B8;&#x3B5;&#x3C4;&#x3AE;&#x3C3;&#x3C4;&#x3B5; &#x3C4;&#x3BF; &#x3C0;&#x3BF;&#x3BB;&#x3CD;&#x3C0;&#x3C1;&#x3B9;&#x3B6;&#x3CC; &#x3C3;&#x3B1;&#x3C2; &#x3C3;&#x3C4;&#x3BF; &#x3B5;&#x3C3;&#x3C9;&#x3C4;&#x3B5;&#x3C1;&#x3B9;&#x3BA;&#x3CC; &#x3C4;&#x3BF;&#x3C5; CableBox,&#xD;
&#x3C6;&#x3C4;&#x3B9;&#x3B1;&#x3B3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3B1;&#x3C0;&#x3CC; &#x3B5;&#x3C0;&#x3B9;&#x3B2;&#x3C1;&#x3B1;&#x3B4;&#x3C5;&#x3BD;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3C6;&#x3C9;&#x3C4;&#x3B9;&#x3AC;&#x3C2;, &#x3B2;&#x3AC;&#x3BB;&#x3C4;&#x3B5; &#x3BC;&#x3AD;&#x3C3;&#x3B1; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3BF;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3C0;&#x3BB;&#x3B5;&#x3CC;&#x3BD;&#x3B1;&#x3C3;&#x3BC;&#x3B1;&#xD;
&#x3BA;&#x3B1;&#x3BB;&#x3C9;&#x3B4;&#x3AF;&#x3BF;&#x3C5;, &#x3BA;&#x3BB;&#x3B5;&#x3AF;&#x3C3;&#x3C4;&#x3B5; &#x3C4;&#x3BF; &#x3BA;&#x3B1;&#x3C0;&#x3AC;&#x3BA;&#x3B9; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3AD;&#x3BB;&#x3BF;&#x3C2;!</Description><Price>32.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/2/9/291_20892809918_808_n.jpg</Image></product><product><SKU>BL-CC-SM</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - CableClip - Small</Name><Description>&#x3A4;&#x3B1; CableClips &#x3BA;&#x3AC;&#x3BD;&#x3BF;&#x3C5;&#x3BD; &#x3C4;&#x3B7;&#x3BD; &#x3B1;&#x3C0;&#x3BF;&#x3B8;&#x3AE;&#x3BA;&#x3B5;&#x3C5;&#x3C3;&#x3B7; &#x3C4;&#x3C9;&#x3BD; &#x3BA;&#x3B1;&#x3BB;&#x3C9;&#x3B4;&#x3AF;&#x3C9;&#x3BD; &#x3C3;&#x3B1;&#x3C2; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B7; &#x3BA;&#x3B1;&#x3B9; &#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3B4;&#x3B1;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AE;. &#x393;&#x3C1;&#x3AE;&#x3B3;&#x3BF;&#x3C1;&#x3B1; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B8;&#x3AD;&#x3C4;&#x3B7;&#x3C3;&#x3B7;, &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AC;&#x3BD;&#x3B5; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3BF;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3BF; &#x3C3;&#x3B5; &#x3AD;&#x3BD;&#x3B1; &#x3B2;&#x3BF;&#x3BB;&#x3B9;&#x3BA;&#x3CC; &#x3BA;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC; &#x3C0;&#x3B1;&#x3BA;&#x3AD;&#x3C4;&#x3BF;. &#x38C;&#x3C4;&#x3B1;&#x3BD; &#x3C7;&#x3C1;&#x3B5;&#x3B9;&#x3B1;&#x3C3;&#x3C4;&#x3B5;&#x3AF;, &#x3C4;&#x3BF; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3BF; &#x3BC;&#x3C0;&#x3BF;&#x3C1;&#x3B5;&#x3AF; &#x3B5;&#x3AF;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3B5;&#x3C0;&#x3B5;&#x3BA;&#x3C4;&#x3B1;&#x3B8;&#x3B5;&#x3AF; &#x3BC;&#x3B5;&#x3C1;&#x3B9;&#x3BA;&#x3CE;&#x3C2;, &#x3AE; &#x3BD;&#x3B1; &#x3B1;&#x3C0;&#x3B5;&#x3BB;&#x3B5;&#x3C5;&#x3B8;&#x3B5;&#x3C1;&#x3C9;&#x3B8;&#x3B5;&#x3AF; &#x3BF;&#x3BB;&#x3CC;&#x3BA;&#x3BB;&#x3B7;&#x3C1;&#x3BF; &#x3BC;&#x3BF;&#x3BD;&#x3BF;&#x3BC;&#x3B9;&#x3AC;&#x3C2;. &#x399;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3CC; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3BD;&#xD;
&#x3B1;&#x3C0;&#x3BF;&#x3B8;&#x3AE;&#x3BA;&#x3B5;&#x3C5;&#x3C3;&#x3B7; &#x3BA;&#x3B1;&#x3BB;&#x3C9;&#x3B4;&#x3AF;&#x3C9;&#x3BD; &#x3BC;&#x3B5; &#x3C0;&#x3BB;&#x3B5;&#x3CC;&#x3BD;&#x3B1;&#x3C3;&#x3BC;&#x3B1;, &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B1;&#x3BE;&#x3AF;&#x3B4;&#x3B9;&#x3B1; &#x3B5;&#x3C0;&#x3B1;&#x3B3;&#x3B3;&#x3B5;&#x3BB;&#x3BC;&#x3B1;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3BD;&#x3B1;&#x3C8;&#x3C5;&#x3C7;&#x3AE;&#x3C2;, &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3B4;&#x3B9;&#x3B1;&#x3C4;&#x3B7;&#x3C1;&#x3BF;&#x3CD;&#x3BD;&#x3C4;&#x3B1;&#x3B9; &#x3C4;&#x3B1; &#x3BC;&#x3B1;&#x3BA;&#x3C1;&#x3B9;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3BA;&#x3C1;&#x3B5;&#x3BC;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3B1; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3AC; &#x3C3;&#x3B1;&#x3C2; &#x3C3;&#x3B5; &#x3C4;&#x3AC;&#x3BE;&#x3B7;, &#x3BA;&#x3B1;&#x3B8;&#x3B1;&#x3C1;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3C3;&#x3C6;&#x3B1;&#x3BB;&#x3AE;.</Description><Price>12.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/c/c/cc_010.jpg</Image></product><product><SKU>BL-CC</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - CableClip</Name><Description>&#x3A4;&#x3B1; CableClips &#x3BA;&#x3AC;&#x3BD;&#x3BF;&#x3C5;&#x3BD; &#x3C4;&#x3B7;&#x3BD; &#x3B1;&#x3C0;&#x3BF;&#x3B8;&#x3AE;&#x3BA;&#x3B5;&#x3C5;&#x3C3;&#x3B7; &#x3C4;&#x3C9;&#x3BD; &#x3BA;&#x3B1;&#x3BB;&#x3C9;&#x3B4;&#x3AF;&#x3C9;&#x3BD; &#x3C3;&#x3B1;&#x3C2; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B7; &#x3BA;&#x3B1;&#x3B9; &#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3B4;&#x3B1;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AE;. &#x393;&#x3C1;&#x3AE;&#x3B3;&#x3BF;&#x3C1;&#x3B1; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B8;&#x3AD;&#x3C4;&#x3B7;&#x3C3;&#x3B7;, &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AC;&#x3BD;&#x3B5; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3BF;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3BF; &#x3C3;&#x3B5; &#x3AD;&#x3BD;&#x3B1; &#x3B2;&#x3BF;&#x3BB;&#x3B9;&#x3BA;&#x3CC; &#x3BA;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC; &#x3C0;&#x3B1;&#x3BA;&#x3AD;&#x3C4;&#x3BF;. &#x38C;&#x3C4;&#x3B1;&#x3BD; &#x3C7;&#x3C1;&#x3B5;&#x3B9;&#x3B1;&#x3C3;&#x3C4;&#x3B5;&#x3AF;, &#x3C4;&#x3BF; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3BF; &#x3BC;&#x3C0;&#x3BF;&#x3C1;&#x3B5;&#x3AF; &#x3B5;&#x3AF;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3B5;&#x3C0;&#x3B5;&#x3BA;&#x3C4;&#x3B1;&#x3B8;&#x3B5;&#x3AF; &#x3BC;&#x3B5;&#x3C1;&#x3B9;&#x3BA;&#x3CE;&#x3C2;, &#x3AE; &#x3BD;&#x3B1; &#x3B1;&#x3C0;&#x3B5;&#x3BB;&#x3B5;&#x3C5;&#x3B8;&#x3B5;&#x3C1;&#x3C9;&#x3B8;&#x3B5;&#x3AF; &#x3BF;&#x3BB;&#x3CC;&#x3BA;&#x3BB;&#x3B7;&#x3C1;&#x3BF; &#x3BC;&#x3BF;&#x3BD;&#x3BF;&#x3BC;&#x3B9;&#x3AC;&#x3C2;. &#x399;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3CC; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3BD; &#x3B1;&#x3C0;&#x3BF;&#x3B8;&#x3AE;&#x3BA;&#x3B5;&#x3C5;&#x3C3;&#x3B7; &#x3BA;&#x3B1;&#x3BB;&#x3C9;&#x3B4;&#x3AF;&#x3C9;&#x3BD; &#x3BC;&#x3B5; &#x3C0;&#x3BB;&#x3B5;&#x3CC;&#x3BD;&#x3B1;&#x3C3;&#x3BC;&#x3B1;, &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B1;&#x3BE;&#x3AF;&#x3B4;&#x3B9;&#x3B1; &#x3B5;&#x3C0;&#x3B1;&#x3B3;&#x3B3;&#x3B5;&#x3BB;&#x3BC;&#x3B1;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3AE; &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3BD;&#x3B1;&#x3C8;&#x3C5;&#x3C7;&#x3AE;&#x3C2;, &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3B4;&#x3B9;&#x3B1;&#x3C4;&#x3B7;&#x3C1;&#x3BF;&#x3CD;&#x3BD;&#x3C4;&#x3B1;&#x3B9; &#x3C4;&#x3B1; &#x3BC;&#x3B1;&#x3BA;&#x3C1;&#x3B9;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3BA;&#x3C1;&#x3B5;&#x3BC;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3B1; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3AC; &#x3C3;&#x3B1;&#x3C2; &#x3C3;&#x3B5; &#x3C4;&#x3AC;&#x3BE;&#x3B7;, &#x3BA;&#x3B1;&#x3B8;&#x3B1;&#x3C1;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3C3;&#x3C6;&#x3B1;&#x3BB;&#x3AE;. &#x391;&#x3C0;&#x3BB;&#x3AC; &#x3C4;&#x3AD;&#x3BB;&#x3B5;&#x3B9;&#x3B1; &#x3B3;&#x3B9;&#x3B1; &#x3C6;&#x3BF;&#x3C1;&#x3B7;&#x3C4;&#x3BF;&#x3CD;&#x3C2; &#x3C5;&#x3C0;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B9;&#x3C3;&#x3C4;&#x3AD;&#x3C2;, &#x3B1;&#x3BA;&#x3B1;&#x3C4;&#x3AC;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3C2; &#x3B5;&#x3C0;&#x3B9;&#x3C6;&#x3AC;&#x3BD;&#x3B5;&#x3B9;&#x3B5;&#x3C2; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3C3;&#x3AF;&#x3B1;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3CC;&#x3BB;&#x3B1; &#x3C4;&#x3B1; &#x3B7;&#x3BB;&#x3B5;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BD;&#x3B9;&#x3BA;&#x3AC; accessories &#x3BA;&#x3B1;&#x3B9; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3C4;&#x3AD;&#x3C2;.&#xD;
</Description><Price>12.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/c/c/cc_004.jpg</Image></product><product><SKU>BL-CC-MD</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - CableClip - Medium</Name><Description>&#x3A4;&#x3B1; CableClips &#x3BA;&#x3AC;&#x3BD;&#x3BF;&#x3C5;&#x3BD; &#x3C4;&#x3B7;&#x3BD; &#x3B1;&#x3C0;&#x3BF;&#x3B8;&#x3AE;&#x3BA;&#x3B5;&#x3C5;&#x3C3;&#x3B7; &#x3C4;&#x3C9;&#x3BD; &#x3BA;&#x3B1;&#x3BB;&#x3C9;&#x3B4;&#x3AF;&#x3C9;&#x3BD; &#x3C3;&#x3B1;&#x3C2; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B7; &#x3BA;&#x3B1;&#x3B9; &#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3B4;&#x3B1;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AE;. &#x393;&#x3C1;&#x3AE;&#x3B3;&#x3BF;&#x3C1;&#x3B1; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B8;&#x3AD;&#x3C4;&#x3B7;&#x3C3;&#x3B7;, &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AC;&#x3BD;&#x3B5; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3BF;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3BF; &#x3C3;&#x3B5; &#x3AD;&#x3BD;&#x3B1; &#x3B2;&#x3BF;&#x3BB;&#x3B9;&#x3BA;&#x3CC; &#x3BA;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC; &#x3C0;&#x3B1;&#x3BA;&#x3AD;&#x3C4;&#x3BF;. &#x38C;&#x3C4;&#x3B1;&#x3BD; &#x3C7;&#x3C1;&#x3B5;&#x3B9;&#x3B1;&#x3C3;&#x3C4;&#x3B5;&#x3AF;, &#x3C4;&#x3BF; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3BF; &#x3BC;&#x3C0;&#x3BF;&#x3C1;&#x3B5;&#x3AF; &#x3B5;&#x3AF;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3B5;&#x3C0;&#x3B5;&#x3BA;&#x3C4;&#x3B1;&#x3B8;&#x3B5;&#x3AF; &#x3BC;&#x3B5;&#x3C1;&#x3B9;&#x3BA;&#x3CE;&#x3C2;, &#x3AE; &#x3BD;&#x3B1; &#x3B1;&#x3C0;&#x3B5;&#x3BB;&#x3B5;&#x3C5;&#x3B8;&#x3B5;&#x3C1;&#x3C9;&#x3B8;&#x3B5;&#x3AF; &#x3BF;&#x3BB;&#x3CC;&#x3BA;&#x3BB;&#x3B7;&#x3C1;&#x3BF; &#x3BC;&#x3BF;&#x3BD;&#x3BF;&#x3BC;&#x3B9;&#x3AC;&#x3C2;. &#x399;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3CC; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3BD;&#xD;
&#x3B1;&#x3C0;&#x3BF;&#x3B8;&#x3AE;&#x3BA;&#x3B5;&#x3C5;&#x3C3;&#x3B7; &#x3BA;&#x3B1;&#x3BB;&#x3C9;&#x3B4;&#x3AF;&#x3C9;&#x3BD; &#x3BC;&#x3B5; &#x3C0;&#x3BB;&#x3B5;&#x3CC;&#x3BD;&#x3B1;&#x3C3;&#x3BC;&#x3B1;, &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B1;&#x3BE;&#x3AF;&#x3B4;&#x3B9;&#x3B1; &#x3B5;&#x3C0;&#x3B1;&#x3B3;&#x3B3;&#x3B5;&#x3BB;&#x3BC;&#x3B1;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3BD;&#x3B1;&#x3C8;&#x3C5;&#x3C7;&#x3AE;&#x3C2;, &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3B4;&#x3B9;&#x3B1;&#x3C4;&#x3B7;&#x3C1;&#x3BF;&#x3CD;&#x3BD;&#x3C4;&#x3B1;&#x3B9; &#x3C4;&#x3B1; &#x3BC;&#x3B1;&#x3BA;&#x3C1;&#x3B9;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3BA;&#x3C1;&#x3B5;&#x3BC;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3B1; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3AC; &#x3C3;&#x3B1;&#x3C2; &#x3C3;&#x3B5; &#x3C4;&#x3AC;&#x3BE;&#x3B7;, &#x3BA;&#x3B1;&#x3B8;&#x3B1;&#x3C1;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3C3;&#x3C6;&#x3B1;&#x3BB;&#x3AE;.</Description><Price>12.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/c/c/cc_016.jpg</Image></product><product><SKU>BL-CC-LG</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - CableClip - Large</Name><Description>&#x3A4;&#x3B1; CableClips &#x3BA;&#x3AC;&#x3BD;&#x3BF;&#x3C5;&#x3BD; &#x3C4;&#x3B7;&#x3BD; &#x3B1;&#x3C0;&#x3BF;&#x3B8;&#x3AE;&#x3BA;&#x3B5;&#x3C5;&#x3C3;&#x3B7; &#x3C4;&#x3C9;&#x3BD; &#x3BA;&#x3B1;&#x3BB;&#x3C9;&#x3B4;&#x3AF;&#x3C9;&#x3BD; &#x3C3;&#x3B1;&#x3C2; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B7; &#x3BA;&#x3B1;&#x3B9; &#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3B4;&#x3B1;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AE;. &#x393;&#x3C1;&#x3AE;&#x3B3;&#x3BF;&#x3C1;&#x3B1; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B8;&#x3AD;&#x3C4;&#x3B7;&#x3C3;&#x3B7;, &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AC;&#x3BD;&#x3B5; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3BF;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3BF; &#x3C3;&#x3B5; &#x3AD;&#x3BD;&#x3B1; &#x3B2;&#x3BF;&#x3BB;&#x3B9;&#x3BA;&#x3CC; &#x3BA;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC; &#x3C0;&#x3B1;&#x3BA;&#x3AD;&#x3C4;&#x3BF;. &#x38C;&#x3C4;&#x3B1;&#x3BD; &#x3C7;&#x3C1;&#x3B5;&#x3B9;&#x3B1;&#x3C3;&#x3C4;&#x3B5;&#x3AF;, &#x3C4;&#x3BF; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3BF; &#x3BC;&#x3C0;&#x3BF;&#x3C1;&#x3B5;&#x3AF; &#x3B5;&#x3AF;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3B5;&#x3C0;&#x3B5;&#x3BA;&#x3C4;&#x3B1;&#x3B8;&#x3B5;&#x3AF; &#x3BC;&#x3B5;&#x3C1;&#x3B9;&#x3BA;&#x3CE;&#x3C2;, &#x3AE; &#x3BD;&#x3B1; &#x3B1;&#x3C0;&#x3B5;&#x3BB;&#x3B5;&#x3C5;&#x3B8;&#x3B5;&#x3C1;&#x3C9;&#x3B8;&#x3B5;&#x3AF; &#x3BF;&#x3BB;&#x3CC;&#x3BA;&#x3BB;&#x3B7;&#x3C1;&#x3BF; &#x3BC;&#x3BF;&#x3BD;&#x3BF;&#x3BC;&#x3B9;&#x3AC;&#x3C2;. &#x399;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3CC; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3BD;&#xD;
&#x3B1;&#x3C0;&#x3BF;&#x3B8;&#x3AE;&#x3BA;&#x3B5;&#x3C5;&#x3C3;&#x3B7; &#x3BA;&#x3B1;&#x3BB;&#x3C9;&#x3B4;&#x3AF;&#x3C9;&#x3BD; &#x3BC;&#x3B5; &#x3C0;&#x3BB;&#x3B5;&#x3CC;&#x3BD;&#x3B1;&#x3C3;&#x3BC;&#x3B1;, &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B1;&#x3BE;&#x3AF;&#x3B4;&#x3B9;&#x3B1; &#x3B5;&#x3C0;&#x3B1;&#x3B3;&#x3B3;&#x3B5;&#x3BB;&#x3BC;&#x3B1;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3BD;&#x3B1;&#x3C8;&#x3C5;&#x3C7;&#x3AE;&#x3C2;, &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3B4;&#x3B9;&#x3B1;&#x3C4;&#x3B7;&#x3C1;&#x3BF;&#x3CD;&#x3BD;&#x3C4;&#x3B1;&#x3B9; &#x3C4;&#x3B1; &#x3BC;&#x3B1;&#x3BA;&#x3C1;&#x3B9;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3BA;&#x3C1;&#x3B5;&#x3BC;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3B1; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3AC; &#x3C3;&#x3B1;&#x3C2; &#x3C3;&#x3B5; &#x3C4;&#x3AC;&#x3BE;&#x3B7;, &#x3BA;&#x3B1;&#x3B8;&#x3B1;&#x3C1;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3C3;&#x3C6;&#x3B1;&#x3BB;&#x3AE;.</Description><Price>12.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/c/c/cc_015.jpg</Image></product><product><SKU>BL-CD</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - CableDrop</Name><Description>&#x3A4;&#x3BF; &#x3BC;&#x3BF;&#x3BD;&#x3B1;&#x3B4;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; CableDrop &#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B8;&#x3B5;&#x3C4;&#x3B5;&#x3AF;&#x3C4;&#x3B1;&#x3B9; &#x3C0;&#x3AC;&#x3BD;&#x3C9; &#x3AE; &#x3C0;&#x3AF;&#x3C3;&#x3C9;&#xD;
&#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3B7;&#x3BD; &#x3B5;&#x3C0;&#x3B9;&#x3C6;&#x3AC;&#x3BD;&#x3B5;&#x3B9;&#x3B1; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3C3;&#x3AF;&#x3B1;&#x3C2;, &#x3B1;&#x3BA;&#x3CC;&#x3BC;&#x3B7; &#x3BA;&#x3B1;&#x3B9; &#x3C3;&#x3B5; &#x3AD;&#x3BD;&#x3B1;&#x3BD; &#x3B1;&#x3BD;&#x3C4;&#x3B9;&#x3BA;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3CC; &#x3C4;&#x3BF;&#x3AF;&#x3C7;&#x3BF;, &#x3BF;&#x3C0;&#x3BF;&#x3C5;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3B8;&#x3AD;&#x3BB;&#x3B5;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3AD;&#x3C7;&#x3B5;&#x3C4;&#x3B5; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C9;&#x3C1;&#x3B9;&#x3BD;&#x3AC; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3B7;&#x3BC;&#x3AD;&#x3BD;&#x3B1; &#x3B1;&#x3BB;&#x3BB;&#x3AC; &#x3C0;&#x3BF;&#x3C5; &#x3BD;&#x3B1; &#x3BC;&#x3C0;&#x3BF;&#x3C1;&#x3BF;&#x3CD;&#x3BD; &#x3BD;&#x3B1; &#x3B5;&#x3C0;&#x3B5;&#x3BA;&#x3C4;&#x3B1;&#x3B8;&#x3BF;&#x3CD;&#x3BD; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B1;. &#x3A4;&#x3BF; CableDrop &#x3C0;&#x3B9;&#x3AC;&#x3BD;&#x3B5;&#x3B9; &#x3B1;&#x3C0;&#x3B1;&#x3BB;&#x3AC; &#x3C4;&#x3B1; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; &#x3C3;&#x3B1;&#x3C2;, &#x3AD;&#x3C4;&#x3C3;&#x3B9; &#x3CE;&#x3C3;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3BC;&#x3B7;&#x3BD; &#x3C0;&#x3AD;&#x3C6;&#x3C4;&#x3BF;&#x3C5;&#x3BD; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3BF; &#x3B3;&#x3C1;&#x3B1;&#x3C6;&#x3B5;&#x3AF;&#x3BF; &#x3C3;&#x3B1;&#x3C2; &#x3BA;&#x3AC;&#x3B8;&#x3B5; &#x3C6;&#x3BF;&#x3C1;&#x3AC; &#x3C0;&#x3BF;&#x3C5; &#x3B2;&#x3B3;&#x3AC;&#x3B6;&#x3B5;&#x3C4;&#x3B5; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3B7; &#x3C0;&#x3C1;&#x3AF;&#x3B6;&#x3B1; &#x3C4;&#x3BF;&#x3BD; &#x3C6;&#x3BF;&#x3C1;&#x3B7;&#x3C4;&#x3CC; &#x3C5;&#x3C0;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B9;&#x3C3;&#x3C4;&#x3AE; &#x3AE; &#x3C4;&#x3B7; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE; &#x3C3;&#x3B1;&#x3C2;.&#xD;
</Description><Price>12.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/c/d/cd_001.jpg</Image></product><product><SKU>BL-CD-WH</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - CableDrop - White</Name><Description>&#x3A4;&#x3BF; &#x3BC;&#x3BF;&#x3BD;&#x3B1;&#x3B4;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; CableDrop &#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B8;&#x3B5;&#x3C4;&#x3B5;&#x3AF;&#x3C4;&#x3B1;&#x3B9; &#x3C0;&#x3AC;&#x3BD;&#x3C9; &#x3AE; &#x3C0;&#x3AF;&#x3C3;&#x3C9; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3B7;&#x3BD; &#x3B5;&#x3C0;&#x3B9;&#x3C6;&#x3AC;&#x3BD;&#x3B5;&#x3B9;&#x3B1; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3C3;&#x3AF;&#x3B1;&#x3C2;, &#x3B1;&#x3BA;&#x3CC;&#x3BC;&#x3B7; &#x3BA;&#x3B1;&#x3B9; &#x3C3;&#x3B5; &#x3AD;&#x3BD;&#x3B1;&#x3BD; &#x3B1;&#x3BD;&#x3C4;&#x3B9;&#x3BA;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3CC; &#x3C4;&#x3BF;&#x3AF;&#x3C7;&#x3BF;, &#x3BF;&#x3C0;&#x3BF;&#x3C5;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3B8;&#x3AD;&#x3BB;&#x3B5;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3AD;&#x3C7;&#x3B5;&#x3C4;&#x3B5; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C9;&#x3C1;&#x3B9;&#x3BD;&#x3AC; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3B7;&#x3BC;&#x3AD;&#x3BD;&#x3B1;, &#x3B1;&#x3BB;&#x3BB;&#x3AC; &#x3C0;&#x3BF;&#x3C5; &#x3BD;&#x3B1; &#x3BC;&#x3C0;&#x3BF;&#x3C1;&#x3BF;&#x3CD;&#x3BD; &#x3BD;&#x3B1; &#x3B5;&#x3C0;&#x3B5;&#x3BA;&#x3C4;&#x3B1;&#x3B8;&#x3BF;&#x3CD;&#x3BD; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B1;. &#x3A4;&#x3BF; CableDrop &#x3C0;&#x3B9;&#x3AC;&#x3BD;&#x3B5;&#x3B9; &#x3B1;&#x3C0;&#x3B1;&#x3BB;&#x3AC; &#x3C4;&#x3B1; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3AC; &#x3C3;&#x3B1;&#x3C2;, &#x3AD;&#x3C4;&#x3C3;&#x3B9; &#x3CE;&#x3C3;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3BC;&#x3B7;&#x3BD; &#x3C0;&#x3AD;&#x3C6;&#x3C4;&#x3BF;&#x3C5;&#x3BD; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3BF; &#x3B3;&#x3C1;&#x3B1;&#x3C6;&#x3B5;&#x3AF;&#x3BF; &#x3C3;&#x3B1;&#x3C2; &#x3BA;&#x3AC;&#x3B8;&#x3B5; &#x3C6;&#x3BF;&#x3C1;&#x3AC; &#x3C0;&#x3BF;&#x3C5; &#x3B2;&#x3B3;&#x3AC;&#x3B6;&#x3B5;&#x3C4;&#x3B5; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3B7; &#x3C0;&#x3C1;&#x3AF;&#x3B6;&#x3B1;&#xD;
&#x3C4;&#x3BF;&#x3BD; &#x3C6;&#x3BF;&#x3C1;&#x3B7;&#x3C4;&#x3CC; &#x3C5;&#x3C0;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B9;&#x3C3;&#x3C4;&#x3AE; &#x3AE; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B1;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE; &#x3C3;&#x3B1;&#x3C2;.</Description><Price>12.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/c/d/cd_027_1.jpg</Image></product><product><SKU>BL-CD-BK</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - CableDrop - Black</Name><Description>&#x3A4;&#x3BF; &#x3BC;&#x3BF;&#x3BD;&#x3B1;&#x3B4;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; CableDrop &#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B8;&#x3B5;&#x3C4;&#x3B5;&#x3AF;&#x3C4;&#x3B1;&#x3B9; &#x3C0;&#x3AC;&#x3BD;&#x3C9; &#x3AE; &#x3C0;&#x3AF;&#x3C3;&#x3C9; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3B7;&#x3BD; &#x3B5;&#x3C0;&#x3B9;&#x3C6;&#x3AC;&#x3BD;&#x3B5;&#x3B9;&#x3B1; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3C3;&#x3AF;&#x3B1;&#x3C2;, &#x3B1;&#x3BA;&#x3CC;&#x3BC;&#x3B7; &#x3BA;&#x3B1;&#x3B9; &#x3C3;&#x3B5; &#x3AD;&#x3BD;&#x3B1;&#x3BD; &#x3B1;&#x3BD;&#x3C4;&#x3B9;&#x3BA;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3CC; &#x3C4;&#x3BF;&#x3AF;&#x3C7;&#x3BF;, &#x3BF;&#x3C0;&#x3BF;&#x3C5;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3B8;&#x3AD;&#x3BB;&#x3B5;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3AD;&#x3C7;&#x3B5;&#x3C4;&#x3B5; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C9;&#x3C1;&#x3B9;&#x3BD;&#x3AC; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3B7;&#x3BC;&#x3AD;&#x3BD;&#x3B1;, &#x3B1;&#x3BB;&#x3BB;&#x3AC; &#x3C0;&#x3BF;&#x3C5; &#x3BD;&#x3B1; &#x3BC;&#x3C0;&#x3BF;&#x3C1;&#x3BF;&#x3CD;&#x3BD; &#x3BD;&#x3B1; &#x3B5;&#x3C0;&#x3B5;&#x3BA;&#x3C4;&#x3B1;&#x3B8;&#x3BF;&#x3CD;&#x3BD; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B1;. &#x3A4;&#x3BF; CableDrop &#x3C0;&#x3B9;&#x3AC;&#x3BD;&#x3B5;&#x3B9; &#x3B1;&#x3C0;&#x3B1;&#x3BB;&#x3AC; &#x3C4;&#x3B1; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3AC; &#x3C3;&#x3B1;&#x3C2;, &#x3AD;&#x3C4;&#x3C3;&#x3B9; &#x3CE;&#x3C3;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3BC;&#x3B7;&#x3BD; &#x3C0;&#x3AD;&#x3C6;&#x3C4;&#x3BF;&#x3C5;&#x3BD; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3BF; &#x3B3;&#x3C1;&#x3B1;&#x3C6;&#x3B5;&#x3AF;&#x3BF; &#x3C3;&#x3B1;&#x3C2; &#x3BA;&#x3AC;&#x3B8;&#x3B5; &#x3C6;&#x3BF;&#x3C1;&#x3AC; &#x3C0;&#x3BF;&#x3C5; &#x3B2;&#x3B3;&#x3AC;&#x3B6;&#x3B5;&#x3C4;&#x3B5; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3B7; &#x3C0;&#x3C1;&#x3AF;&#x3B6;&#x3B1;&#xD;
&#x3C4;&#x3BF;&#x3BD; &#x3C6;&#x3BF;&#x3C1;&#x3B7;&#x3C4;&#x3CC; &#x3C5;&#x3C0;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B9;&#x3C3;&#x3C4;&#x3AE; &#x3AE; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B1;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE; &#x3C3;&#x3B1;&#x3C2;.</Description><Price>12.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/c/d/cd_026_1.jpg</Image></product><product><SKU>BL-CD-BR</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - CableDrop - Bright</Name><Description>&#x3A4;&#x3BF; &#x3BC;&#x3BF;&#x3BD;&#x3B1;&#x3B4;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; CableDrop &#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B8;&#x3B5;&#x3C4;&#x3B5;&#x3AF;&#x3C4;&#x3B1;&#x3B9; &#x3C0;&#x3AC;&#x3BD;&#x3C9; &#x3AE; &#x3C0;&#x3AF;&#x3C3;&#x3C9; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3B7;&#x3BD; &#x3B5;&#x3C0;&#x3B9;&#x3C6;&#x3AC;&#x3BD;&#x3B5;&#x3B9;&#x3B1; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3C3;&#x3AF;&#x3B1;&#x3C2;, &#x3B1;&#x3BA;&#x3CC;&#x3BC;&#x3B7; &#x3BA;&#x3B1;&#x3B9; &#x3C3;&#x3B5; &#x3AD;&#x3BD;&#x3B1;&#x3BD; &#x3B1;&#x3BD;&#x3C4;&#x3B9;&#x3BA;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3CC; &#x3C4;&#x3BF;&#x3AF;&#x3C7;&#x3BF;, &#x3BF;&#x3C0;&#x3BF;&#x3C5;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3B8;&#x3AD;&#x3BB;&#x3B5;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3AD;&#x3C7;&#x3B5;&#x3C4;&#x3B5; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C9;&#x3C1;&#x3B9;&#x3BD;&#x3AC; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3B7;&#x3BC;&#x3AD;&#x3BD;&#x3B1;, &#x3B1;&#x3BB;&#x3BB;&#x3AC; &#x3C0;&#x3BF;&#x3C5; &#x3BD;&#x3B1; &#x3BC;&#x3C0;&#x3BF;&#x3C1;&#x3BF;&#x3CD;&#x3BD; &#x3BD;&#x3B1; &#x3B5;&#x3C0;&#x3B5;&#x3BA;&#x3C4;&#x3B1;&#x3B8;&#x3BF;&#x3CD;&#x3BD; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B1;. &#x3A4;&#x3BF; CableDrop &#x3C0;&#x3B9;&#x3AC;&#x3BD;&#x3B5;&#x3B9; &#x3B1;&#x3C0;&#x3B1;&#x3BB;&#x3AC; &#x3C4;&#x3B1; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3AC; &#x3C3;&#x3B1;&#x3C2;, &#x3AD;&#x3C4;&#x3C3;&#x3B9; &#x3CE;&#x3C3;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3BC;&#x3B7;&#x3BD; &#x3C0;&#x3AD;&#x3C6;&#x3C4;&#x3BF;&#x3C5;&#x3BD; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3BF; &#x3B3;&#x3C1;&#x3B1;&#x3C6;&#x3B5;&#x3AF;&#x3BF; &#x3C3;&#x3B1;&#x3C2; &#x3BA;&#x3AC;&#x3B8;&#x3B5; &#x3C6;&#x3BF;&#x3C1;&#x3AC; &#x3C0;&#x3BF;&#x3C5; &#x3B2;&#x3B3;&#x3AC;&#x3B6;&#x3B5;&#x3C4;&#x3B5; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3B7; &#x3C0;&#x3C1;&#x3AF;&#x3B6;&#x3B1;&#xD;
&#x3C4;&#x3BF;&#x3BD; &#x3C6;&#x3BF;&#x3C1;&#x3B7;&#x3C4;&#x3CC; &#x3C5;&#x3C0;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B9;&#x3C3;&#x3C4;&#x3AE; &#x3AE; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B1;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE; &#x3C3;&#x3B1;&#x3C2;.</Description><Price>12.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/c/d/cd_021_1.jpg</Image></product><product><SKU>BL-CD-MU</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - CableDrop - Muted</Name><Description>&#x3A4;&#x3BF; &#x3BC;&#x3BF;&#x3BD;&#x3B1;&#x3B4;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; CableDrop &#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B8;&#x3B5;&#x3C4;&#x3B5;&#x3AF;&#x3C4;&#x3B1;&#x3B9; &#x3C0;&#x3AC;&#x3BD;&#x3C9; &#x3AE; &#x3C0;&#x3AF;&#x3C3;&#x3C9; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3B7;&#x3BD; &#x3B5;&#x3C0;&#x3B9;&#x3C6;&#x3AC;&#x3BD;&#x3B5;&#x3B9;&#x3B1; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3C3;&#x3AF;&#x3B1;&#x3C2;, &#x3B1;&#x3BA;&#x3CC;&#x3BC;&#x3B7; &#x3BA;&#x3B1;&#x3B9; &#x3C3;&#x3B5; &#x3AD;&#x3BD;&#x3B1;&#x3BD; &#x3B1;&#x3BD;&#x3C4;&#x3B9;&#x3BA;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3CC; &#x3C4;&#x3BF;&#x3AF;&#x3C7;&#x3BF;, &#x3BF;&#x3C0;&#x3BF;&#x3C5;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3B8;&#x3AD;&#x3BB;&#x3B5;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3AD;&#x3C7;&#x3B5;&#x3C4;&#x3B5; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C9;&#x3C1;&#x3B9;&#x3BD;&#x3AC; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3B7;&#x3BC;&#x3AD;&#x3BD;&#x3B1;, &#x3B1;&#x3BB;&#x3BB;&#x3AC; &#x3C0;&#x3BF;&#x3C5; &#x3BD;&#x3B1; &#x3BC;&#x3C0;&#x3BF;&#x3C1;&#x3BF;&#x3CD;&#x3BD; &#x3BD;&#x3B1; &#x3B5;&#x3C0;&#x3B5;&#x3BA;&#x3C4;&#x3B1;&#x3B8;&#x3BF;&#x3CD;&#x3BD; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B1;. &#x3A4;&#x3BF; CableDrop &#x3C0;&#x3B9;&#x3AC;&#x3BD;&#x3B5;&#x3B9; &#x3B1;&#x3C0;&#x3B1;&#x3BB;&#x3AC; &#x3C4;&#x3B1; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3AC; &#x3C3;&#x3B1;&#x3C2;, &#x3AD;&#x3C4;&#x3C3;&#x3B9; &#x3CE;&#x3C3;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3BC;&#x3B7;&#x3BD; &#x3C0;&#x3AD;&#x3C6;&#x3C4;&#x3BF;&#x3C5;&#x3BD; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3BF; &#x3B3;&#x3C1;&#x3B1;&#x3C6;&#x3B5;&#x3AF;&#x3BF; &#x3C3;&#x3B1;&#x3C2; &#x3BA;&#x3AC;&#x3B8;&#x3B5; &#x3C6;&#x3BF;&#x3C1;&#x3AC; &#x3C0;&#x3BF;&#x3C5; &#x3B2;&#x3B3;&#x3AC;&#x3B6;&#x3B5;&#x3C4;&#x3B5; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3B7; &#x3C0;&#x3C1;&#x3AF;&#x3B6;&#x3B1;&#xD;
&#x3C4;&#x3BF;&#x3BD; &#x3C6;&#x3BF;&#x3C1;&#x3B7;&#x3C4;&#x3CC; &#x3C5;&#x3C0;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B9;&#x3C3;&#x3C4;&#x3AE; &#x3AE; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B1;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE; &#x3C3;&#x3B1;&#x3C2;.</Description><Price>12.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/c/d/cd_014.jpg</Image></product><product><SKU>BL-KI-L</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Kii - Lightning (iPhone 5/5s)</Name><Description>&#x3A4;&#x3BF; Kii &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3AD;&#x3BD;&#x3B1;&#x3C2; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC;&#x3C2; &#x3C3;&#x3C5;&#x3BC;&#x3C0;&#x3B1;&#x3B3;&#x3AE;&#x3C2; USB &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3C4;&#x3AE;&#x3C2;, &#x3C3;&#x3C5;&#x3BC;&#x3B2;&#x3B1;&#x3C4;&#x3CC;&#x3C2; &#x3BC;&#x3B5; &#x3C4;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3CA;&#x3CC;&#x3BD;&#x3C4;&#x3B1; &#x3C4;&#x3B7;&#x3C2;  Apple, &#x3C0;&#x3BF;&#x3C5; &#x3C4;&#x3B1;&#x3B9;&#x3C1;&#x3B9;&#x3AC;&#x3B6;&#x3B5;&#x3B9; (&#x3BA;&#x3C1;&#x3B5;&#x3BC;&#x3B9;&#x3AD;&#x3C4;&#x3B1;&#x3B9;) &#x3C3;&#x3B5; &#x3AD;&#x3BD;&#x3B1; &#x3BC;&#x3C0;&#x3C1;&#x3B5;&#x3BB;&#x3CC;&#x3BA; &#x3B3;&#x3B9;&#x3B1; &#x3B1;&#x3C0;&#x3CC;&#x3BB;&#x3C5;&#x3C4;&#x3B7; &#x3B5;&#x3C5;&#x3BA;&#x3BF;&#x3BB;&#x3AF;&#x3B1;, &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3B2;&#x3B1;&#x3C3;&#x3B9;&#x3BC;&#x3CC;&#x3C4;&#x3B7;&#x3C4;&#x3B1; &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3BB;&#x3B5;&#x3C5;&#x3B8;&#x3B5;&#x3C1;&#x3AF;&#x3B1; &#x3BA;&#x3B9;&#x3BD;&#x3AE;&#x3C3;&#x3B5;&#x3C9;&#x3BD;. &#x395;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C4;&#x3CC;&#x3C3;&#x3BF; &#x3B5;&#x3BB;&#x3B1;&#x3C6;&#x3C1;&#x3CD;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3B4;&#x3B9;&#x3B1;&#x3BA;&#x3C1;&#x3B9;&#x3C4;&#x3B9;&#x3BA;&#x3CC;&#x3C2; &#x3CC;&#x3C0;&#x3C9;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3BA;&#x3AC;&#x3B8;&#x3B5; &#x3AC;&#x3BB;&#x3BB;&#x3BF; &#x3BA;&#x3BB;&#x3B5;&#x3B9;&#x3B4;&#x3AF;, &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3C0;&#x3B9;&#x3C4;&#x3C1;&#x3AD;&#x3C0;&#x3B5;&#x3B9; &#x3C3;&#x3C4;&#x3BF;&#x3C5;&#x3C2; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3C4;&#x3B5;&#x3C2; &#x3BD;&#x3B1; &#x3C3;&#x3C5;&#x3BD;&#x3B4;&#x3AD;&#x3BF;&#x3BD;&#x3C4;&#x3B1;&#x3B9;  &#x3BA;&#x3B1;&#x3B9; &#x3BD;&#x3B1; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3AF;&#x3B6;&#x3BF;&#x3C5;&#x3BD; &#x3C4;&#x3B9;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3C4;&#x3BF;&#x3C5;&#x3C2; &#x3B1;&#x3C0;&#x3CC; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3BF;&#x3BD;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3C5;&#x3C0;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B9;&#x3C3;&#x3C4;&#x3AE; &#x3AE; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B1;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3B8;&#x3CD;&#x3C1;&#x3B1; USB, &#x3C7;&#x3C9;&#x3C1;&#x3AF;&#x3C2; &#x3BD;&#x3B1; &#x3C7;&#x3C1;&#x3B5;&#x3B9;&#x3AC;&#x3B6;&#x3B5;&#x3C4;&#x3B1;&#x3B9; &#x3BD;&#x3B1; &#x3BC;&#x3B5;&#x3C4;&#x3B1;&#x3C6;&#x3AD;&#x3C1;&#x3BF;&#x3C5;&#x3BD; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3C4;&#x3AE; &#x3AE; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3BF; &#x3C3;&#x3CD;&#x3BD;&#x3B4;&#x3B5;&#x3C3;&#x3B7;&#x3C2;.</Description><Price>39.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/k/i/ki_01_1_1.jpg</Image></product><product><SKU>BL-KI-L-WH</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Kii - Lightning (iPhone 5/5s) - White</Name><Description>&#x3A4;&#x3BF; Kii &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3AD;&#x3BD;&#x3B1;&#x3C2; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC;&#x3C2; &#x3C3;&#x3C5;&#x3BC;&#x3C0;&#x3B1;&#x3B3;&#x3AE;&#x3C2; USB &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3C4;&#x3AE;&#x3C2;, &#x3C3;&#x3C5;&#x3BC;&#x3B2;&#x3B1;&#x3C4;&#x3CC;&#x3C2; &#x3BC;&#x3B5; &#x3C4;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3CA;&#x3CC;&#x3BD;&#x3C4;&#x3B1; &#x3C4;&#x3B7;&#x3C2;  Apple, &#x3C0;&#x3BF;&#x3C5; &#x3C4;&#x3B1;&#x3B9;&#x3C1;&#x3B9;&#x3AC;&#x3B6;&#x3B5;&#x3B9; (&#x3BA;&#x3C1;&#x3B5;&#x3BC;&#x3B9;&#x3AD;&#x3C4;&#x3B1;&#x3B9;) &#x3C3;&#x3B5; &#x3AD;&#x3BD;&#x3B1; &#x3BC;&#x3C0;&#x3C1;&#x3B5;&#x3BB;&#x3CC;&#x3BA; &#x3B3;&#x3B9;&#x3B1; &#x3B1;&#x3C0;&#x3CC;&#x3BB;&#x3C5;&#x3C4;&#x3B7; &#x3B5;&#x3C5;&#x3BA;&#x3BF;&#x3BB;&#x3AF;&#x3B1;, &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3B2;&#x3B1;&#x3C3;&#x3B9;&#x3BC;&#x3CC;&#x3C4;&#x3B7;&#x3C4;&#x3B1; &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3BB;&#x3B5;&#x3C5;&#x3B8;&#x3B5;&#x3C1;&#x3AF;&#x3B1; &#x3BA;&#x3B9;&#x3BD;&#x3AE;&#x3C3;&#x3B5;&#x3C9;&#x3BD;. &#x395;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C4;&#x3CC;&#x3C3;&#x3BF; &#x3B5;&#x3BB;&#x3B1;&#x3C6;&#x3C1;&#x3CD;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3B4;&#x3B9;&#x3B1;&#x3BA;&#x3C1;&#x3B9;&#x3C4;&#x3B9;&#x3BA;&#x3CC;&#x3C2; &#x3CC;&#x3C0;&#x3C9;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3BA;&#x3AC;&#x3B8;&#x3B5; &#x3AC;&#x3BB;&#x3BB;&#x3BF; &#x3BA;&#x3BB;&#x3B5;&#x3B9;&#x3B4;&#x3AF;, &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3C0;&#x3B9;&#x3C4;&#x3C1;&#x3AD;&#x3C0;&#x3B5;&#x3B9; &#x3C3;&#x3C4;&#x3BF;&#x3C5;&#x3C2; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3C4;&#x3B5;&#x3C2; &#x3BD;&#x3B1; &#x3C3;&#x3C5;&#x3BD;&#x3B4;&#x3AD;&#x3BF;&#x3BD;&#x3C4;&#x3B1;&#x3B9;  &#x3BA;&#x3B1;&#x3B9; &#x3BD;&#x3B1; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3AF;&#x3B6;&#x3BF;&#x3C5;&#x3BD; &#x3C4;&#x3B9;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3C4;&#x3BF;&#x3C5;&#x3C2; &#x3B1;&#x3C0;&#x3CC; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3BF;&#x3BD;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3C5;&#x3C0;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B9;&#x3C3;&#x3C4;&#x3AE; &#x3AE; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B1;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3B8;&#x3CD;&#x3C1;&#x3B1; USB, &#x3C7;&#x3C9;&#x3C1;&#x3AF;&#x3C2; &#x3BD;&#x3B1; &#x3C7;&#x3C1;&#x3B5;&#x3B9;&#x3AC;&#x3B6;&#x3B5;&#x3C4;&#x3B1;&#x3B9; &#x3BD;&#x3B1; &#x3BC;&#x3B5;&#x3C4;&#x3B1;&#x3C6;&#x3AD;&#x3C1;&#x3BF;&#x3C5;&#x3BD; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3C4;&#x3AE; &#x3AE; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3BF; &#x3C3;&#x3CD;&#x3BD;&#x3B4;&#x3B5;&#x3C3;&#x3B7;&#x3C2;.</Description><Price>39.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/2/1/21396_10151748833234919_1900566280_n.jpg</Image></product><product><SKU>BL-KI-L-BK</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Kii - Lightning (iPhone 5/5s) - Black</Name><Description>&#x3A4;&#x3BF; Kii &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3AD;&#x3BD;&#x3B1;&#x3C2; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC;&#x3C2; &#x3C3;&#x3C5;&#x3BC;&#x3C0;&#x3B1;&#x3B3;&#x3AE;&#x3C2; USB &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3C4;&#x3AE;&#x3C2;, &#x3C3;&#x3C5;&#x3BC;&#x3B2;&#x3B1;&#x3C4;&#x3CC;&#x3C2; &#x3BC;&#x3B5; &#x3C4;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3CA;&#x3CC;&#x3BD;&#x3C4;&#x3B1; &#x3C4;&#x3B7;&#x3C2;  Apple, &#x3C0;&#x3BF;&#x3C5; &#x3C4;&#x3B1;&#x3B9;&#x3C1;&#x3B9;&#x3AC;&#x3B6;&#x3B5;&#x3B9; (&#x3BA;&#x3C1;&#x3B5;&#x3BC;&#x3B9;&#x3AD;&#x3C4;&#x3B1;&#x3B9;) &#x3C3;&#x3B5; &#x3AD;&#x3BD;&#x3B1; &#x3BC;&#x3C0;&#x3C1;&#x3B5;&#x3BB;&#x3CC;&#x3BA; &#x3B3;&#x3B9;&#x3B1; &#x3B1;&#x3C0;&#x3CC;&#x3BB;&#x3C5;&#x3C4;&#x3B7; &#x3B5;&#x3C5;&#x3BA;&#x3BF;&#x3BB;&#x3AF;&#x3B1;, &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3B2;&#x3B1;&#x3C3;&#x3B9;&#x3BC;&#x3CC;&#x3C4;&#x3B7;&#x3C4;&#x3B1; &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3BB;&#x3B5;&#x3C5;&#x3B8;&#x3B5;&#x3C1;&#x3AF;&#x3B1; &#x3BA;&#x3B9;&#x3BD;&#x3AE;&#x3C3;&#x3B5;&#x3C9;&#x3BD;. &#x395;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C4;&#x3CC;&#x3C3;&#x3BF; &#x3B5;&#x3BB;&#x3B1;&#x3C6;&#x3C1;&#x3CD;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3B4;&#x3B9;&#x3B1;&#x3BA;&#x3C1;&#x3B9;&#x3C4;&#x3B9;&#x3BA;&#x3CC;&#x3C2; &#x3CC;&#x3C0;&#x3C9;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3BA;&#x3AC;&#x3B8;&#x3B5; &#x3AC;&#x3BB;&#x3BB;&#x3BF; &#x3BA;&#x3BB;&#x3B5;&#x3B9;&#x3B4;&#x3AF;, &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3C0;&#x3B9;&#x3C4;&#x3C1;&#x3AD;&#x3C0;&#x3B5;&#x3B9; &#x3C3;&#x3C4;&#x3BF;&#x3C5;&#x3C2; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3C4;&#x3B5;&#x3C2; &#x3BD;&#x3B1; &#x3C3;&#x3C5;&#x3BD;&#x3B4;&#x3AD;&#x3BF;&#x3BD;&#x3C4;&#x3B1;&#x3B9;  &#x3BA;&#x3B1;&#x3B9; &#x3BD;&#x3B1; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3AF;&#x3B6;&#x3BF;&#x3C5;&#x3BD; &#x3C4;&#x3B9;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3C4;&#x3BF;&#x3C5;&#x3C2; &#x3B1;&#x3C0;&#x3CC; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3BF;&#x3BD;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3C5;&#x3C0;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B9;&#x3C3;&#x3C4;&#x3AE; &#x3AE; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B1;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3B8;&#x3CD;&#x3C1;&#x3B1; USB, &#x3C7;&#x3C9;&#x3C1;&#x3AF;&#x3C2; &#x3BD;&#x3B1; &#x3C7;&#x3C1;&#x3B5;&#x3B9;&#x3AC;&#x3B6;&#x3B5;&#x3C4;&#x3B1;&#x3B9; &#x3BD;&#x3B1; &#x3BC;&#x3B5;&#x3C4;&#x3B1;&#x3C6;&#x3AD;&#x3C1;&#x3BF;&#x3C5;&#x3BD; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3C4;&#x3AE; &#x3AE; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3BF; &#x3C3;&#x3CD;&#x3BD;&#x3B4;&#x3B5;&#x3C3;&#x3B7;&#x3C2;.</Description><Price>39.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/9/9/992878_10151748833189919_1494722113_n.jpg</Image></product><product><SKU>BL-SK-L</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Saidoka  - Lightning (iPhone 5/5S)</Name><Description>&#x39C;&#x3AF;&#x3B1; &#x3B2;&#x3AC;&#x3C3;&#x3B7; &#x3C6;&#x3CC;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3B7;&#x3C2;, &#x3BC;&#x3B5; &#x3C4;&#x3AD;&#x3BB;&#x3B5;&#x3B9;&#x3B1; &#x3B3;&#x3C9;&#x3BD;&#x3AF;&#x3B1; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3B7;&#x3C2;, &#x3AD;&#x3C4;&#x3BF;&#x3B9;&#x3BC;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B1;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3CC;&#x3B3;&#x3B7;&#x3C3;&#x3B7; &#x3AE; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3B7; &#x3B5;&#x3C6;&#x3B1;&#x3C1;&#x3BC;&#x3BF;&#x3B3;&#x3CE;&#x3BD;. &#x397; &#x3C3;&#x3C4;&#x3B1;&#x3B8;&#x3B5;&#x3C1;&#x3AE; &#x3B1;&#x3AF;&#x3C3;&#x3B8;&#x3B7;&#x3C3;&#x3B7; &#x3C4;&#x3B7;&#x3C2; Saidoka &#x3C4;&#x3B7;&#x3BD; &#x3BA;&#x3AC;&#x3BD;&#x3B5;&#x3B9;  &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3B9;&#x3BF; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3B9;&#x3BC;&#x3B7; &#x3B2;&#x3AC;&#x3C3;&#x3B7; &#x3C6;&#x3CC;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3B7;&#x3C2; &#x3C0;&#x3BF;&#x3C5; &#x3AD;&#x3C7;&#x3B5;&#x3C4;&#x3B5; &#x3C7;&#x3C1;&#x3B7;&#x3C3;&#x3B9;&#x3BC;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3AE;&#x3C3;&#x3B5;&#x3B9;.</Description><Price>49.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/s/k/sk_14_1_2.jpg</Image></product><product><SKU>BL-SK-L-WH</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Saidoka - Lightning (iPhone 5/5S) - White</Name><Description>&#x39C;&#x3AF;&#x3B1; &#x3B2;&#x3AC;&#x3C3;&#x3B7; &#x3C6;&#x3CC;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3B7;&#x3C2;, &#x3BC;&#x3B5; &#x3C4;&#x3AD;&#x3BB;&#x3B5;&#x3B9;&#x3B1; &#x3B3;&#x3C9;&#x3BD;&#x3AF;&#x3B1; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3B7;&#x3C2;, &#x3AD;&#x3C4;&#x3BF;&#x3B9;&#x3BC;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B1;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3CC;&#x3B3;&#x3B7;&#x3C3;&#x3B7; &#x3AE; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3B7; &#x3B5;&#x3C6;&#x3B1;&#x3C1;&#x3BC;&#x3BF;&#x3B3;&#x3CE;&#x3BD;. &#x397; &#x3C3;&#x3C4;&#x3B1;&#x3B8;&#x3B5;&#x3C1;&#x3AE; &#x3B1;&#x3AF;&#x3C3;&#x3B8;&#x3B7;&#x3C3;&#x3B7; &#x3C4;&#x3B7;&#x3C2; Saidoka &#x3C4;&#x3B7;&#x3BD; &#x3BA;&#x3AC;&#x3BD;&#x3B5;&#x3B9;  &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3B9;&#x3BF; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3B9;&#x3BC;&#x3B7; &#x3B2;&#x3AC;&#x3C3;&#x3B7; &#x3C6;&#x3CC;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3B7;&#x3C2; &#x3C0;&#x3BF;&#x3C5; &#x3AD;&#x3C7;&#x3B5;&#x3C4;&#x3B5; &#x3C7;&#x3C1;&#x3B7;&#x3C3;&#x3B9;&#x3BC;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3AE;&#x3C3;&#x3B5;&#x3B9;.</Description><Price>49.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/1/0/1014036_10151745141909919_575430595_n.jpg</Image></product><product><SKU>BL-SK-L-BK</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Saidoka - Lightning (iPhone 5/5S) - Black</Name><Description>&#x39C;&#x3AF;&#x3B1; &#x3B2;&#x3AC;&#x3C3;&#x3B7; &#x3C6;&#x3CC;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3B7;&#x3C2;, &#x3BC;&#x3B5; &#x3C4;&#x3AD;&#x3BB;&#x3B5;&#x3B9;&#x3B1; &#x3B3;&#x3C9;&#x3BD;&#x3AF;&#x3B1; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3B7;&#x3C2;, &#x3AD;&#x3C4;&#x3BF;&#x3B9;&#x3BC;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B1;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3CC;&#x3B3;&#x3B7;&#x3C3;&#x3B7; &#x3AE; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3B7; &#x3B5;&#x3C6;&#x3B1;&#x3C1;&#x3BC;&#x3BF;&#x3B3;&#x3CE;&#x3BD;. &#x397; &#x3C3;&#x3C4;&#x3B1;&#x3B8;&#x3B5;&#x3C1;&#x3AE; &#x3B1;&#x3AF;&#x3C3;&#x3B8;&#x3B7;&#x3C3;&#x3B7; &#x3C4;&#x3B7;&#x3C2; Saidoka &#x3C4;&#x3B7;&#x3BD; &#x3BA;&#x3AC;&#x3BD;&#x3B5;&#x3B9;  &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3B9;&#x3BF; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3B9;&#x3BC;&#x3B7; &#x3B2;&#x3AC;&#x3C3;&#x3B7; &#x3C6;&#x3CC;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3B7;&#x3C2; &#x3C0;&#x3BF;&#x3C5; &#x3AD;&#x3C7;&#x3B5;&#x3C4;&#x3B5; &#x3C7;&#x3C1;&#x3B7;&#x3C3;&#x3B9;&#x3BC;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3AE;&#x3C3;&#x3B5;&#x3B9;.</Description><Price>49.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/1/0/1014153_10151745142044919_1724764936_n.jpg</Image></product><product><SKU>BL-RF-PK</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Refresh - Pink</Name><Description>&#x3A4;&#x3BF; Refresh &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3AD;&#x3BD;&#x3B1;&#x3C2; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C9;&#x3C0;&#x3B9;&#x3BA;&#x3CC;&#x3C2; &#x3AE; &#x3BA;&#x3BF;&#x3B9;&#x3BD;&#x3CC;&#x3C2; &#x3C3;&#x3C4;&#x3B1;&#x3B8;&#x3BC;&#x3CC;&#x3C2; &#x3C6;&#x3CC;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3B7;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3BD; &#x3C4;&#x3B1;&#x3C5;&#x3C4;&#x3CC;&#x3C7;&#x3C1;&#x3BF;&#x3BD;&#x3B7; &#x3C6;&#x3CC;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3B7; &#x3C0;&#x3BF;&#x3BB;&#x3BB;&#x3B1;&#x3C0;&#x3BB;&#x3CE;&#x3BD; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3CE;&#x3BD;. &#x39C;&#x3B9;&#x3BA;&#x3C1;&#x3CC; &#x3C3;&#x3B5; &#x3BC;&#x3AD;&#x3B3;&#x3B5;&#x3B8;&#x3BF;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3C3;&#x3C5;&#x3BC;&#x3B2;&#x3B1;&#x3C4;&#x3CC; &#x3BC;&#x3B5; &#x3C4;&#x3B9;&#x3C2; &#x3C0;&#x3B5;&#x3C1;&#x3B9;&#x3C3;&#x3C3;&#x3CC;&#x3C4;&#x3B5;&#x3C1;&#x3B5;&#x3C2; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3B9;&#x3C2; &#x3BD;&#x3AD;&#x3B5;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3B1;&#x3B3;&#x3BF;&#x3C1;&#x3AC; &#x3C3;&#x3AE;&#x3BC;&#x3B5;&#x3C1;&#x3B1;, &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B5;&#x3BE;&#x3BF;&#x3C0;&#x3BB;&#x3B9;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3BC;&#x3B5; &#x3AD;&#x3BE;&#x3B9; connectors: &#x3B4;&#x3CD;&#x3BF; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3BF; iPod / iPhone, mini USB, micro USB &#x3BA;&#x3B1;&#x3B9; &#x3B4;&#x3CD;&#x3BF; &#x3B3;&#x3B9;&#x3B1; USB &#x3C5;&#x3C0;&#x3BF;&#x3B4;&#x3BF;&#x3C7;&#x3AD;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3C0;&#x3B5;&#x3C1;&#x3B1;&#x3B9;&#x3C4;&#x3AD;&#x3C1;&#x3C9; &#x3C0;&#x3B1;&#x3C1;&#x3B1;&#x3BC;&#x3B5;&#x3C4;&#x3C1;&#x3BF;&#x3C0;&#x3BF;&#x3AF;&#x3B7;&#x3C3;&#x3B7;.&#xD;
&#x3A0;&#x3C1;&#x3BF;&#x3C3;&#x3B1;&#x3C1;&#x3BC;&#x3BF;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3B1; connectors &#x3B3;&#x3B9;&#x3B1; &#x3B1;&#x3C5;&#x3BE;&#x3B7;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3C3;&#x3C5;&#x3BC;&#x3B2;&#x3B1;&#x3C4;&#x3CC;&#x3C4;&#x3B7;&#x3C4;&#x3B1; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B5;&#x3C0;&#x3AF;&#x3C3;&#x3B7;&#x3C2; &#x3B4;&#x3B9;&#x3B1;&#x3B8;&#x3AD;&#x3C3;&#x3B9;&#x3BC;&#x3B1; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3B7;&#x3BD; bluelounge.</Description><Price>29.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/r/f/rf_top_02.jpg</Image></product><product><SKU>BL-TS</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - The Sanctuary</Name><Description>&#x3A4;&#x3BF; Sanctuary &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x3CC;&#x3BC;&#x3BF;&#x3C1;&#x3C6;&#x3B7;, &#x3B1;&#x3C0;&#x3BB;&#x3AE; &#x3BB;&#x3CD;&#x3C3;&#x3B7; &#x3C3;&#x3B5; &#x3AD;&#x3BD;&#x3B1; &#x3BA;&#x3B1;&#x3B8;&#x3B7;&#x3BC;&#x3B5;&#x3C1;&#x3B9;&#x3BD;&#x3CC; &#x3C0;&#x3C1;&#x3CC;&#x3B2;&#x3BB;&#x3B7;&#x3BC;&#x3B1;. &#x388;&#x3BD;&#x3B1;&#x3C2; &#x3C5;&#x3C0;&#x3AD;&#x3C1;&#x3C4;&#x3B1;&#x3C4;&#x3BF;&#x3C2; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3C4;&#x3AE;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3AF;&#x3B6;&#x3B5;&#x3C4;&#x3B5; &#x3C4;&#x3B1;&#x3C5;&#x3C4;&#x3CC;&#x3C7;&#x3C1;&#x3BF;&#x3BD;&#x3B1; &#x3BC;&#x3B9;&#x3B1; &#x3C0;&#x3BB;&#x3B7;&#x3B8;&#x3CE;&#x3C1;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C9;&#x3C0;&#x3B9;&#x3BA;&#x3CE;&#x3BD; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3CE;&#x3BD; &#x3B1;&#x3C0;&#x3CC; PDA, &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3BF;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3BA;&#x3B9;&#x3BD;&#x3B7;&#x3C4;&#x3CC;, iPod, MP3 player,&#xD;
&#x3BC;&#x3AD;&#x3C7;&#x3C1;&#x3B9; &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3BA;&#x3BF;&#x3C5;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC; bluetooth. &#x3A3;&#x3C5;&#x3BC;&#x3B2;&#x3B1;&#x3C4;&#x3CC; &#x3BC;&#x3B5; &#x3C0;&#x3AC;&#x3BD;&#x3C9; &#x3B1;&#x3C0;&#x3CC; 3500 &#x3B7;&#x3BB;&#x3B5;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BD;&#x3B9;&#x3BA;&#x3AD;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3B9;&#x3C2; &#x3C0;&#x3B9;&#x3BF; &#x3BC;&#x3B5;&#x3B3;&#x3AC;&#x3BB;&#x3B5;&#x3C2; &#x3BC;&#x3AC;&#x3C1;&#x3BA;&#x3B5;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3BC;&#x3B5; &#x3BC;&#x3B9;&#x3B1; &#x3B8;&#x3CD;&#x3C1;&#x3B1; USB &#x3C0;&#x3BF;&#x3C5; &#x3B5;&#x3C0;&#x3B9;&#x3C4;&#x3C1;&#x3AD;&#x3C0;&#x3B5;&#x3B9; &#x3B5;&#x3BA;&#x3B1;&#x3C4;&#x3BF;&#x3BD;&#x3C4;&#x3AC;&#x3B4;&#x3B5;&#x3C2; &#x3B7;&#x3BB;&#x3B5;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BD;&#x3B9;&#x3BA;&#x3AD;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3BD;&#x3B1; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3C4;&#x3BF;&#x3CD;&#x3BD;, &#x3C7;&#x3C1;&#x3B7;&#x3C3;&#x3B9;&#x3BC;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3CE;&#x3BD;&#x3C4;&#x3B1;&#x3C2; &#x3BC;&#x3CC;&#x3BD;&#x3BF; &#x3C4;&#x3BF; Sanctuary. &#x3A3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3B3;&#x3B9;&#x3B1; &#x3BA;&#x3B1;&#x3B8;&#x3B7;&#x3BC;&#x3B5;&#x3C1;&#x3B9;&#x3BD;&#x3AE; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3B7; &#x3C3;&#x3C4;&#x3BF; &#x3BA;&#x3BF;&#x3BC;&#x3BF;&#x3B4;&#x3AF;&#x3BD;&#x3BF;, &#x3C3;&#x3C4;&#x3BF;&#x3BD; &#x3C0;&#x3AC;&#x3B3;&#x3BA;&#x3BF; &#x3C4;&#x3B7;&#x3C2; &#x3BA;&#x3BF;&#x3C5;&#x3B6;&#x3AF;&#x3BD;&#x3B1;&#x3C2;, &#x3C3;&#x3C4;&#x3BF; &#x3B3;&#x3C1;&#x3B1;&#x3C6;&#x3B5;&#x3AF;&#x3BF;&#x3C5;, &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3B5;&#x3AF;&#x3C3;&#x3BF;&#x3B4;&#x3BF; &#x3C4;&#x3BF;&#x3C5; &#x3C3;&#x3C0;&#x3B9;&#x3C4;&#x3B9;&#x3BF;&#x3CD;, &#x3B1;&#x3C6;&#x3BF;&#x3CD; &#x3BC;&#x3C0;&#x3BF;&#x3C1;&#x3B5;&#x3AF;&#x3C4;&#x3B5; &#x3C4;&#x3B1;&#x3C5;&#x3C4;&#x3CC;&#x3C7;&#x3C1;&#x3BF;&#x3BD;&#x3B1; &#x3BD;&#x3B1; &#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B8;&#x3B5;&#x3C4;&#x3AE;&#x3C3;&#x3B5;&#x3C4;&#x3B5; &#x3C4;&#x3B1; &#x3BA;&#x3BB;&#x3B5;&#x3B9;&#x3B4;&#x3B9;&#x3AC;, &#x3C4;&#x3BF; &#x3C0;&#x3BF;&#x3C1;&#x3C4;&#x3BF;&#x3C6;&#x3CC;&#x3BB;&#x3B9;, &#x3C4;&#x3BF; &#x3C1;&#x3BF;&#x3BB;&#x3CC;&#x3B9; &#x3AE; &#x3CC;&#x3C4;&#x3B9; &#x3AC;&#x3BB;&#x3BB;&#x3BF; &#x3C3;&#x3B1;&#x3C2; &#x3B5;&#x3BE;&#x3C5;&#x3C0;&#x3B7;&#x3C1;&#x3B5;&#x3C4;&#x3B5;&#x3AF;.</Description><Price>129.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/t/s/ts_014.jpg</Image></product><product><SKU>BL-TS-WH</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - The Sanctuary - White</Name><Description>&#x3A4;&#x3BF; Sanctuary &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x3CC;&#x3BC;&#x3BF;&#x3C1;&#x3C6;&#x3B7;, &#x3B1;&#x3C0;&#x3BB;&#x3AE; &#x3BB;&#x3CD;&#x3C3;&#x3B7; &#x3C3;&#x3B5; &#x3AD;&#x3BD;&#x3B1; &#x3BA;&#x3B1;&#x3B8;&#x3B7;&#x3BC;&#x3B5;&#x3C1;&#x3B9;&#x3BD;&#x3CC; &#x3C0;&#x3C1;&#x3CC;&#x3B2;&#x3BB;&#x3B7;&#x3BC;&#x3B1;. &#x388;&#x3BD;&#x3B1;&#x3C2; &#x3C5;&#x3C0;&#x3AD;&#x3C1;&#x3C4;&#x3B1;&#x3C4;&#x3BF;&#x3C2; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3C4;&#x3AE;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3AF;&#x3B6;&#x3B5;&#x3C4;&#x3B5; &#x3C4;&#x3B1;&#x3C5;&#x3C4;&#x3CC;&#x3C7;&#x3C1;&#x3BF;&#x3BD;&#x3B1; &#x3BC;&#x3B9;&#x3B1; &#x3C0;&#x3BB;&#x3B7;&#x3B8;&#x3CE;&#x3C1;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C9;&#x3C0;&#x3B9;&#x3BA;&#x3CE;&#x3BD; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3CE;&#x3BD; &#x3B5;&#x3AF;&#x3C4;&#x3B5; PDA, Blackberry, iPod, MP3 player &#x3AE; &#x3B1;&#x3BA;&#x3BF;&#x3C5;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC; bluetooth. &#x3A3;&#x3C5;&#x3BC;&#x3B2;&#x3B1;&#x3C4;&#x3CC; &#x3BC;&#x3B5; &#x3C0;&#x3AC;&#x3BD;&#x3C9; &#x3B1;&#x3C0;&#x3CC; 3.500 &#x3B7;&#x3BB;&#x3B5;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BD;&#x3B9;&#x3BA;&#x3AD;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3B9;&#x3C2; &#x3C0;&#x3B9;&#x3BF; &#x3BC;&#x3B5;&#x3B3;&#x3AC;&#x3BB;&#x3B5;&#x3C2; &#x3BC;&#x3AC;&#x3C1;&#x3BA;&#x3B5;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3BC;&#x3B5; &#x3BC;&#x3B9;&#x3B1; &#x3B8;&#x3CD;&#x3C1;&#x3B1; USB &#x3C0;&#x3BF;&#x3C5; &#x3B5;&#x3C0;&#x3B9;&#x3C4;&#x3C1;&#x3AD;&#x3C0;&#x3B5;&#x3B9; &#x3B5;&#x3BA;&#x3B1;&#x3C4;&#x3BF;&#x3BD;&#x3C4;&#x3AC;&#x3B4;&#x3B5;&#x3C2; &#x3B7;&#x3BB;&#x3B5;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BD;&#x3B9;&#x3BA;&#x3AD;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3BD;&#x3B1; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3C4;&#x3BF;&#x3CD;&#x3BD;, &#x3C7;&#x3C1;&#x3B7;&#x3C3;&#x3B9;&#x3BC;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3CE;&#x3BD;&#x3C4;&#x3B1;&#x3C2; &#x3BC;&#x3CC;&#x3BD;&#x3BF; &#x3C4;&#x3BF; Sanctuary.</Description><Price>129.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/2/5/257_17335749918_3106_n.jpg</Image></product><product><SKU>BL-TS-BK</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - The Sanctuary - Black</Name><Description>&#x3A4;&#x3BF; Sanctuary &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x3CC;&#x3BC;&#x3BF;&#x3C1;&#x3C6;&#x3B7;, &#x3B1;&#x3C0;&#x3BB;&#x3AE; &#x3BB;&#x3CD;&#x3C3;&#x3B7; &#x3C3;&#x3B5; &#x3AD;&#x3BD;&#x3B1; &#x3BA;&#x3B1;&#x3B8;&#x3B7;&#x3BC;&#x3B5;&#x3C1;&#x3B9;&#x3BD;&#x3CC; &#x3C0;&#x3C1;&#x3CC;&#x3B2;&#x3BB;&#x3B7;&#x3BC;&#x3B1;. &#x388;&#x3BD;&#x3B1;&#x3C2; &#x3C5;&#x3C0;&#x3AD;&#x3C1;&#x3C4;&#x3B1;&#x3C4;&#x3BF;&#x3C2; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3C4;&#x3AE;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3AF;&#x3B6;&#x3B5;&#x3C4;&#x3B5; &#x3C4;&#x3B1;&#x3C5;&#x3C4;&#x3CC;&#x3C7;&#x3C1;&#x3BF;&#x3BD;&#x3B1; &#x3BC;&#x3B9;&#x3B1; &#x3C0;&#x3BB;&#x3B7;&#x3B8;&#x3CE;&#x3C1;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C9;&#x3C0;&#x3B9;&#x3BA;&#x3CE;&#x3BD; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3CE;&#x3BD; &#x3B5;&#x3AF;&#x3C4;&#x3B5; PDA, Blackberry, iPod, MP3 player &#x3AE; &#x3B1;&#x3BA;&#x3BF;&#x3C5;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC; bluetooth. &#x3A3;&#x3C5;&#x3BC;&#x3B2;&#x3B1;&#x3C4;&#x3CC; &#x3BC;&#x3B5; &#x3C0;&#x3AC;&#x3BD;&#x3C9; &#x3B1;&#x3C0;&#x3CC; 3.500 &#x3B7;&#x3BB;&#x3B5;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BD;&#x3B9;&#x3BA;&#x3AD;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3B9;&#x3C2; &#x3C0;&#x3B9;&#x3BF; &#x3BC;&#x3B5;&#x3B3;&#x3AC;&#x3BB;&#x3B5;&#x3C2; &#x3BC;&#x3AC;&#x3C1;&#x3BA;&#x3B5;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3BC;&#x3B5; &#x3BC;&#x3B9;&#x3B1; &#x3B8;&#x3CD;&#x3C1;&#x3B1; USB &#x3C0;&#x3BF;&#x3C5; &#x3B5;&#x3C0;&#x3B9;&#x3C4;&#x3C1;&#x3AD;&#x3C0;&#x3B5;&#x3B9; &#x3B5;&#x3BA;&#x3B1;&#x3C4;&#x3BF;&#x3BD;&#x3C4;&#x3AC;&#x3B4;&#x3B5;&#x3C2; &#x3B7;&#x3BB;&#x3B5;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BD;&#x3B9;&#x3BA;&#x3AD;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3BD;&#x3B1; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3C4;&#x3BF;&#x3CD;&#x3BD;, &#x3C7;&#x3C1;&#x3B7;&#x3C3;&#x3B9;&#x3BC;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3CE;&#x3BD;&#x3C4;&#x3B1;&#x3C2; &#x3BC;&#x3CC;&#x3BD;&#x3BF; &#x3C4;&#x3BF; Sanctuary.</Description><Price>129.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/2/5/257_17335819918_5344_n.jpg</Image></product><product><SKU>BL-SD</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - StudioDesk</Name><Description>&#x3A4;&#x3BF; StudioDesk &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3AD;&#x3BD;&#x3B1; &#x3C0;&#x3B1;&#x3C1;&#x3B1;&#x3B4;&#x3BF;&#x3C3;&#x3B9;&#x3B1;&#x3BA;&#x3CC; &#x3C4;&#x3C1;&#x3B1;&#x3C0;&#x3AD;&#x3B6;&#x3B9; &#x3BC;&#x3B5; &#x3C3;&#x3CD;&#x3B3;&#x3C7;&#x3C1;&#x3BF;&#x3BD;&#x3BF; design. &#x388;&#x3BD;&#x3B1; &#x3B3;&#x3C1;&#x3B1;&#x3C6;&#x3B5;&#x3AF;&#x3BF; &#x3B5;&#x3B9;&#x3B4;&#x3B9;&#x3BA;&#x3AC; &#x3BA;&#x3B1;&#x3C4;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3B3;&#x3B9;&#x3B1; &#x3B1;&#x3BD;&#x3B8;&#x3C1;&#x3CE;&#x3C0;&#x3BF;&#x3C5;&#x3C2; &#x3C0;&#x3BF;&#x3C5; &#x3B1;&#x3BD;&#x3B1;&#x3B6;&#x3B7;&#x3C4;&#x3BF;&#x3CD;&#x3BD; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3BF;&#x3B9;&#x3CC;&#x3C4;&#x3B7;&#x3C4;&#x3B1;. &#x391;&#x3C5;&#x3C4;&#x3CC; &#x3C4;&#x3BF; &#x3B4;&#x3B9;&#x3B1;&#x3C7;&#x3C1;&#x3BF;&#x3BD;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3B3;&#x3B1;&#x3C6;&#x3B5;&#x3AF;&#x3BF; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BA;&#x3B1;&#x3C4;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3BC;&#x3B5; &#x3C0;&#x3CC;&#x3B4;&#x3B9;&#x3B1; &#x3B1;&#x3C0;&#x3CC; &#x3BC;&#x3B1;&#x3CC;&#x3BD;&#x3B9;, &#x3BB;&#x3B5;&#x3C5;&#x3BA;&#x3AE; &#x3B5;&#x3C0;&#x3B9;&#x3C6;&#x3AC;&#x3BD;&#x3B5;&#x3B9;&#x3B1;  &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3C0;&#x3BF;&#x3B8;&#x3B7;&#x3BA;&#x3B5;&#x3C5;&#x3C4;&#x3B9;&#x3BA;&#x3BF;&#x3CD;&#x3C2; &#x3C7;&#x3CE;&#x3C1;&#x3BF;&#x3C5;&#x3C2;  &#x3B3;&#x3B9;&#x3B1; &#x3BC;&#x3B5;&#x3B3;&#x3B1;&#x3BB;&#x3CD;&#x3C4;&#x3B5;&#x3C1;&#x3B7; &#x3B1;&#x3BD;&#x3C4;&#x3BF;&#x3C7;&#x3AE; &#x3BA;&#x3B1;&#x3B9; &#x3C7;&#x3C1;&#x3B7;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC;&#x3C4;&#x3B7;&#x3C4;&#x3B1;. &#x38C;&#x3BB;&#x3B1; &#x3C4;&#x3B1; &#x3C0;&#x3B5;&#x3C1;&#x3B9;&#x3C6;&#x3B5;&#x3C1;&#x3B5;&#x3B9;&#x3B1;&#x3BA;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3B1; &#x3C0;&#x3B5;&#x3C1;&#x3AF;&#x3C3;&#x3C3;&#x3B5;&#x3B9;&#x3B1; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; &#x3BA;&#x3C1;&#x3C5;&#x3BC;&#x3BC;&#x3AD;&#x3BD;&#x3B1; &#x3B1;&#x3BA;&#x3C1;&#x3B9;&#x3B2;&#x3CE;&#x3C2; &#x3BA;&#x3AC;&#x3C4;&#x3C9; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3B7;&#x3BD; &#x3BB;&#x3B5;&#x3C5;&#x3BA;&#x3AE; &#x3C3;&#x3C5;&#x3C1;&#x3CC;&#x3BC;&#x3B5;&#x3BD;&#x3B7; &#x3B5;&#x3C0;&#x3B9;&#x3C6;&#x3AC;&#x3BD;&#x3B5;&#x3B9;&#x3B1; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3C3;&#x3AF;&#x3B1;&#x3C2;. &#x388;&#x3C4;&#x3C3;&#x3B9; &#x3BF; &#x3B1;&#x3C0;&#x3BF;&#x3B8;&#x3B7;&#x3BA;&#x3B5;&#x3C5;&#x3C4;&#x3B9;&#x3BA;&#x3CC;&#x3C2; &#x3C7;&#x3CE;&#x3C1;&#x3BF;&#x3C2; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3B2;&#x3AC;&#x3C3;&#x3B9;&#x3BC;&#x3BF;&#x3C2;. &#x39C;&#x3AF;&#x3B1; &#x3B5;&#x3C0;&#x3B9;&#x3BC;&#x3AE;&#x3BA;&#x3B7;&#x3C2; &#x3C3;&#x3C7;&#x3B9;&#x3C3;&#x3BC;&#x3AE; &#x3C3;&#x3B5; &#x3CC;&#x3BB;&#x3BF; &#x3C4;&#x3BF; &#x3C0;&#x3BB;&#x3AC;&#x3C4;&#x3BF;&#x3C2; &#x3C4;&#x3B7;&#x3C2; &#x3B5;&#x3C0;&#x3B9;&#x3C6;&#x3AC;&#x3BD;&#x3B5;&#x3B9;&#x3B1;&#x3C2; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3C3;&#x3AF;&#x3B1;&#x3C2; &#x3B5;&#x3C0;&#x3B9;&#x3C4;&#x3C1;&#x3AD;&#x3C0;&#x3B5;&#x3B9; &#x3C3;&#x3C4;&#x3B1; &#x3B1;&#x3C0;&#x3B1;&#x3C1;&#x3B1;&#x3AF;&#x3C4;&#x3B7;&#x3C4;&#x3B1; &#x3C0;&#x3B5;&#x3C1;&#x3B9;&#x3C6;&#x3B5;&#x3C1;&#x3B5;&#x3B9;&#x3B1;&#x3BA;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3B1; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; &#x3C4;&#x3C1;&#x3BF;&#x3C6;&#x3BF;&#x3B4;&#x3BF;&#x3C3;&#x3AF;&#x3B1;&#x3C2; &#x3BD;&#x3B1; &#x3B5;&#x3B9;&#x3C3;&#x3AD;&#x3BB;&#x3B8;&#x3BF;&#x3C5;&#x3BD; / &#x3AD;&#x3BE;&#x3AD;&#x3BB;&#x3B8;&#x3BF;&#x3C5;&#x3BD; &#x3C3;&#x3B5; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3BF;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3C3;&#x3B7;&#x3BC;&#x3B5;&#x3AF;&#x3BF;, &#x3B4;&#x3B9;&#x3B1;&#x3C4;&#x3B7;&#x3C1;&#x3CE;&#x3BD;&#x3C4;&#x3B1;&#x3C2; &#x3AD;&#x3C4;&#x3C3;&#x3B9; &#x3C4;&#x3B7;&#x3BD; &#x3B5;&#x3C0;&#x3B9;&#x3C6;&#x3AC;&#x3BD;&#x3B5;&#x3B9;&#x3B1; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3C3;&#x3AF;&#x3B1;&#x3C2; &#x3BA;&#x3B1;&#x3B8;&#x3B1;&#x3C1;&#x3AE; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3B1;&#x3BA;&#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3AE;&#x3BC;&#x3B5;&#x3BD;&#x3B7;. &#x3A4;&#x3BF; StudioDesk &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C4;&#x3BF; &#x3B1;&#x3C0;&#x3CC;&#x3BB;&#x3C5;&#x3C4;&#x3BF; &#x3BF;&#x3C1;&#x3B3;&#x3B1;&#x3BD;&#x3C9;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3BB;&#x3B5;&#x3AF;&#x3BF; &#x3B3;&#x3B9;&#x3B1; &#x3AD;&#x3BD;&#x3B1; &#x3BA;&#x3B1;&#x3B8;&#x3B1;&#x3C1;&#x3CC; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3B1;&#x3BA;&#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3AE;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3C0;&#x3B5;&#x3C1;&#x3B9;&#x3B2;&#x3AC;&#x3BB;&#x3BB;&#x3BF;&#x3BD; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3C3;&#x3AF;&#x3B1;&#x3C2;.</Description><Price>690</Price><Image>http://www.gricgroup.gr/media/catalog/product/s/d/sd_003_1.jpg</Image></product><product><SKU>BL-SD-RG</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - StudioDesk - Regular</Name><Description>&#x3A4;&#x3BF; StudioDesk &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3AD;&#x3BD;&#x3B1; &#x3C0;&#x3B1;&#x3C1;&#x3B1;&#x3B4;&#x3BF;&#x3C3;&#x3B9;&#x3B1;&#x3BA;&#x3CC; &#x3C4;&#x3C1;&#x3B1;&#x3C0;&#x3AD;&#x3B6;&#x3B9; &#x3BC;&#x3B5; &#x3C3;&#x3CD;&#x3B3;&#x3C7;&#x3C1;&#x3BF;&#x3BD;&#x3BF; design. &#x388;&#x3BD;&#x3B1; &#x3B3;&#x3C1;&#x3B1;&#x3C6;&#x3B5;&#x3AF;&#x3BF; &#x3B5;&#x3B9;&#x3B4;&#x3B9;&#x3BA;&#x3AC; &#x3BA;&#x3B1;&#x3C4;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3B3;&#x3B9;&#x3B1; &#x3B1;&#x3BD;&#x3B8;&#x3C1;&#x3CE;&#x3C0;&#x3BF;&#x3C5;&#x3C2; &#x3C0;&#x3BF;&#x3C5; &#x3B1;&#x3BD;&#x3B1;&#x3B6;&#x3B7;&#x3C4;&#x3BF;&#x3CD;&#x3BD; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3BF;&#x3B9;&#x3CC;&#x3C4;&#x3B7;&#x3C4;&#x3B1;. &#x391;&#x3C5;&#x3C4;&#x3CC; &#x3C4;&#x3BF; &#x3B4;&#x3B9;&#x3B1;&#x3C7;&#x3C1;&#x3BF;&#x3BD;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3B3;&#x3B1;&#x3C6;&#x3B5;&#x3AF;&#x3BF; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BA;&#x3B1;&#x3C4;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3BC;&#x3B5; &#x3C0;&#x3CC;&#x3B4;&#x3B9;&#x3B1; &#x3B1;&#x3C0;&#x3CC; &#x3BC;&#x3B1;&#x3CC;&#x3BD;&#x3B9;, &#x3BB;&#x3B5;&#x3C5;&#x3BA;&#x3AE; &#x3B5;&#x3C0;&#x3B9;&#x3C6;&#x3AC;&#x3BD;&#x3B5;&#x3B9;&#x3B1;  &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3C0;&#x3BF;&#x3B8;&#x3B7;&#x3BA;&#x3B5;&#x3C5;&#x3C4;&#x3B9;&#x3BA;&#x3BF;&#x3CD;&#x3C2; &#x3C7;&#x3CE;&#x3C1;&#x3BF;&#x3C5;&#x3C2;  &#x3B3;&#x3B9;&#x3B1; &#x3BC;&#x3B5;&#x3B3;&#x3B1;&#x3BB;&#x3CD;&#x3C4;&#x3B5;&#x3C1;&#x3B7; &#x3B1;&#x3BD;&#x3C4;&#x3BF;&#x3C7;&#x3AE; &#x3BA;&#x3B1;&#x3B9; &#x3C7;&#x3C1;&#x3B7;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC;&#x3C4;&#x3B7;&#x3C4;&#x3B1;. &#x38C;&#x3BB;&#x3B1; &#x3C4;&#x3B1; &#x3C0;&#x3B5;&#x3C1;&#x3B9;&#x3C6;&#x3B5;&#x3C1;&#x3B5;&#x3B9;&#x3B1;&#x3BA;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3B1; &#x3C0;&#x3B5;&#x3C1;&#x3AF;&#x3C3;&#x3C3;&#x3B5;&#x3B9;&#x3B1; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; &#x3BA;&#x3C1;&#x3C5;&#x3BC;&#x3BC;&#x3AD;&#x3BD;&#x3B1; &#x3B1;&#x3BA;&#x3C1;&#x3B9;&#x3B2;&#x3CE;&#x3C2; &#x3BA;&#x3AC;&#x3C4;&#x3C9; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3B7;&#x3BD; &#x3BB;&#x3B5;&#x3C5;&#x3BA;&#x3AE; &#x3C3;&#x3C5;&#x3C1;&#x3CC;&#x3BC;&#x3B5;&#x3BD;&#x3B7; &#x3B5;&#x3C0;&#x3B9;&#x3C6;&#x3AC;&#x3BD;&#x3B5;&#x3B9;&#x3B1; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3C3;&#x3AF;&#x3B1;&#x3C2;. &#x388;&#x3C4;&#x3C3;&#x3B9; &#x3BF; &#x3B1;&#x3C0;&#x3BF;&#x3B8;&#x3B7;&#x3BA;&#x3B5;&#x3C5;&#x3C4;&#x3B9;&#x3BA;&#x3CC;&#x3C2; &#x3C7;&#x3CE;&#x3C1;&#x3BF;&#x3C2; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3B2;&#x3AC;&#x3C3;&#x3B9;&#x3BC;&#x3BF;&#x3C2;. &#x39C;&#x3AF;&#x3B1; &#x3B5;&#x3C0;&#x3B9;&#x3BC;&#x3AE;&#x3BA;&#x3B7;&#x3C2; &#x3C3;&#x3C7;&#x3B9;&#x3C3;&#x3BC;&#x3AE; &#x3C3;&#x3B5; &#x3CC;&#x3BB;&#x3BF; &#x3C4;&#x3BF; &#x3C0;&#x3BB;&#x3AC;&#x3C4;&#x3BF;&#x3C2; &#x3C4;&#x3B7;&#x3C2; &#x3B5;&#x3C0;&#x3B9;&#x3C6;&#x3AC;&#x3BD;&#x3B5;&#x3B9;&#x3B1;&#x3C2; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3C3;&#x3AF;&#x3B1;&#x3C2; &#x3B5;&#x3C0;&#x3B9;&#x3C4;&#x3C1;&#x3AD;&#x3C0;&#x3B5;&#x3B9; &#x3C3;&#x3C4;&#x3B1; &#x3B1;&#x3C0;&#x3B1;&#x3C1;&#x3B1;&#x3AF;&#x3C4;&#x3B7;&#x3C4;&#x3B1; &#x3C0;&#x3B5;&#x3C1;&#x3B9;&#x3C6;&#x3B5;&#x3C1;&#x3B5;&#x3B9;&#x3B1;&#x3BA;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3B1; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; &#x3C4;&#x3C1;&#x3BF;&#x3C6;&#x3BF;&#x3B4;&#x3BF;&#x3C3;&#x3AF;&#x3B1;&#x3C2; &#x3BD;&#x3B1; &#x3B5;&#x3B9;&#x3C3;&#x3AD;&#x3BB;&#x3B8;&#x3BF;&#x3C5;&#x3BD; / &#x3AD;&#x3BE;&#x3AD;&#x3BB;&#x3B8;&#x3BF;&#x3C5;&#x3BD; &#x3C3;&#x3B5; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3BF;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3C3;&#x3B7;&#x3BC;&#x3B5;&#x3AF;&#x3BF;, &#x3B4;&#x3B9;&#x3B1;&#x3C4;&#x3B7;&#x3C1;&#x3CE;&#x3BD;&#x3C4;&#x3B1;&#x3C2; &#x3AD;&#x3C4;&#x3C3;&#x3B9; &#x3C4;&#x3B7;&#x3BD; &#x3B5;&#x3C0;&#x3B9;&#x3C6;&#x3AC;&#x3BD;&#x3B5;&#x3B9;&#x3B1; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3C3;&#x3AF;&#x3B1;&#x3C2; &#x3BA;&#x3B1;&#x3B8;&#x3B1;&#x3C1;&#x3AE; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3B1;&#x3BA;&#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3AE;&#x3BC;&#x3B5;&#x3BD;&#x3B7;. &#x3A4;&#x3BF; StudioDesk &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C4;&#x3BF; &#x3B1;&#x3C0;&#x3CC;&#x3BB;&#x3C5;&#x3C4;&#x3BF; &#x3BF;&#x3C1;&#x3B3;&#x3B1;&#x3BD;&#x3C9;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3BB;&#x3B5;&#x3AF;&#x3BF; &#x3B3;&#x3B9;&#x3B1; &#x3AD;&#x3BD;&#x3B1; &#x3BA;&#x3B1;&#x3B8;&#x3B1;&#x3C1;&#x3CC; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3B1;&#x3BA;&#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3AE;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3C0;&#x3B5;&#x3C1;&#x3B9;&#x3B2;&#x3AC;&#x3BB;&#x3BB;&#x3BF;&#x3BD; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3C3;&#x3AF;&#x3B1;&#x3C2;.</Description><Price>690</Price><Image>http://www.gricgroup.gr/media/catalog/product/s/d/sd_018_2.jpg</Image></product><product><SKU>BL-SD-XL</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - StudioDesk - XL</Name><Description>&#x3A4;&#x3BF; StudioDesk &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3AD;&#x3BD;&#x3B1; &#x3C0;&#x3B1;&#x3C1;&#x3B1;&#x3B4;&#x3BF;&#x3C3;&#x3B9;&#x3B1;&#x3BA;&#x3CC; &#x3C4;&#x3C1;&#x3B1;&#x3C0;&#x3AD;&#x3B6;&#x3B9; &#x3BC;&#x3B5; &#x3C3;&#x3CD;&#x3B3;&#x3C7;&#x3C1;&#x3BF;&#x3BD;&#x3BF; design. &#x388;&#x3BD;&#x3B1; &#x3B3;&#x3C1;&#x3B1;&#x3C6;&#x3B5;&#x3AF;&#x3BF; &#x3B5;&#x3B9;&#x3B4;&#x3B9;&#x3BA;&#x3AC; &#x3BA;&#x3B1;&#x3C4;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3B3;&#x3B9;&#x3B1; &#x3B1;&#x3BD;&#x3B8;&#x3C1;&#x3CE;&#x3C0;&#x3BF;&#x3C5;&#x3C2; &#x3C0;&#x3BF;&#x3C5; &#x3B1;&#x3BD;&#x3B1;&#x3B6;&#x3B7;&#x3C4;&#x3BF;&#x3CD;&#x3BD; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3BF;&#x3B9;&#x3CC;&#x3C4;&#x3B7;&#x3C4;&#x3B1;. &#x391;&#x3C5;&#x3C4;&#x3CC; &#x3C4;&#x3BF; &#x3B4;&#x3B9;&#x3B1;&#x3C7;&#x3C1;&#x3BF;&#x3BD;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3B3;&#x3B1;&#x3C6;&#x3B5;&#x3AF;&#x3BF; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BA;&#x3B1;&#x3C4;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3BC;&#x3B5; &#x3C0;&#x3CC;&#x3B4;&#x3B9;&#x3B1; &#x3B1;&#x3C0;&#x3CC; &#x3BC;&#x3B1;&#x3CC;&#x3BD;&#x3B9;, &#x3BB;&#x3B5;&#x3C5;&#x3BA;&#x3AE; &#x3B5;&#x3C0;&#x3B9;&#x3C6;&#x3AC;&#x3BD;&#x3B5;&#x3B9;&#x3B1;  &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3C0;&#x3BF;&#x3B8;&#x3B7;&#x3BA;&#x3B5;&#x3C5;&#x3C4;&#x3B9;&#x3BA;&#x3BF;&#x3CD;&#x3C2; &#x3C7;&#x3CE;&#x3C1;&#x3BF;&#x3C5;&#x3C2;  &#x3B3;&#x3B9;&#x3B1; &#x3BC;&#x3B5;&#x3B3;&#x3B1;&#x3BB;&#x3CD;&#x3C4;&#x3B5;&#x3C1;&#x3B7; &#x3B1;&#x3BD;&#x3C4;&#x3BF;&#x3C7;&#x3AE; &#x3BA;&#x3B1;&#x3B9; &#x3C7;&#x3C1;&#x3B7;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC;&#x3C4;&#x3B7;&#x3C4;&#x3B1;. &#x38C;&#x3BB;&#x3B1; &#x3C4;&#x3B1; &#x3C0;&#x3B5;&#x3C1;&#x3B9;&#x3C6;&#x3B5;&#x3C1;&#x3B5;&#x3B9;&#x3B1;&#x3BA;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3B1; &#x3C0;&#x3B5;&#x3C1;&#x3AF;&#x3C3;&#x3C3;&#x3B5;&#x3B9;&#x3B1; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; &#x3BA;&#x3C1;&#x3C5;&#x3BC;&#x3BC;&#x3AD;&#x3BD;&#x3B1; &#x3B1;&#x3BA;&#x3C1;&#x3B9;&#x3B2;&#x3CE;&#x3C2; &#x3BA;&#x3AC;&#x3C4;&#x3C9; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3B7;&#x3BD; &#x3BB;&#x3B5;&#x3C5;&#x3BA;&#x3AE; &#x3C3;&#x3C5;&#x3C1;&#x3CC;&#x3BC;&#x3B5;&#x3BD;&#x3B7; &#x3B5;&#x3C0;&#x3B9;&#x3C6;&#x3AC;&#x3BD;&#x3B5;&#x3B9;&#x3B1; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3C3;&#x3AF;&#x3B1;&#x3C2;. &#x388;&#x3C4;&#x3C3;&#x3B9; &#x3BF; &#x3B1;&#x3C0;&#x3BF;&#x3B8;&#x3B7;&#x3BA;&#x3B5;&#x3C5;&#x3C4;&#x3B9;&#x3BA;&#x3CC;&#x3C2; &#x3C7;&#x3CE;&#x3C1;&#x3BF;&#x3C2; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3B2;&#x3AC;&#x3C3;&#x3B9;&#x3BC;&#x3BF;&#x3C2;. &#x39C;&#x3AF;&#x3B1; &#x3B5;&#x3C0;&#x3B9;&#x3BC;&#x3AE;&#x3BA;&#x3B7;&#x3C2; &#x3C3;&#x3C7;&#x3B9;&#x3C3;&#x3BC;&#x3AE; &#x3C3;&#x3B5; &#x3CC;&#x3BB;&#x3BF; &#x3C4;&#x3BF; &#x3C0;&#x3BB;&#x3AC;&#x3C4;&#x3BF;&#x3C2; &#x3C4;&#x3B7;&#x3C2; &#x3B5;&#x3C0;&#x3B9;&#x3C6;&#x3AC;&#x3BD;&#x3B5;&#x3B9;&#x3B1;&#x3C2; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3C3;&#x3AF;&#x3B1;&#x3C2; &#x3B5;&#x3C0;&#x3B9;&#x3C4;&#x3C1;&#x3AD;&#x3C0;&#x3B5;&#x3B9; &#x3C3;&#x3C4;&#x3B1; &#x3B1;&#x3C0;&#x3B1;&#x3C1;&#x3B1;&#x3AF;&#x3C4;&#x3B7;&#x3C4;&#x3B1; &#x3C0;&#x3B5;&#x3C1;&#x3B9;&#x3C6;&#x3B5;&#x3C1;&#x3B5;&#x3B9;&#x3B1;&#x3BA;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3B1; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; &#x3C4;&#x3C1;&#x3BF;&#x3C6;&#x3BF;&#x3B4;&#x3BF;&#x3C3;&#x3AF;&#x3B1;&#x3C2; &#x3BD;&#x3B1; &#x3B5;&#x3B9;&#x3C3;&#x3AD;&#x3BB;&#x3B8;&#x3BF;&#x3C5;&#x3BD; / &#x3AD;&#x3BE;&#x3AD;&#x3BB;&#x3B8;&#x3BF;&#x3C5;&#x3BD; &#x3C3;&#x3B5; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3BF;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3C3;&#x3B7;&#x3BC;&#x3B5;&#x3AF;&#x3BF;, &#x3B4;&#x3B9;&#x3B1;&#x3C4;&#x3B7;&#x3C1;&#x3CE;&#x3BD;&#x3C4;&#x3B1;&#x3C2; &#x3AD;&#x3C4;&#x3C3;&#x3B9; &#x3C4;&#x3B7;&#x3BD; &#x3B5;&#x3C0;&#x3B9;&#x3C6;&#x3AC;&#x3BD;&#x3B5;&#x3B9;&#x3B1; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3C3;&#x3AF;&#x3B1;&#x3C2; &#x3BA;&#x3B1;&#x3B8;&#x3B1;&#x3C1;&#x3AE; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3B1;&#x3BA;&#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3AE;&#x3BC;&#x3B5;&#x3BD;&#x3B7;. &#x3A4;&#x3BF; StudioDesk &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C4;&#x3BF; &#x3B1;&#x3C0;&#x3CC;&#x3BB;&#x3C5;&#x3C4;&#x3BF; &#x3BF;&#x3C1;&#x3B3;&#x3B1;&#x3BD;&#x3C9;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3BB;&#x3B5;&#x3AF;&#x3BF; &#x3B3;&#x3B9;&#x3B1; &#x3AD;&#x3BD;&#x3B1; &#x3BA;&#x3B1;&#x3B8;&#x3B1;&#x3C1;&#x3CC; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3B1;&#x3BA;&#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3AE;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3C0;&#x3B5;&#x3C1;&#x3B9;&#x3B2;&#x3AC;&#x3BB;&#x3BB;&#x3BF;&#x3BD; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3C3;&#x3AF;&#x3B1;&#x3C2;.</Description><Price>920</Price><Image>http://www.gricgroup.gr/media/catalog/product/s/d/sd_005_1.jpg</Image></product><product><SKU>BL-SH</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Shells</Name><Description>&#x38C;&#x3BC;&#x3BF;&#x3C1;&#x3C6;&#x3B1; &amp; &#x3AD;&#x3BE;&#x3C5;&#x3C0;&#x3BD;&#x3B1;, &#x3AC;&#x3BE;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3CD;&#x3C3;&#x3BF;&#x3C5;&#x3BD; &#x3C4;&#x3BF; &#x3C0;&#x3BF;&#x3BB;&#x3CD;&#x3C4;&#x3B9;&#x3BC;&#x3BF; iPad &#x3C3;&#x3B1;&#x3C2;. &#x391;&#x3BD;&#x3B8;&#x3B5;&#x3BA;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3B4;&#x3C5;&#x3BD;&#x3B1;&#x3C4;&#x3AC;, &#x3B1;&#x3BB;&#x3BB;&#x3AC; &#x3B1;&#x3C1;&#x3BA;&#x3B5;&#x3C4;&#x3AC; &#x3B5;&#x3BB;&#x3B1;&#x3C6;&#x3C1;&#x3B9;&#x3AC;, &#x3CE;&#x3C3;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3B1;&#x3C0;&#x3BF;&#x3C6;&#x3CD;&#x3B3;&#x3BF;&#x3C5;&#x3BC;&#x3B5; &#x3BC;&#x3B9;&#x3B1; &#x3BF;&#x3B3;&#x3BA;&#x3CE;&#x3B4;&#x3B7; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE;.&#x3A6;&#x3B9;&#x3BD;&#x3B9;&#x3C1;&#x3B9;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3B1; &#x3BC;&#x3B5; &#x3B5;&#x3BB;&#x3BA;&#x3C5;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC; soft-touch &#x3C7;&#x3C1;&#x3CE;&#x3BC;&#x3B1;, &#x3B1;&#x3C5;&#x3C4;&#x3AC; &#x3C4;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3C5;&#x3C4;&#x3B9;&#x3BA;&#x3AC; Shells &#x3B1;&#x3C0;&#x3BF;&#x3C4;&#x3B5;&#x3BB;&#x3BF;&#x3CD;&#x3BD; &#x3B5;&#x3C5;&#x3C7;&#x3B1;&#x3C1;&#x3AF;&#x3C3;&#x3C4;&#x3B7;&#x3C3;&#x3B7; &#x3BD;&#x3B1; &#x3C4;&#x3B1; &#x3B1;&#x3B3;&#x3B3;&#x3AF;&#x3B6;&#x3B5;&#x3B9;&#x3C2;</Description><Price>14.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/s/c/screen-shot-2011-10-04-at-11.55.32-am_1.png</Image></product><product><SKU>BL-SH-FL-WH</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Shells - Flower - White</Name><Description>&#x3A3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3B1; &#x3BC;&#x3B5; &#x3C4;&#x3B7; &#x3BB;&#x3B5;&#x3B9;&#x3C4;&#x3BF;&#x3C5;&#x3C1;&#x3B3;&#x3AF;&#x3B1; &#x3C4;&#x3BF;&#x3C5; iPad &#x3BA;&#x3B1;&#x3C4;&#x3AC; &#x3BD;&#x3BF;&#x3C5;, &#x3C4;&#x3B1; Shells &#x3B4;&#x3B5;&#x3BD; &#x3BA;&#x3B1;&#x3BB;&#x3CD;&#x3C0;&#x3C4;&#x3BF;&#x3C5;&#x3BD;&#xD;
&#x3BA;&#x3C1;&#x3CD;&#x3B2;&#x3BF;&#x3C5;&#x3BD; &#x3C0;&#x3BB;&#x3AE;&#x3BA;&#x3C4;&#x3C1;&#x3B1; &#x3AE; &#x3B2;&#x3B1;&#x3C3;&#x3B9;&#x3BA;&#x3AC; &#x3C7;&#x3B1;&#x3C1;&#x3B1;&#x3BA;&#x3C4;&#x3B7;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC;. &#x38C;&#x3BC;&#x3BF;&#x3C1;&#x3C6;&#x3B1; &amp; &#x3AD;&#x3BE;&#x3C5;&#x3C0;&#x3BD;&#x3B1;, &#x3AC;&#x3BE;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3CD;&#x3C3;&#x3BF;&#x3C5;&#x3BD; &#x3C4;&#x3BF; &#x3C0;&#x3BF;&#x3BB;&#x3CD;&#x3C4;&#x3B9;&#x3BC;&#x3BF; iPad &#x3C3;&#x3B1;&#x3C2;. &#x391;&#x3BD;&#x3B8;&#x3B5;&#x3BA;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3B4;&#x3C5;&#x3BD;&#x3B1;&#x3C4;&#x3AC;, &#x3B1;&#x3BB;&#x3BB;&#x3AC; &#x3B1;&#x3C1;&#x3BA;&#x3B5;&#x3C4;&#x3AC; &#x3B5;&#x3BB;&#x3B1;&#x3C6;&#x3C1;&#x3B9;&#x3AC;, &#x3CE;&#x3C3;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3B1;&#x3C0;&#x3BF;&#x3C6;&#x3CD;&#x3B3;&#x3BF;&#x3C5;&#x3BC;&#x3B5; &#x3BC;&#x3B9;&#x3B1; &#x3BF;&#x3B3;&#x3BA;&#x3CE;&#x3B4;&#x3B7; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE;. &#x3A6;&#x3B9;&#x3BD;&#x3B9;&#x3C1;&#x3B9;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3B1; &#x3BC;&#x3B5; &#x3B5;&#x3BB;&#x3BA;&#x3C5;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC; soft-touch &#x3C7;&#x3C1;&#x3CE;&#x3BC;&#x3B1;, &#x3B1;&#x3C5;&#x3C4;&#x3AC; &#x3C4;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3C5;&#x3C4;&#x3B9;&#x3BA;&#x3AC; Shells &#x3B1;&#x3C0;&#x3BF;&#x3C4;&#x3B5;&#x3BB;&#x3BF;&#x3CD;&#x3BD; &#x3B5;&#x3C5;&#x3C7;&#x3B1;&#x3C1;&#x3AF;&#x3C3;&#x3C4;&#x3B7;&#x3C3;&#x3B7; &#x3BD;&#x3B1; &#x3C4;&#x3B1; &#x3B1;&#x3B3;&#x3B3;&#x3AF;&#x3B6;&#x3B5;&#x3B9;&#x3C2;. &#x394;&#x3B9;&#x3B1;&#x3C4;&#x3AF;&#x3B8;&#x3B5;&#x3BD;&#x3C4;&#x3B1;&#x3B9; &#x3C3;&#x3B5; &#x3C4;&#x3C1;&#x3AF;&#x3B1; &#x3B4;&#x3B9;&#x3B1;&#x3C6;&#x3BF;&#x3C1;&#x3B5;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3B4;&#x3B9;&#x3B1;&#x3BA;&#x3C1;&#x3B9;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3C7;&#x3AD;&#x3B4;&#x3B9;&#x3B1;.</Description><Price>14.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/s/h/sh_top_06_3.jpg</Image></product><product><SKU>BL-SH-FL-BK</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Shells - Flower - Black</Name><Description>&#x3A3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3B1; &#x3BC;&#x3B5; &#x3C4;&#x3B7; &#x3BB;&#x3B5;&#x3B9;&#x3C4;&#x3BF;&#x3C5;&#x3C1;&#x3B3;&#x3AF;&#x3B1; &#x3C4;&#x3BF;&#x3C5; iPad &#x3BA;&#x3B1;&#x3C4;&#x3AC; &#x3BD;&#x3BF;&#x3C5;, &#x3C4;&#x3B1; Shells &#x3B4;&#x3B5;&#x3BD; &#x3BA;&#x3B1;&#x3BB;&#x3CD;&#x3C0;&#x3C4;&#x3BF;&#x3C5;&#x3BD;/&#xD;
&#x3BA;&#x3C1;&#x3CD;&#x3B2;&#x3BF;&#x3C5;&#x3BD; &#x3C0;&#x3BB;&#x3AE;&#x3BA;&#x3C4;&#x3C1;&#x3B1; &#x3AE; &#x3B2;&#x3B1;&#x3C3;&#x3B9;&#x3BA;&#x3AC; &#x3C7;&#x3B1;&#x3C1;&#x3B1;&#x3BA;&#x3C4;&#x3B7;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC;. &#x38C;&#x3BC;&#x3BF;&#x3C1;&#x3C6;&#x3B1; &amp; &#x3AD;&#x3BE;&#x3C5;&#x3C0;&#x3BD;&#x3B1;, &#x3AC;&#x3BE;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3CD;&#x3C3;&#x3BF;&#x3C5;&#x3BD; &#x3C4;&#x3BF; &#x3C0;&#x3BF;&#x3BB;&#x3CD;&#x3C4;&#x3B9;&#x3BC;&#x3BF; iPad &#x3C3;&#x3B1;&#x3C2;. &#x391;&#x3BD;&#x3B8;&#x3B5;&#x3BA;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3B4;&#x3C5;&#x3BD;&#x3B1;&#x3C4;&#x3AC;, &#x3B1;&#x3BB;&#x3BB;&#x3AC; &#x3B1;&#x3C1;&#x3BA;&#x3B5;&#x3C4;&#x3AC; &#x3B5;&#x3BB;&#x3B1;&#x3C6;&#x3C1;&#x3B9;&#x3AC;, &#x3CE;&#x3C3;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3B1;&#x3C0;&#x3BF;&#x3C6;&#x3CD;&#x3B3;&#x3BF;&#x3C5;&#x3BC;&#x3B5; &#x3BC;&#x3B9;&#x3B1; &#x3BF;&#x3B3;&#x3BA;&#x3CE;&#x3B4;&#x3B7; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE;. &#x3A6;&#x3B9;&#x3BD;&#x3B9;&#x3C1;&#x3B9;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3B1; &#x3BC;&#x3B5; &#x3B5;&#x3BB;&#x3BA;&#x3C5;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC; soft-touch &#x3C7;&#x3C1;&#x3CE;&#x3BC;&#x3B1;, &#x3B1;&#x3C5;&#x3C4;&#x3AC; &#x3C4;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3C5;&#x3C4;&#x3B9;&#x3BA;&#x3AC; Shells &#x3B1;&#x3C0;&#x3BF;&#x3C4;&#x3B5;&#x3BB;&#x3BF;&#x3CD;&#x3BD; &#x3B5;&#x3C5;&#x3C7;&#x3B1;&#x3C1;&#x3AF;&#x3C3;&#x3C4;&#x3B7;&#x3C3;&#x3B7; &#x3BD;&#x3B1; &#x3C4;&#x3B1; &#x3B1;&#x3B3;&#x3B3;&#x3AF;&#x3B6;&#x3B5;&#x3B9;&#x3C2;. &#x394;&#x3B9;&#x3B1;&#x3C4;&#x3AF;&#x3B8;&#x3B5;&#x3BD;&#x3C4;&#x3B1;&#x3B9; &#x3C3;&#x3B5; &#x3C4;&#x3C1;&#x3AF;&#x3B1; &#x3B4;&#x3B9;&#x3B1;&#x3C6;&#x3BF;&#x3C1;&#x3B5;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3B4;&#x3B9;&#x3B1;&#x3BA;&#x3C1;&#x3B9;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3C7;&#x3AD;&#x3B4;&#x3B9;&#x3B1;.</Description><Price>14.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/s/h/sh_top_05_1.jpg</Image></product><product><SKU>BL-SH-TR-BK</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Shells - Tartan - Black</Name><Description>&#x3A3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3B1; &#x3BC;&#x3B5; &#x3C4;&#x3B7; &#x3BB;&#x3B5;&#x3B9;&#x3C4;&#x3BF;&#x3C5;&#x3C1;&#x3B3;&#x3AF;&#x3B1; &#x3C4;&#x3BF;&#x3C5; iPad &#x3BA;&#x3B1;&#x3C4;&#x3AC; &#x3BD;&#x3BF;&#x3C5;, &#x3C4;&#x3B1; Shells &#x3B4;&#x3B5;&#x3BD; &#x3BA;&#x3B1;&#x3BB;&#x3CD;&#x3C0;&#x3C4;&#x3BF;&#x3C5;&#x3BD;/&#xD;
&#x3BA;&#x3C1;&#x3CD;&#x3B2;&#x3BF;&#x3C5;&#x3BD; &#x3C0;&#x3BB;&#x3AE;&#x3BA;&#x3C4;&#x3C1;&#x3B1; &#x3AE; &#x3B2;&#x3B1;&#x3C3;&#x3B9;&#x3BA;&#x3AC; &#x3C7;&#x3B1;&#x3C1;&#x3B1;&#x3BA;&#x3C4;&#x3B7;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC;. &#x38C;&#x3BC;&#x3BF;&#x3C1;&#x3C6;&#x3B1; &amp; &#x3AD;&#x3BE;&#x3C5;&#x3C0;&#x3BD;&#x3B1;, &#x3AC;&#x3BE;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3CD;&#x3C3;&#x3BF;&#x3C5;&#x3BD; &#x3C4;&#x3BF; &#x3C0;&#x3BF;&#x3BB;&#x3CD;&#x3C4;&#x3B9;&#x3BC;&#x3BF; iPad &#x3C3;&#x3B1;&#x3C2;. &#x391;&#x3BD;&#x3B8;&#x3B5;&#x3BA;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3B4;&#x3C5;&#x3BD;&#x3B1;&#x3C4;&#x3AC;, &#x3B1;&#x3BB;&#x3BB;&#x3AC; &#x3B1;&#x3C1;&#x3BA;&#x3B5;&#x3C4;&#x3AC; &#x3B5;&#x3BB;&#x3B1;&#x3C6;&#x3C1;&#x3B9;&#x3AC;, &#x3CE;&#x3C3;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3B1;&#x3C0;&#x3BF;&#x3C6;&#x3CD;&#x3B3;&#x3BF;&#x3C5;&#x3BC;&#x3B5; &#x3BC;&#x3B9;&#x3B1; &#x3BF;&#x3B3;&#x3BA;&#x3CE;&#x3B4;&#x3B7; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE;. &#x3A6;&#x3B9;&#x3BD;&#x3B9;&#x3C1;&#x3B9;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3B1; &#x3BC;&#x3B5; &#x3B5;&#x3BB;&#x3BA;&#x3C5;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC; soft-touch &#x3C7;&#x3C1;&#x3CE;&#x3BC;&#x3B1;, &#x3B1;&#x3C5;&#x3C4;&#x3AC; &#x3C4;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3C5;&#x3C4;&#x3B9;&#x3BA;&#x3AC; Shells &#x3B1;&#x3C0;&#x3BF;&#x3C4;&#x3B5;&#x3BB;&#x3BF;&#x3CD;&#x3BD; &#x3B5;&#x3C5;&#x3C7;&#x3B1;&#x3C1;&#x3AF;&#x3C3;&#x3C4;&#x3B7;&#x3C3;&#x3B7; &#x3BD;&#x3B1; &#x3C4;&#x3B1; &#x3B1;&#x3B3;&#x3B3;&#x3AF;&#x3B6;&#x3B5;&#x3B9;&#x3C2;. &#x394;&#x3B9;&#x3B1;&#x3C4;&#x3AF;&#x3B8;&#x3B5;&#x3BD;&#x3C4;&#x3B1;&#x3B9; &#x3C3;&#x3B5; &#x3C4;&#x3C1;&#x3AF;&#x3B1; &#x3B4;&#x3B9;&#x3B1;&#x3C6;&#x3BF;&#x3C1;&#x3B5;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3B4;&#x3B9;&#x3B1;&#x3BA;&#x3C1;&#x3B9;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3C7;&#x3AD;&#x3B4;&#x3B9;&#x3B1;.</Description><Price>14.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/s/h/sh_top_05_2.jpg</Image></product><product><SKU>BL-SH-TR-WH</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Shells - Tartan - White</Name><Description>&#x3A3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3B1; &#x3BC;&#x3B5; &#x3C4;&#x3B7; &#x3BB;&#x3B5;&#x3B9;&#x3C4;&#x3BF;&#x3C5;&#x3C1;&#x3B3;&#x3AF;&#x3B1; &#x3C4;&#x3BF;&#x3C5; iPad &#x3BA;&#x3B1;&#x3C4;&#x3AC; &#x3BD;&#x3BF;&#x3C5;, &#x3C4;&#x3B1; Shells &#x3B4;&#x3B5;&#x3BD; &#x3BA;&#x3B1;&#x3BB;&#x3CD;&#x3C0;&#x3C4;&#x3BF;&#x3C5;&#x3BD;/&#xD;
&#x3BA;&#x3C1;&#x3CD;&#x3B2;&#x3BF;&#x3C5;&#x3BD; &#x3C0;&#x3BB;&#x3AE;&#x3BA;&#x3C4;&#x3C1;&#x3B1; &#x3AE; &#x3B2;&#x3B1;&#x3C3;&#x3B9;&#x3BA;&#x3AC; &#x3C7;&#x3B1;&#x3C1;&#x3B1;&#x3BA;&#x3C4;&#x3B7;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC;. &#x38C;&#x3BC;&#x3BF;&#x3C1;&#x3C6;&#x3B1; &amp; &#x3AD;&#x3BE;&#x3C5;&#x3C0;&#x3BD;&#x3B1;, &#x3AC;&#x3BE;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3CD;&#x3C3;&#x3BF;&#x3C5;&#x3BD; &#x3C4;&#x3BF; &#x3C0;&#x3BF;&#x3BB;&#x3CD;&#x3C4;&#x3B9;&#x3BC;&#x3BF; iPad &#x3C3;&#x3B1;&#x3C2;. &#x391;&#x3BD;&#x3B8;&#x3B5;&#x3BA;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3B4;&#x3C5;&#x3BD;&#x3B1;&#x3C4;&#x3AC;, &#x3B1;&#x3BB;&#x3BB;&#x3AC; &#x3B1;&#x3C1;&#x3BA;&#x3B5;&#x3C4;&#x3AC; &#x3B5;&#x3BB;&#x3B1;&#x3C6;&#x3C1;&#x3B9;&#x3AC;, &#x3CE;&#x3C3;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3B1;&#x3C0;&#x3BF;&#x3C6;&#x3CD;&#x3B3;&#x3BF;&#x3C5;&#x3BC;&#x3B5; &#x3BC;&#x3B9;&#x3B1; &#x3BF;&#x3B3;&#x3BA;&#x3CE;&#x3B4;&#x3B7; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE;. &#x3A6;&#x3B9;&#x3BD;&#x3B9;&#x3C1;&#x3B9;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3B1; &#x3BC;&#x3B5; &#x3B5;&#x3BB;&#x3BA;&#x3C5;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC; soft-touch &#x3C7;&#x3C1;&#x3CE;&#x3BC;&#x3B1;, &#x3B1;&#x3C5;&#x3C4;&#x3AC; &#x3C4;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3C5;&#x3C4;&#x3B9;&#x3BA;&#x3AC; Shells &#x3B1;&#x3C0;&#x3BF;&#x3C4;&#x3B5;&#x3BB;&#x3BF;&#x3CD;&#x3BD; &#x3B5;&#x3C5;&#x3C7;&#x3B1;&#x3C1;&#x3AF;&#x3C3;&#x3C4;&#x3B7;&#x3C3;&#x3B7; &#x3BD;&#x3B1; &#x3C4;&#x3B1; &#x3B1;&#x3B3;&#x3B3;&#x3AF;&#x3B6;&#x3B5;&#x3B9;&#x3C2;. &#x394;&#x3B9;&#x3B1;&#x3C4;&#x3AF;&#x3B8;&#x3B5;&#x3BD;&#x3C4;&#x3B1;&#x3B9; &#x3C3;&#x3B5; &#x3C4;&#x3C1;&#x3AF;&#x3B1; &#x3B4;&#x3B9;&#x3B1;&#x3C6;&#x3BF;&#x3C1;&#x3B5;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3B4;&#x3B9;&#x3B1;&#x3BA;&#x3C1;&#x3B9;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3C7;&#x3AD;&#x3B4;&#x3B9;&#x3B1;.</Description><Price>14.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/s/h/sh_top_06_1.jpg</Image></product><product><SKU>BL-SH-GL-WH</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Shells - Golf - White</Name><Description>&#x3A3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3B1; &#x3BC;&#x3B5; &#x3C4;&#x3B7; &#x3BB;&#x3B5;&#x3B9;&#x3C4;&#x3BF;&#x3C5;&#x3C1;&#x3B3;&#x3AF;&#x3B1; &#x3C4;&#x3BF;&#x3C5; iPad &#x3BA;&#x3B1;&#x3C4;&#x3AC; &#x3BD;&#x3BF;&#x3C5;, &#x3C4;&#x3B1; Shells &#x3B4;&#x3B5;&#x3BD; &#x3BA;&#x3B1;&#x3BB;&#x3CD;&#x3C0;&#x3C4;&#x3BF;&#x3C5;&#x3BD;/&#xD;
&#x3BA;&#x3C1;&#x3CD;&#x3B2;&#x3BF;&#x3C5;&#x3BD; &#x3C0;&#x3BB;&#x3AE;&#x3BA;&#x3C4;&#x3C1;&#x3B1; &#x3AE; &#x3B2;&#x3B1;&#x3C3;&#x3B9;&#x3BA;&#x3AC; &#x3C7;&#x3B1;&#x3C1;&#x3B1;&#x3BA;&#x3C4;&#x3B7;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC;. &#x38C;&#x3BC;&#x3BF;&#x3C1;&#x3C6;&#x3B1; &amp; &#x3AD;&#x3BE;&#x3C5;&#x3C0;&#x3BD;&#x3B1;, &#x3AC;&#x3BE;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3CD;&#x3C3;&#x3BF;&#x3C5;&#x3BD; &#x3C4;&#x3BF; &#x3C0;&#x3BF;&#x3BB;&#x3CD;&#x3C4;&#x3B9;&#x3BC;&#x3BF; iPad &#x3C3;&#x3B1;&#x3C2;. &#x391;&#x3BD;&#x3B8;&#x3B5;&#x3BA;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3B4;&#x3C5;&#x3BD;&#x3B1;&#x3C4;&#x3AC;, &#x3B1;&#x3BB;&#x3BB;&#x3AC; &#x3B1;&#x3C1;&#x3BA;&#x3B5;&#x3C4;&#x3AC; &#x3B5;&#x3BB;&#x3B1;&#x3C6;&#x3C1;&#x3B9;&#x3AC;, &#x3CE;&#x3C3;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3B1;&#x3C0;&#x3BF;&#x3C6;&#x3CD;&#x3B3;&#x3BF;&#x3C5;&#x3BC;&#x3B5; &#x3BC;&#x3B9;&#x3B1; &#x3BF;&#x3B3;&#x3BA;&#x3CE;&#x3B4;&#x3B7; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE;. &#x3A6;&#x3B9;&#x3BD;&#x3B9;&#x3C1;&#x3B9;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3B1; &#x3BC;&#x3B5; &#x3B5;&#x3BB;&#x3BA;&#x3C5;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC; soft-touch &#x3C7;&#x3C1;&#x3CE;&#x3BC;&#x3B1;, &#x3B1;&#x3C5;&#x3C4;&#x3AC; &#x3C4;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3C5;&#x3C4;&#x3B9;&#x3BA;&#x3AC; Shells &#x3B1;&#x3C0;&#x3BF;&#x3C4;&#x3B5;&#x3BB;&#x3BF;&#x3CD;&#x3BD; &#x3B5;&#x3C5;&#x3C7;&#x3B1;&#x3C1;&#x3AF;&#x3C3;&#x3C4;&#x3B7;&#x3C3;&#x3B7; &#x3BD;&#x3B1; &#x3C4;&#x3B1; &#x3B1;&#x3B3;&#x3B3;&#x3AF;&#x3B6;&#x3B5;&#x3B9;&#x3C2;. &#x394;&#x3B9;&#x3B1;&#x3C4;&#x3AF;&#x3B8;&#x3B5;&#x3BD;&#x3C4;&#x3B1;&#x3B9; &#x3C3;&#x3B5; &#x3C4;&#x3C1;&#x3AF;&#x3B1; &#x3B4;&#x3B9;&#x3B1;&#x3C6;&#x3BF;&#x3C1;&#x3B5;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3B4;&#x3B9;&#x3B1;&#x3BA;&#x3C1;&#x3B9;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3C7;&#x3AD;&#x3B4;&#x3B9;&#x3B1;.</Description><Price>14.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/s/h/sh_top_06_2.jpg</Image></product><product><SKU>BL-SH-GL-BK</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Shells - Golf - Black</Name><Description>&#x3A3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3B1; &#x3BC;&#x3B5; &#x3C4;&#x3B7; &#x3BB;&#x3B5;&#x3B9;&#x3C4;&#x3BF;&#x3C5;&#x3C1;&#x3B3;&#x3AF;&#x3B1; &#x3C4;&#x3BF;&#x3C5; iPad &#x3BA;&#x3B1;&#x3C4;&#x3AC; &#x3BD;&#x3BF;&#x3C5;, &#x3C4;&#x3B1; Shells &#x3B4;&#x3B5;&#x3BD; &#x3BA;&#x3B1;&#x3BB;&#x3CD;&#x3C0;&#x3C4;&#x3BF;&#x3C5;&#x3BD;/&#xD;
&#x3BA;&#x3C1;&#x3CD;&#x3B2;&#x3BF;&#x3C5;&#x3BD; &#x3C0;&#x3BB;&#x3AE;&#x3BA;&#x3C4;&#x3C1;&#x3B1; &#x3AE; &#x3B2;&#x3B1;&#x3C3;&#x3B9;&#x3BA;&#x3AC; &#x3C7;&#x3B1;&#x3C1;&#x3B1;&#x3BA;&#x3C4;&#x3B7;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC;. &#x38C;&#x3BC;&#x3BF;&#x3C1;&#x3C6;&#x3B1; &amp; &#x3AD;&#x3BE;&#x3C5;&#x3C0;&#x3BD;&#x3B1;, &#x3AC;&#x3BE;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3CD;&#x3C3;&#x3BF;&#x3C5;&#x3BD; &#x3C4;&#x3BF; &#x3C0;&#x3BF;&#x3BB;&#x3CD;&#x3C4;&#x3B9;&#x3BC;&#x3BF; iPad &#x3C3;&#x3B1;&#x3C2;. &#x391;&#x3BD;&#x3B8;&#x3B5;&#x3BA;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3B4;&#x3C5;&#x3BD;&#x3B1;&#x3C4;&#x3AC;, &#x3B1;&#x3BB;&#x3BB;&#x3AC; &#x3B1;&#x3C1;&#x3BA;&#x3B5;&#x3C4;&#x3AC; &#x3B5;&#x3BB;&#x3B1;&#x3C6;&#x3C1;&#x3B9;&#x3AC;, &#x3CE;&#x3C3;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3B1;&#x3C0;&#x3BF;&#x3C6;&#x3CD;&#x3B3;&#x3BF;&#x3C5;&#x3BC;&#x3B5; &#x3BC;&#x3B9;&#x3B1; &#x3BF;&#x3B3;&#x3BA;&#x3CE;&#x3B4;&#x3B7; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE;. &#x3A6;&#x3B9;&#x3BD;&#x3B9;&#x3C1;&#x3B9;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3B1; &#x3BC;&#x3B5; &#x3B5;&#x3BB;&#x3BA;&#x3C5;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC; soft-touch &#x3C7;&#x3C1;&#x3CE;&#x3BC;&#x3B1;, &#x3B1;&#x3C5;&#x3C4;&#x3AC; &#x3C4;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3C5;&#x3C4;&#x3B9;&#x3BA;&#x3AC; Shells &#x3B1;&#x3C0;&#x3BF;&#x3C4;&#x3B5;&#x3BB;&#x3BF;&#x3CD;&#x3BD; &#x3B5;&#x3C5;&#x3C7;&#x3B1;&#x3C1;&#x3AF;&#x3C3;&#x3C4;&#x3B7;&#x3C3;&#x3B7; &#x3BD;&#x3B1; &#x3C4;&#x3B1; &#x3B1;&#x3B3;&#x3B3;&#x3AF;&#x3B6;&#x3B5;&#x3B9;&#x3C2;. &#x394;&#x3B9;&#x3B1;&#x3C4;&#x3AF;&#x3B8;&#x3B5;&#x3BD;&#x3C4;&#x3B1;&#x3B9; &#x3C3;&#x3B5; &#x3C4;&#x3C1;&#x3AF;&#x3B1; &#x3B4;&#x3B9;&#x3B1;&#x3C6;&#x3BF;&#x3C1;&#x3B5;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3B4;&#x3B9;&#x3B1;&#x3BA;&#x3C1;&#x3B9;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3C7;&#x3AD;&#x3B4;&#x3B9;&#x3B1;.</Description><Price>14.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/s/h/sh_top_05_3.jpg</Image></product><product><SKU>BL-CDM</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - CableDrop Mini</Name><Description>&#x397; &#x3B4;&#x3B9;&#x3B1;&#x3C7;&#x3B5;&#x3AF;&#x3C1;&#x3B9;&#x3C3;&#x3B7; &#x3BA;&#x3B1;&#x3BB;&#x3C9;&#x3B4;&#x3AF;&#x3C9;&#x3BD; &#x3BC;&#x3C0;&#x3BF;&#x3C1;&#x3B5;&#x3AF; &#x3C4;&#x3CE;&#x3C1;&#x3B1; &#x3BD;&#x3B1; &#x3B3;&#x3AF;&#x3BD;&#x3B5;&#x3B9; &#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3B4;&#x3B1;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AE; &#x3BA;&#x3B1;&#x3B9; &#x3B4;&#x3B7;&#x3BC;&#x3B9;&#x3BF;&#x3C5;&#x3C1;&#x3B3;&#x3B9;&#x3BA;&#x3AE; &#x3BC;&#x3B5; &#x3B1;&#x3C5;&#x3C4;&#x3AC; &#x3C4;&#x3B1; &#x3BA;&#x3BB;&#x3B9;&#x3C0; &#x3BA;&#x3B1;&#x3BB;&#x3C9;&#x3B4;&#x3AF;&#x3BF;&#x3C5;.&#xD;
&#x3A4;&#x3BF; &#x3BC;&#x3BF;&#x3BD;&#x3B1;&#x3B4;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; CableDrop Mini &#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B8;&#x3B5;&#x3C4;&#x3B5;&#x3AF;&#x3C4;&#x3B1;&#x3B9; &#x3C0;&#x3AC;&#x3BD;&#x3C9; &#x3AE; &#x3C0;&#x3AF;&#x3C3;&#x3C9;&#xD;
&#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3B7;&#x3BD; &#x3B5;&#x3C0;&#x3B9;&#x3C6;&#x3AC;&#x3BD;&#x3B5;&#x3B9;&#x3B1; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3C3;&#x3AF;&#x3B1;&#x3C2;, &#x3B1;&#x3BA;&#x3CC;&#x3BC;&#x3B7; &#x3BA;&#x3B1;&#x3B9; &#x3C3;&#x3B5; &#x3AD;&#x3BD;&#x3B1;&#x3BD; &#x3B1;&#x3BD;&#x3C4;&#x3B9;&#x3BA;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3CC; &#x3C4;&#x3BF;&#x3AF;&#x3C7;&#x3BF;, &#x3BF;&#x3C0;&#x3BF;&#x3C5;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3B8;&#x3AD;&#x3BB;&#x3B5;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3AD;&#x3C7;&#x3B5;&#x3C4;&#x3B5; &#x3BB;&#x3B5;&#x3C0;&#x3C4;&#x3AC; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C9;&#x3C1;&#x3B9;&#x3BD;&#x3AC; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3B7;&#x3BC;&#x3AD;&#x3BD;&#x3B1; &#x3B1;&#x3BB;&#x3BB;&#x3AC; &#x3C0;&#x3BF;&#x3C5; &#x3BD;&#x3B1; &#x3BC;&#x3C0;&#x3BF;&#x3C1;&#x3BF;&#x3CD;&#x3BD; &#x3BD;&#x3B1; &#x3B5;&#x3C0;&#x3B5;&#x3BA;&#x3C4;&#x3B1;&#x3B8;&#x3BF;&#x3CD;&#x3BD; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B1;.&#xD;
&#x3A4;&#x3BF;  CableDrop Mini &#x3C0;&#x3B9;&#x3AC;&#x3BD;&#x3B5;&#x3B9; &#x3B1;&#x3C0;&#x3B1;&#x3BB;&#x3AC; &#x3C4;&#x3B1; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; &#x3C3;&#x3B1;&#x3C2;, &#x3AD;&#x3C4;&#x3C3;&#x3B9; &#x3CE;&#x3C3;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3BC;&#x3B7;&#x3BD; &#x3C0;&#x3AD;&#x3C6;&#x3C4;&#x3BF;&#x3C5;&#x3BD;&#xD;
&#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3BF; &#x3B3;&#x3C1;&#x3B1;&#x3C6;&#x3B5;&#x3AF;&#x3BF; &#x3C3;&#x3B1;&#x3C2; &#x3BA;&#x3AC;&#x3B8;&#x3B5; &#x3C6;&#x3BF;&#x3C1;&#x3AC; &#x3C0;&#x3BF;&#x3C5; &#x3B2;&#x3B3;&#x3AC;&#x3B6;&#x3B5;&#x3C4;&#x3B5; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3B7; &#x3C0;&#x3C1;&#x3AF;&#x3B6;&#x3B1; &#x3C4;&#x3BF;&#x3BD; &#x3C6;&#x3BF;&#x3C1;&#x3B7;&#x3C4;&#x3CC; &#x3C5;&#x3C0;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B9;&#x3C3;&#x3C4;&#x3AE; &#x3AE; &#x3C4;&#x3B7; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE; &#x3C3;&#x3B1;&#x3C2;.&#xD;
</Description><Price>12.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/c/d/cd_025.jpg</Image></product><product><SKU>BL-CDM-WH</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - CableDrop Mini - White</Name><Description>&#x3A4;&#x3BF; CableDrop &#x3C0;&#x3B9;&#x3AC;&#x3BD;&#x3B5;&#x3B9; &#x3B1;&#x3C0;&#x3B1;&#x3BB;&#x3AC; &#x3C4;&#x3B1; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; &#x3C3;&#x3B1;&#x3C2;, &#x3AD;&#x3C4;&#x3C3;&#x3B9; &#x3CE;&#x3C3;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3BC;&#x3B7;&#x3BD; &#x3C0;&#x3AD;&#x3C6;&#x3C4;&#x3BF;&#x3C5;&#x3BD; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3BF; &#x3B3;&#x3C1;&#x3B1;&#x3C6;&#x3B5;&#x3AF;&#x3BF; &#x3C3;&#x3B1;&#x3C2; &#x3BA;&#x3AC;&#x3B8;&#x3B5; &#x3C6;&#x3BF;&#x3C1;&#x3AC; &#x3C0;&#x3BF;&#x3C5; &#x3B2;&#x3B3;&#x3AC;&#x3B6;&#x3B5;&#x3C4;&#x3B5; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3B7; &#x3C0;&#x3C1;&#x3AF;&#x3B6;&#x3B1; &#x3C4;&#x3BF;&#x3BD; &#x3C6;&#x3BF;&#x3C1;&#x3B7;&#x3C4;&#x3CC; &#x3C5;&#x3C0;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B9;&#x3C3;&#x3C4;&#x3AE; &#x3AE; &#x3C4;&#x3B7; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE; &#x3C3;&#x3B1;&#x3C2;.</Description><Price>12.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/c/d/cd_027.jpg</Image></product><product><SKU>BL-CDM-BK</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - CableDrop Mini - Black</Name><Description>&#x3A4;&#x3BF; &#x3BC;&#x3BF;&#x3BD;&#x3B1;&#x3B4;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; CableDrop &#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B8;&#x3B5;&#x3C4;&#x3B5;&#x3AF;&#x3C4;&#x3B1;&#x3B9; &#x3C0;&#x3AC;&#x3BD;&#x3C9; &#x3AE; &#x3C0;&#x3AF;&#x3C3;&#x3C9; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3B7;&#x3BD; &#x3B5;&#x3C0;&#x3B9;&#x3C6;&#x3AC;&#x3BD;&#x3B5;&#x3B9;&#x3B1; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3C3;&#x3AF;&#x3B1;&#x3C2;, &#x3B1;&#x3BA;&#x3CC;&#x3BC;&#x3B7; &#x3BA;&#x3B1;&#x3B9; &#x3C3;&#x3B5; &#x3AD;&#x3BD;&#x3B1;&#x3BD; &#x3B1;&#x3BD;&#x3C4;&#x3B9;&#x3BA;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3CC; &#x3C4;&#x3BF;&#x3AF;&#x3C7;&#x3BF;, &#x3BF;&#x3C0;&#x3BF;&#x3C5;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3B8;&#x3AD;&#x3BB;&#x3B5;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3AD;&#x3C7;&#x3B5;&#x3C4;&#x3B5; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C9;&#x3C1;&#x3B9;&#x3BD;&#x3AC; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3B7;&#x3BC;&#x3AD;&#x3BD;&#x3B1; &#x3B1;&#x3BB;&#x3BB;&#x3AC; &#x3C0;&#x3BF;&#x3C5; &#x3BD;&#x3B1; &#x3BC;&#x3C0;&#x3BF;&#x3C1;&#x3BF;&#x3CD;&#x3BD; &#x3BD;&#x3B1; &#x3B5;&#x3C0;&#x3B5;&#x3BA;&#x3C4;&#x3B1;&#x3B8;&#x3BF;&#x3CD;&#x3BD; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B1;. &#x3A4;&#x3BF; CableDrop &#x3C0;&#x3B9;&#x3AC;&#x3BD;&#x3B5;&#x3B9; &#x3B1;&#x3C0;&#x3B1;&#x3BB;&#x3AC; &#x3C4;&#x3B1; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3B1; &#x3C3;&#x3B1;&#x3C2;, &#x3AD;&#x3C4;&#x3C3;&#x3B9; &#x3CE;&#x3C3;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3BC;&#x3B7;&#x3BD; &#x3C0;&#x3AD;&#x3C6;&#x3C4;&#x3BF;&#x3C5;&#x3BD; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3BF; &#x3B3;&#x3C1;&#x3B1;&#x3C6;&#x3B5;&#x3AF;&#x3BF; &#x3C3;&#x3B1;&#x3C2; &#x3BA;&#x3AC;&#x3B8;&#x3B5; &#x3C6;&#x3BF;&#x3C1;&#x3AC; &#x3C0;&#x3BF;&#x3C5; &#x3B2;&#x3B3;&#x3AC;&#x3B6;&#x3B5;&#x3C4;&#x3B5; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3B7; &#x3C0;&#x3C1;&#x3AF;&#x3B6;&#x3B1; &#x3C4;&#x3BF;&#x3BD; &#x3C6;&#x3BF;&#x3C1;&#x3B7;&#x3C4;&#x3CC; &#x3C5;&#x3C0;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B9;&#x3C3;&#x3C4;&#x3AE; &#x3AE; &#x3C4;&#x3B7; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE; &#x3C3;&#x3B1;&#x3C2;. </Description><Price>12.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/c/d/cd_026.jpg</Image></product><product><SKU>BL-US-IB</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge Bags - iPad Sling</Name><Description>&#x3A4;&#x3BF; iPad Sling &#x3AD;&#x3C7;&#x3B5;&#x3B9; &#x3AD;&#x3BD;&#x3B1;&#x3BD; &#x3BA;&#x3C5;&#x3C1;&#x3AF;&#x3C9;&#x3C2; &#x3C7;&#x3CE;&#x3C1;&#x3BF;, &#x3B5;&#x3B9;&#x3B4;&#x3B9;&#x3BA;&#x3AC; &#x3B4;&#x3B9;&#x3B1;&#x3BC;&#x3BF;&#x3C1;&#x3C6;&#x3C9;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3BC;&#x3B5; &#x3BC;&#x3B1;&#x3BE;&#x3B9;&#x3BB;&#x3AC;&#x3C1;&#x3B9; &#x3B1;&#x3C3;&#x3C6;&#x3B1;&#x3BB;&#x3B5;&#x3AF;&#x3B1;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3BF; iPad &#x3AE; &#x3C4;&#x3BF; e-book &#x3C3;&#x3B1;&#x3C2;, &#x3B1;&#x3BB;&#x3BB;&#x3AC; &#x3C0;&#x3B1;&#x3C1;&#x3AC;&#x3BB;&#x3BB;&#x3B7;&#x3BB;&#x3B1; &#x3B4;&#x3B9;&#x3B1;&#x3B8;&#x3AD;&#x3C4;&#x3B5;&#x3B9; &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3B2;&#x3AC;&#x3C3;&#x3B9;&#x3BC;&#x3B5;&#x3C2; &#x3C4;&#x3C3;&#x3AD;&#x3C0;&#x3B5;&#x3C2; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3BC;&#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B9;&#x3BD;&#x3AE; &#x3C4;&#x3BF;&#x3C5; &#x3CC;&#x3C8;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B1; &#x3B1;&#x3C0;&#x3B1;&#x3C1;&#x3B1;&#x3AF;&#x3C4;&#x3B7;&#x3C4;&#x3B1; &#x3B1;&#x3BE;&#x3B5;&#x3C3;&#x3BF;&#x3C5;&#x3AC;&#x3C1; &#x3C3;&#x3B1;&#x3C2;. &#x3A4;&#x3BF; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3B1;&#x3C1;&#x3BC;&#x3CC;&#x3C3;&#x3B9;&#x3BC;&#x3BF; &#x3B4;&#x3AD;&#x3C3;&#x3B9;&#x3BC;&#x3CC; &#x3C4;&#x3BF;&#x3C5; &#x3BA;&#x3AC;&#x3BD;&#x3B5;&#x3B9; &#x3C4;&#x3BF; iPad Sling &#x201C;&#x3B5;&#x3C5;&#x3BA;&#x3BF;&#x3BB;&#x3BF;&#x3C6;&#x3CC;&#x3C1;&#x3B5;&#x3C4;&#x3BF;&#x201D; &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3BE;&#x3B1;&#x3C3;&#x3C6;&#x3B1;&#x3BB;&#x3AF;&#x3B6;&#x3B5;&#x3B9; &#x3CC;&#x3C4;&#x3B9; &#x3C4;&#x3B1; &#x3B1;&#x3B3;&#x3B1;&#x3C0;&#x3B7;&#x3BC;&#x3AD;&#x3BD;&#x3B1; &#x3C3;&#x3B1;&#x3C2; &#x3B1;&#x3BD;&#x3C4;&#x3B9;&#x3BA;&#x3B5;&#x3AF;&#x3BC;&#x3B5;&#x3BD;&#x3B1; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C0;&#x3AC;&#x3BD;&#x3C4;&#x3B1; &#x3BA;&#x3BF;&#x3BD;&#x3C4;&#x3AC; &#x3C3;&#x3B1;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3C3;&#x3B5; &#x3AC;&#x3BC;&#x3B5;&#x3C3;&#x3B7; &#x3C0;&#x3C1;&#x3CC;&#x3C3;&#x3B2;&#x3B1;&#x3C3;&#x3B7;.&#xD;
</Description><Price>69</Price><Image>http://www.gricgroup.gr/media/catalog/product/u/s/us_100.jpg</Image></product><product><SKU>BL-US-IB-BK</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge Bags - iPad Sling - Black</Name><Description>&#x3A4;&#x3BF; iPad Sling &#x3AD;&#x3C7;&#x3B5;&#x3B9; &#x3AD;&#x3BD;&#x3B1;&#x3BD; &#x3BA;&#x3C5;&#x3C1;&#x3AF;&#x3C9;&#x3C2; &#x3C7;&#x3CE;&#x3C1;&#x3BF;, &#x3B5;&#x3B9;&#x3B4;&#x3B9;&#x3BA;&#x3AC; &#x3B4;&#x3B9;&#x3B1;&#x3BC;&#x3BF;&#x3C1;&#x3C6;&#x3C9;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3BC;&#x3B5;&#xD;
&#x3BC;&#x3B1;&#x3BE;&#x3B9;&#x3BB;&#x3AC;&#x3C1;&#x3B9; &#x3B1;&#x3C3;&#x3C6;&#x3B1;&#x3BB;&#x3B5;&#x3AF;&#x3B1;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3BF; iPad &#x3AE; &#x3C4;&#x3BF; e-book &#x3C3;&#x3B1;&#x3C2;, &#x3B1;&#x3BB;&#x3BB;&#x3AC; &#x3C0;&#x3B1;&#x3C1;&#x3AC;&#x3BB;&#x3BB;&#x3B7;&#x3BB;&#x3B1;&#xD;
&#x3B4;&#x3B9;&#x3B1;&#x3B8;&#x3AD;&#x3C4;&#x3B5;&#x3B9; &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3B2;&#x3AC;&#x3C3;&#x3B9;&#x3BC;&#x3B5;&#x3C2; &#x3C4;&#x3C3;&#x3AD;&#x3C0;&#x3B5;&#x3C2; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3BC;&#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B9;&#x3BD;&#x3AE; &#x3C4;&#x3BF;&#x3C5; &#x3CC;&#x3C8;&#x3B7;&#xD;
&#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B1; &#x3B1;&#x3C0;&#x3B1;&#x3C1;&#x3B1;&#x3AF;&#x3C4;&#x3B7;&#x3C4;&#x3B1; &#x3B1;&#x3BE;&#x3B5;&#x3C3;&#x3BF;&#x3C5;&#x3AC;&#x3C1; &#x3C3;&#x3B1;&#x3C2;.&#xD;
&#x3A4;&#x3BF; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3B1;&#x3C1;&#x3BC;&#x3CC;&#x3C3;&#x3B9;&#x3BC;&#x3BF; &#x3B4;&#x3AD;&#x3C3;&#x3B9;&#x3BC;&#x3CC; &#x3C4;&#x3BF;&#x3C5; &#x3BA;&#x3AC;&#x3BD;&#x3B5;&#x3B9; &#x3C4;&#x3BF; iPad Sling&#xD;
&#x201C;&#x3B5;&#x3C5;&#x3BA;&#x3BF;&#x3BB;&#x3BF;&#x3C6;&#x3CC;&#x3C1;&#x3B5;&#x3C4;&#x3BF;&#x201D; &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3BE;&#x3B1;&#x3C3;&#x3C6;&#x3B1;&#x3BB;&#x3AF;&#x3B6;&#x3B5;&#x3B9; &#x3CC;&#x3C4;&#x3B9; &#x3C4;&#x3B1; &#x3B1;&#x3B3;&#x3B1;&#x3C0;&#x3B7;&#x3BC;&#x3AD;&#x3BD;&#x3B1; &#x3C3;&#x3B1;&#x3C2; &#x3B1;&#x3BD;&#x3C4;&#x3B9;&#x3BA;&#x3B5;&#x3AF;&#x3BC;&#x3B5;&#x3BD;&#x3B1; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C0;&#x3AC;&#x3BD;&#x3C4;&#x3B1; &#x3BA;&#x3BF;&#x3BD;&#x3C4;&#x3AC; &#x3C3;&#x3B1;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3C3;&#x3B5; &#x3AC;&#x3BC;&#x3B5;&#x3C3;&#x3B7; &#x3C0;&#x3C1;&#x3CC;&#x3C3;&#x3B2;&#x3B1;&#x3C3;&#x3B7;.</Description><Price>69</Price><Image>http://www.gricgroup.gr/media/catalog/product/u/s/us_ipadsling_top01.jpg</Image></product><product><SKU>BL-US-IB-RU</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge Bags - iPad Sling - Rust</Name><Description>&#x3A4;&#x3BF; iPad Sling &#x3AD;&#x3C7;&#x3B5;&#x3B9; &#x3AD;&#x3BD;&#x3B1;&#x3BD; &#x3BA;&#x3C5;&#x3C1;&#x3AF;&#x3C9;&#x3C2; &#x3C7;&#x3CE;&#x3C1;&#x3BF;, &#x3B5;&#x3B9;&#x3B4;&#x3B9;&#x3BA;&#x3AC; &#x3B4;&#x3B9;&#x3B1;&#x3BC;&#x3BF;&#x3C1;&#x3C6;&#x3C9;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3BC;&#x3B5; &#x3BC;&#x3B1;&#x3BE;&#x3B9;&#x3BB;&#x3AC;&#x3C1;&#x3B9; &#x3B1;&#x3C3;&#x3C6;&#x3B1;&#x3BB;&#x3B5;&#x3AF;&#x3B1;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3BF; iPad &#x3AE; &#x3C4;&#x3BF; e-book &#x3C3;&#x3B1;&#x3C2;, &#x3B1;&#x3BB;&#x3BB;&#x3AC; &#x3C0;&#x3B1;&#x3C1;&#x3AC;&#x3BB;&#x3BB;&#x3B7;&#x3BB;&#x3B1;&#xD;
&#x3B4;&#x3B9;&#x3B1;&#x3B8;&#x3AD;&#x3C4;&#x3B5;&#x3B9; &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3B2;&#x3AC;&#x3C3;&#x3B9;&#x3BC;&#x3B5;&#x3C2; &#x3C4;&#x3C3;&#x3AD;&#x3C0;&#x3B5;&#x3C2; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3BC;&#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B9;&#x3BD;&#x3AE; &#x3C4;&#x3BF;&#x3C5; &#x3CC;&#x3C8;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B1; &#x3B1;&#x3C0;&#x3B1;&#x3C1;&#x3B1;&#x3AF;&#x3C4;&#x3B7;&#x3C4;&#x3B1; &#x3B1;&#x3BE;&#x3B5;&#x3C3;&#x3BF;&#x3C5;&#x3AC;&#x3C1; &#x3C3;&#x3B1;&#x3C2;. &#x3A4;&#x3BF; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3B1;&#x3C1;&#x3BC;&#x3CC;&#x3C3;&#x3B9;&#x3BC;&#x3BF; &#x3B4;&#x3AD;&#x3C3;&#x3B9;&#x3BC;&#x3CC; &#x3C4;&#x3BF;&#x3C5; &#x3BA;&#x3AC;&#x3BD;&#x3B5;&#x3B9; &#x3C4;&#x3BF; iPad Sling &#x201C;&#x3B5;&#x3C5;&#x3BA;&#x3BF;&#x3BB;&#x3BF;&#x3C6;&#x3CC;&#x3C1;&#x3B5;&#x3C4;&#x3BF;&#x201D; &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3BE;&#x3B1;&#x3C3;&#x3C6;&#x3B1;&#x3BB;&#x3AF;&#x3B6;&#x3B5;&#x3B9; &#x3CC;&#x3C4;&#x3B9; &#x3C4;&#x3B1; &#x3B1;&#x3B3;&#x3B1;&#x3C0;&#x3B7;&#x3BC;&#x3AD;&#x3BD;&#x3B1; &#x3C3;&#x3B1;&#x3C2; &#x3B1;&#x3BD;&#x3C4;&#x3B9;&#x3BA;&#x3B5;&#x3AF;&#x3BC;&#x3B5;&#x3BD;&#x3B1; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C0;&#x3AC;&#x3BD;&#x3C4;&#x3B1; &#x3BA;&#x3BF;&#x3BD;&#x3C4;&#x3AC; &#x3C3;&#x3B1;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3C3;&#x3B5; &#x3AC;&#x3BC;&#x3B5;&#x3C3;&#x3B7; &#x3C0;&#x3C1;&#x3CC;&#x3C3;&#x3B2;&#x3B1;&#x3C3;&#x3B7;.</Description><Price>69</Price><Image>http://www.gricgroup.gr/media/catalog/product/u/s/us_ipadsling_top04.jpg</Image></product><product><SKU>BL-US-BP</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge Bags - Backpack</Name><Description>&#x393;&#x3B9;&#x3B1; &#x3B5;&#x3C3;&#x3AC;&#x3C2; &#x3C0;&#x3BF;&#x3C5; &#x3C3;&#x3B1;&#x3C2; &#x3B1;&#x3C1;&#x3AD;&#x3C3;&#x3B5;&#x3B9; &#x3BD;&#x3B1; &#x3BA;&#x3B9;&#x3BD;&#x3B5;&#x3AF;&#x3C3;&#x3C4;&#x3B5; &#x3BC;&#x3B5; &#x3C3;&#x3C4;&#x3C5;&#x3BB;. &#x3A4;&#x3C5;&#x3BB;&#x3AF;&#x3BE;&#x3C4;&#x3B5; &#x3AE; &#x3B4;&#x3B9;&#x3C0;&#x3BB;&#x3CE;&#x3C3;&#x3C4;&#x3B5; &#x3C4;&#x3BF; &#x3C0;&#x3AC;&#x3BD;&#x3C9; &#x3BC;&#x3AD;&#x3C1;&#x3BF;&#x3C2; &#x3C4;&#x3B7;&#x3C2; &#x3C4;&#x3C3;&#x3AC;&#x3BD;&#x3C4;&#x3B1;&#x3C2; &#x3B1;&#x3BD;&#x3AC;&#x3BB;&#x3BF;&#x3B3;&#x3B1; &#x3BC;&#x3B5; &#x3C4;&#x3B7;&#x3BD; &#x3B4;&#x3B9;&#x3AC;&#x3B8;&#x3B5;&#x3C3;&#x3AE; &#x3C3;&#x3B1;&#x3C2;. &#x39F;&#x3B9; &#x3B5;&#x3C1;&#x3B3;&#x3BF;&#x3BD;&#x3BF;&#x3BC;&#x3B9;&#x3BA;&#x3AD;&#x3C2; &#x3BB;&#x3B1;&#x3B2;&#x3AD;&#x3C2; &#x3C4;&#x3BF;&#x3C5; Backpack &#x3B1;&#x3B3;&#x3BA;&#x3B1;&#x3BB;&#x3B9;&#x3AC;&#x3B6;&#x3BF;&#x3C5;&#x3BD; &#x3C4;&#x3BF;&#x3BD; &#x3BB;&#x3B1;&#x3B9;&#x3BC;&#x3CC; &#x3C3;&#x3B1;&#x3C2;, &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3BD; &#x3B1;&#x3C0;&#x3CC;&#x3BB;&#x3C5;&#x3C4;&#x3B7; &#x3B1;&#x3AF;&#x3C3;&#x3B8;&#x3B7;&#x3C3;&#x3B7; &#x3B5;&#x3C6;&#x3B1;&#x3C1;&#x3BC;&#x3BF;&#x3B3;&#x3AE;&#x3C2; &#x3C3;&#x3C4;&#x3BF; &#x3C3;&#x3CE;&#x3BC;&#x3B1; &#x3C3;&#x3B1;&#x3C2;. &#x394;&#x3B9;&#x3B1;&#x3BA;&#x3BF;&#x3C3;&#x3BC;&#x3B7;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3BC;&#x3B5; &#x3B1;&#x3B3;&#x3BA;&#x3C1;&#x3AC;&#x3C6;&#x3B5;&#x3C2; &#x3B1;&#x3C0;&#x3CC; &#x3B1;&#x3BB;&#x3BF;&#x3C5;&#x3BC;&#x3AF;&#x3BD;&#x3B9;&#x3BF; &#x3BA;&#x3B1;&#x3B9; &#x3BA;&#x3BF;&#x3C5;&#x3BC;&#x3C0;&#x3CE;&#x3BC;&#x3B1;&#x3C4;&#x3B1; &#x3BC;&#x3B5; &#x3C4;&#x3BF; &#x3C3;&#x3CD;&#x3C3;&#x3C4;&#x3B7;&#x3BC;&#x3B1; &#x3B3;&#x3C1;&#x3AE;&#x3B3;&#x3BF;&#x3C1;&#x3BF;&#x3C5; &#x3B1;&#x3BD;&#x3BF;&#x3AF;&#x3B3;&#x3BC;&#x3B1;&#x3C4;&#x3BF;&#x3C2;, &#x3C3;&#x3B1;&#x3C2; &#x3B4;&#x3AF;&#x3BD;&#x3B5;&#x3B9; &#x3C4;&#x3B7;&#x3BD; &#x3B1;&#x3AF;&#x3C3;&#x3B8;&#x3B7;&#x3C3;&#x3B7; &#x3CC;&#x3C4;&#x3B9; &#x3AD;&#x3C7;&#x3B5;&#x3B9; &#x3C6;&#x3C4;&#x3B9;&#x3B1;&#x3C7;&#x3C4;&#x3B5;&#x3AF; &#x3B5;&#x3B9;&#x3B4;&#x3B9;&#x3BA;&#x3AC; &#x3B3;&#x3B9;&#x3B1; &#x3B5;&#x3C3;&#x3AC;&#x3C2;! &#x3A4;&#x3BF; Backpack &#x3AD;&#x3C7;&#x3B5;&#x3B9; &#x3CC;&#x3BB;&#x3B1; &#x3C4;&#x3B1; &#x3C7;&#x3B1;&#x3C1;&#x3B1;&#x3BA;&#x3C4;&#x3B7;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3B9;&#x3C2; &#x3B5;&#x3C5;&#x3BA;&#x3BF;&#x3BB;&#x3AF;&#x3B5;&#x3C2; &#x3C0;&#x3C1;&#x3BF;&#x3BA;&#x3B5;&#x3B9;&#x3BC;&#x3AD;&#x3BD;&#x3BF;&#x3C5; &#x3BD;&#x3B1; &#x3BA;&#x3BF;&#x3C5;&#x3B2;&#x3B1;&#x3BB;&#x3AC;&#x3C4;&#x3B5; &#x3C0;&#x3AC;&#x3BD;&#x3C4;&#x3B1; &#x3BC;&#x3B1;&#x3B6;&#x3AF; &#x3C3;&#x3B1;&#x3C2; &#x3CC;&#x3BB;&#x3B5;&#x3C2; &#x3C3;&#x3B1;&#x3C2; &#x3C4;&#x3B9;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2;.&#xD;
&#x3A4;&#x3BF; &#x3B5;&#x3B9;&#x3B4;&#x3B9;&#x3BA;&#x3AC; &#x3BA;&#x3B1;&#x3C4;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x201C;&#x3BC;&#x3B1;&#x3BE;&#x3B9;&#x3BB;&#x3B1;&#x3C1;&#x3AC;&#x3BA;&#x3B9;&#x201D; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C3;&#x3AF;&#x3B1; &#x3C4;&#x3BF;&#x3C5; laptop &#x3C3;&#x3B1;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3B7; &#x3B5;&#x3BE;&#x3B5;&#x3B9;&#x3B4;&#x3B9;&#x3BA;&#x3B5;&#x3C5;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3B8;&#x3AE;&#x3BA;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3BF; iPad, &#x3C3;&#x3B1;&#x3C2; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C6;&#x3AD;&#x3C1;&#x3BF;&#x3C5;&#x3BD; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C3;&#x3AF;&#x3B1; &#x3BA;&#x3B1;&#x3B9; &#x3C0;&#x3BF;&#x3BB;&#x3C5;&#x3C7;&#x3C1;&#x3B7;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC;&#x3C4;&#x3B7;&#x3C4;&#x3B1; &#x3C0;&#x3BF;&#x3C5; &#x3B6;&#x3B7;&#x3C4;&#x3BF;&#x3CD;&#x3C3;&#x3B1;&#x3C4;&#x3B5;.&#xD;
</Description><Price>159</Price><Image>http://www.gricgroup.gr/media/catalog/product/u/s/us_backpack_top05b.jpg</Image></product><product><SKU>BL-US-BP-BK</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge Bags - Backpack - Black</Name><Description>  &#x393;&#x3B9;&#x3B1; &#x3B5;&#x3C3;&#x3AC;&#x3C2; &#x3C0;&#x3BF;&#x3C5; &#x3C3;&#x3B1;&#x3C2; &#x3B1;&#x3C1;&#x3AD;&#x3C3;&#x3B5;&#x3B9; &#x3BD;&#x3B1; &#x3BA;&#x3B9;&#x3BD;&#x3B5;&#x3AF;&#x3C3;&#x3C4;&#x3B5; &#x3BC;&#x3B5; &#x3C3;&#x3C4;&#x3C5;&#x3BB;. &#x3A4;&#x3C5;&#x3BB;&#x3AF;&#x3BE;&#x3C4;&#x3B5; &#x3AE; &#x3B4;&#x3B9;&#x3C0;&#x3BB;&#x3CE;&#x3C3;&#x3C4;&#x3B5; &#x3C4;&#x3BF; &#x3C0;&#x3AC;&#x3BD;&#x3C9; &#x3BC;&#x3AD;&#x3C1;&#x3BF;&#x3C2; &#x3C4;&#x3B7;&#x3C2; &#x3C4;&#x3C3;&#x3AC;&#x3BD;&#x3C4;&#x3B1;&#x3C2; &#x3B1;&#x3BD;&#x3AC;&#x3BB;&#x3BF;&#x3B3;&#x3B1; &#x3BC;&#x3B5; &#x3C4;&#x3B7;&#x3BD; &#x3B4;&#x3B9;&#x3AC;&#x3B8;&#x3B5;&#x3C3;&#x3AE; &#x3C3;&#x3B1;&#x3C2;. &#x39F;&#x3B9; &#x3B5;&#x3C1;&#x3B3;&#x3BF;&#x3BD;&#x3BF;&#x3BC;&#x3B9;&#x3BA;&#x3AD;&#x3C2; &#x3BB;&#x3B1;&#x3B2;&#x3AD;&#x3C2; &#x3C4;&#x3BF;&#x3C5; Backpack &#x3B1;&#x3B3;&#x3BA;&#x3B1;&#x3BB;&#x3B9;&#x3AC;&#x3B6;&#x3BF;&#x3C5;&#x3BD; &#x3C4;&#x3BF;&#x3BD; &#x3BB;&#x3B1;&#x3B9;&#x3BC;&#x3CC; &#x3C3;&#x3B1;&#x3C2;, &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3BD; &#x3B1;&#x3C0;&#x3CC;&#x3BB;&#x3C5;&#x3C4;&#x3B7; &#x3B1;&#x3AF;&#x3C3;&#x3B8;&#x3B7;&#x3C3;&#x3B7; &#x3B5;&#x3C6;&#x3B1;&#x3C1;&#x3BC;&#x3BF;&#x3B3;&#x3AE;&#x3C2; &#x3C3;&#x3C4;&#x3BF; &#x3C3;&#x3CE;&#x3BC;&#x3B1; &#x3C3;&#x3B1;&#x3C2;. &#x394;&#x3B9;&#x3B1;&#x3BA;&#x3BF;&#x3C3;&#x3BC;&#x3B7;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3BC;&#x3B5; &#x3B1;&#x3B3;&#x3BA;&#x3C1;&#x3AC;&#x3C6;&#x3B5;&#x3C2; &#x3B1;&#x3C0;&#x3CC; &#x3B1;&#x3BB;&#x3BF;&#x3C5;&#x3BC;&#x3AF;&#x3BD;&#x3B9;&#x3BF; &#x3BA;&#x3B1;&#x3B9; &#x3BA;&#x3BF;&#x3C5;&#x3BC;&#x3C0;&#x3CE;&#x3BC;&#x3B1;&#x3C4;&#x3B1; &#x3BC;&#x3B5; &#x3C4;&#x3BF; &#x3C3;&#x3CD;&#x3C3;&#x3C4;&#x3B7;&#x3BC;&#x3B1; &#x3B3;&#x3C1;&#x3AE;&#x3B3;&#x3BF;&#x3C1;&#x3BF;&#x3C5; &#x3B1;&#x3BD;&#x3BF;&#x3AF;&#x3B3;&#x3BC;&#x3B1;&#x3C4;&#x3BF;&#x3C2;, &#x3C3;&#x3B1;&#x3C2; &#x3B4;&#x3AF;&#x3BD;&#x3B5;&#x3B9; &#x3C4;&#x3B7;&#x3BD; &#x3B1;&#x3AF;&#x3C3;&#x3B8;&#x3B7;&#x3C3;&#x3B7; &#x3CC;&#x3C4;&#x3B9; &#x3AD;&#x3C7;&#x3B5;&#x3B9; &#x3C6;&#x3C4;&#x3B9;&#x3B1;&#x3C7;&#x3C4;&#x3B5;&#x3AF; &#x3B5;&#x3B9;&#x3B4;&#x3B9;&#x3BA;&#x3AC; &#x3B3;&#x3B9;&#x3B1; &#x3B5;&#x3C3;&#x3AC;&#x3C2;! &#x3A4;&#x3BF; Backpack &#x3AD;&#x3C7;&#x3B5;&#x3B9; &#x3CC;&#x3BB;&#x3B1; &#x3C4;&#x3B1; &#x3C7;&#x3B1;&#x3C1;&#x3B1;&#x3BA;&#x3C4;&#x3B7;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3B9;&#x3C2; &#x3B5;&#x3C5;&#x3BA;&#x3BF;&#x3BB;&#x3AF;&#x3B5;&#x3C2;&#xD;
&#x3C0;&#x3C1;&#x3BF;&#x3BA;&#x3B5;&#x3B9;&#x3BC;&#x3AD;&#x3BD;&#x3BF;&#x3C5; &#x3BD;&#x3B1; &#x3BA;&#x3BF;&#x3C5;&#x3B2;&#x3B1;&#x3BB;&#x3AC;&#x3C4;&#x3B5; &#x3C0;&#x3AC;&#x3BD;&#x3C4;&#x3B1; &#x3BC;&#x3B1;&#x3B6;&#x3AF; &#x3C3;&#x3B1;&#x3C2; &#x3CC;&#x3BB;&#x3B5;&#x3C2; &#x3C3;&#x3B1;&#x3C2; &#x3C4;&#x3B9;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2;. &#x3A4;&#x3BF; &#x3B5;&#x3B9;&#x3B4;&#x3B9;&#x3BA;&#x3AC; &#x3BA;&#x3B1;&#x3C4;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x201C;&#x3BC;&#x3B1;&#x3BE;&#x3B9;&#x3BB;&#x3B1;&#x3C1;&#x3AC;&#x3BA;&#x3B9;&#x201D; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C3;&#x3AF;&#x3B1; &#x3C4;&#x3BF;&#x3C5; laptop &#x3C3;&#x3B1;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3B7; &#x3B5;&#x3BE;&#x3B5;&#x3B9;&#x3B4;&#x3B9;&#x3BA;&#x3B5;&#x3C5;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3B8;&#x3AE;&#x3BA;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3BF; iPad, &#x3C3;&#x3B1;&#x3C2; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C6;&#x3AD;&#x3C1;&#x3BF;&#x3C5;&#x3BD; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C3;&#x3AF;&#x3B1; &#x3BA;&#x3B1;&#x3B9; &#x3C0;&#x3BF;&#x3BB;&#x3C5;&#x3C7;&#x3C1;&#x3B7;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC;&#x3C4;&#x3B7;&#x3C4;&#x3B1; &#x3C0;&#x3BF;&#x3C5; &#x3B6;&#x3B7;&#x3C4;&#x3BF;&#x3CD;&#x3C3;&#x3B1;&#x3C4;&#x3B5;.</Description><Price>159</Price><Image>http://www.gricgroup.gr/media/catalog/product/u/s/us_backpack_top01_1.jpg</Image></product><product><SKU>BL-US-BP-GRY</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge Bags - Backpack - Grey</Name><Description>&#x393;&#x3B9;&#x3B1; &#x3B5;&#x3C3;&#x3AC;&#x3C2; &#x3C0;&#x3BF;&#x3C5; &#x3C3;&#x3B1;&#x3C2; &#x3B1;&#x3C1;&#x3AD;&#x3C3;&#x3B5;&#x3B9; &#x3BD;&#x3B1; &#x3BA;&#x3B9;&#x3BD;&#x3B5;&#x3AF;&#x3C3;&#x3C4;&#x3B5; &#x3BC;&#x3B5; &#x3C3;&#x3C4;&#x3C5;&#x3BB;. &#x3A4;&#x3C5;&#x3BB;&#x3AF;&#x3BE;&#x3C4;&#x3B5; &#x3AE; &#x3B4;&#x3B9;&#x3C0;&#x3BB;&#x3CE;&#x3C3;&#x3C4;&#x3B5; &#x3C4;&#x3BF; &#x3C0;&#x3AC;&#x3BD;&#x3C9; &#x3BC;&#x3AD;&#x3C1;&#x3BF;&#x3C2; &#x3C4;&#x3B7;&#x3C2; &#x3C4;&#x3C3;&#x3AC;&#x3BD;&#x3C4;&#x3B1;&#x3C2; &#x3B1;&#x3BD;&#x3AC;&#x3BB;&#x3BF;&#x3B3;&#x3B1; &#x3BC;&#x3B5; &#x3C4;&#x3B7;&#x3BD; &#x3B4;&#x3B9;&#x3AC;&#x3B8;&#x3B5;&#x3C3;&#x3AE; &#x3C3;&#x3B1;&#x3C2;. &#x39F;&#x3B9; &#x3B5;&#x3C1;&#x3B3;&#x3BF;&#x3BD;&#x3BF;&#x3BC;&#x3B9;&#x3BA;&#x3AD;&#x3C2; &#x3BB;&#x3B1;&#x3B2;&#x3AD;&#x3C2; &#x3C4;&#x3BF;&#x3C5; Backpack &#x3B1;&#x3B3;&#x3BA;&#x3B1;&#x3BB;&#x3B9;&#x3AC;&#x3B6;&#x3BF;&#x3C5;&#x3BD; &#x3C4;&#x3BF;&#x3BD; &#x3BB;&#x3B1;&#x3B9;&#x3BC;&#x3CC; &#x3C3;&#x3B1;&#x3C2;, &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3BD; &#x3B1;&#x3C0;&#x3CC;&#x3BB;&#x3C5;&#x3C4;&#x3B7; &#x3B1;&#x3AF;&#x3C3;&#x3B8;&#x3B7;&#x3C3;&#x3B7; &#x3B5;&#x3C6;&#x3B1;&#x3C1;&#x3BC;&#x3BF;&#x3B3;&#x3AE;&#x3C2; &#x3C3;&#x3C4;&#x3BF; &#x3C3;&#x3CE;&#x3BC;&#x3B1; &#x3C3;&#x3B1;&#x3C2;. &#x394;&#x3B9;&#x3B1;&#x3BA;&#x3BF;&#x3C3;&#x3BC;&#x3B7;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3BC;&#x3B5; &#x3B1;&#x3B3;&#x3BA;&#x3C1;&#x3AC;&#x3C6;&#x3B5;&#x3C2; &#x3B1;&#x3C0;&#x3CC; &#x3B1;&#x3BB;&#x3BF;&#x3C5;&#x3BC;&#x3AF;&#x3BD;&#x3B9;&#x3BF; &#x3BA;&#x3B1;&#x3B9; &#x3BF;&#x3C5;&#x3BC;&#x3C0;&#x3CE;&#x3BC;&#x3B1;&#x3C4;&#x3B1;&#xD;
&#x3BC;&#x3B5; &#x3C4;&#x3BF; &#x3C3;&#x3CD;&#x3C3;&#x3C4;&#x3B7;&#x3BC;&#x3B1; &#x3B3;&#x3C1;&#x3AE;&#x3B3;&#x3BF;&#x3C1;&#x3BF;&#x3C5; &#x3B1;&#x3BD;&#x3BF;&#x3AF;&#x3B3;&#x3BC;&#x3B1;&#x3C4;&#x3BF;&#x3C2;, &#x3C3;&#x3B1;&#x3C2; &#x3B4;&#x3AF;&#x3BD;&#x3B5;&#x3B9; &#x3C4;&#x3B7;&#x3BD; &#x3B1;&#x3AF;&#x3C3;&#x3B8;&#x3B7;&#x3C3;&#x3B7; &#x3CC;&#x3C4;&#x3B9; &#x3AD;&#x3C7;&#x3B5;&#x3B9; &#x3C6;&#x3C4;&#x3B9;&#x3B1;&#x3C7;&#x3C4;&#x3B5;&#x3AF; &#x3B5;&#x3B9;&#x3B4;&#x3B9;&#x3BA;&#x3AC; &#x3B3;&#x3B9;&#x3B1; &#x3B5;&#x3C3;&#x3AC;&#x3C2;! &#x3A4;&#x3BF; Backpack &#x3AD;&#x3C7;&#x3B5;&#x3B9; &#x3CC;&#x3BB;&#x3B1; &#x3C4;&#x3B1; &#x3C7;&#x3B1;&#x3C1;&#x3B1;&#x3BA;&#x3C4;&#x3B7;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3B9;&#x3C2; &#x3B5;&#x3C5;&#x3BA;&#x3BF;&#x3BB;&#x3AF;&#x3B5;&#x3C2;&#xD;
&#x3C0;&#x3C1;&#x3BF;&#x3BA;&#x3B5;&#x3B9;&#x3BC;&#x3AD;&#x3BD;&#x3BF;&#x3C5; &#x3BD;&#x3B1; &#x3BA;&#x3BF;&#x3C5;&#x3B2;&#x3B1;&#x3BB;&#x3AC;&#x3C4;&#x3B5; &#x3C0;&#x3AC;&#x3BD;&#x3C4;&#x3B1; &#x3BC;&#x3B1;&#x3B6;&#x3AF; &#x3C3;&#x3B1;&#x3C2; &#x3CC;&#x3BB;&#x3B5;&#x3C2; &#x3C3;&#x3B1;&#x3C2; &#x3C4;&#x3B9;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2;. &#x3A4;&#x3BF; &#x3B5;&#x3B9;&#x3B4;&#x3B9;&#x3BA;&#x3AC; &#x3BA;&#x3B1;&#x3C4;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x201C;&#x3BC;&#x3B1;&#x3BE;&#x3B9;&#x3BB;&#x3B1;&#x3C1;&#x3AC;&#x3BA;&#x3B9;&#x201D; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C3;&#x3AF;&#x3B1; &#x3C4;&#x3BF;&#x3C5; laptop &#x3C3;&#x3B1;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3B7; &#x3B5;&#x3BE;&#x3B5;&#x3B9;&#x3B4;&#x3B9;&#x3BA;&#x3B5;&#x3C5;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3B8;&#x3AE;&#x3BA;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3BF; iPad, &#x3C3;&#x3B1;&#x3C2; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C6;&#x3AD;&#x3C1;&#x3BF;&#x3C5;&#x3BD; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C3;&#x3AF;&#x3B1; &#x3BA;&#x3B1;&#x3B9; &#x3C0;&#x3BF;&#x3BB;&#x3C5;&#x3C7;&#x3C1;&#x3B7;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC;&#x3C4;&#x3B7;&#x3C4;&#x3B1; &#x3C0;&#x3BF;&#x3C5; &#x3B6;&#x3B7;&#x3C4;&#x3BF;&#x3CD;&#x3C3;&#x3B1;&#x3C4;&#x3B5;.</Description><Price>159</Price><Image>http://www.gricgroup.gr/media/catalog/productno_selection</Image></product><product><SKU>BL-US-BP-RU</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge Bags - Backpack - Rust</Name><Description>&#x393;&#x3B9;&#x3B1; &#x3B5;&#x3C3;&#x3AC;&#x3C2; &#x3C0;&#x3BF;&#x3C5; &#x3C3;&#x3B1;&#x3C2; &#x3B1;&#x3C1;&#x3AD;&#x3C3;&#x3B5;&#x3B9; &#x3BD;&#x3B1; &#x3BA;&#x3B9;&#x3BD;&#x3B5;&#x3AF;&#x3C3;&#x3C4;&#x3B5; &#x3BC;&#x3B5; &#x3C3;&#x3C4;&#x3C5;&#x3BB;. &#x3A4;&#x3C5;&#x3BB;&#x3AF;&#x3BE;&#x3C4;&#x3B5; &#x3AE; &#x3B4;&#x3B9;&#x3C0;&#x3BB;&#x3CE;&#x3C3;&#x3C4;&#x3B5; &#x3C4;&#x3BF; &#x3C0;&#x3AC;&#x3BD;&#x3C9; &#x3BC;&#x3AD;&#x3C1;&#x3BF;&#x3C2; &#x3C4;&#x3B7;&#x3C2; &#x3C4;&#x3C3;&#x3AC;&#x3BD;&#x3C4;&#x3B1;&#x3C2; &#x3B1;&#x3BD;&#x3AC;&#x3BB;&#x3BF;&#x3B3;&#x3B1; &#x3BC;&#x3B5; &#x3C4;&#x3B7;&#x3BD; &#x3B4;&#x3B9;&#x3AC;&#x3B8;&#x3B5;&#x3C3;&#x3AE; &#x3C3;&#x3B1;&#x3C2;. &#x39F;&#x3B9; &#x3B5;&#x3C1;&#x3B3;&#x3BF;&#x3BD;&#x3BF;&#x3BC;&#x3B9;&#x3BA;&#x3AD;&#x3C2; &#x3BB;&#x3B1;&#x3B2;&#x3AD;&#x3C2; &#x3C4;&#x3BF;&#x3C5; Backpack &#x3B1;&#x3B3;&#x3BA;&#x3B1;&#x3BB;&#x3B9;&#x3AC;&#x3B6;&#x3BF;&#x3C5;&#x3BD; &#x3C4;&#x3BF;&#x3BD; &#x3BB;&#x3B1;&#x3B9;&#x3BC;&#x3CC; &#x3C3;&#x3B1;&#x3C2;, &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3BD; &#x3B1;&#x3C0;&#x3CC;&#x3BB;&#x3C5;&#x3C4;&#x3B7; &#x3B1;&#x3AF;&#x3C3;&#x3B8;&#x3B7;&#x3C3;&#x3B7; &#x3B5;&#x3C6;&#x3B1;&#x3C1;&#x3BC;&#x3BF;&#x3B3;&#x3AE;&#x3C2; &#x3C3;&#x3C4;&#x3BF; &#x3C3;&#x3CE;&#x3BC;&#x3B1; &#x3C3;&#x3B1;&#x3C2;. &#x394;&#x3B9;&#x3B1;&#x3BA;&#x3BF;&#x3C3;&#x3BC;&#x3B7;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3BC;&#x3B5; &#x3B1;&#x3B3;&#x3BA;&#x3C1;&#x3AC;&#x3C6;&#x3B5;&#x3C2; &#x3B1;&#x3C0;&#x3CC; &#x3B1;&#x3BB;&#x3BF;&#x3C5;&#x3BC;&#x3AF;&#x3BD;&#x3B9;&#x3BF; &#x3BA;&#x3B1;&#x3B9; &#x3BA;&#x3BF;&#x3C5;&#x3BC;&#x3C0;&#x3CE;&#x3BC;&#x3B1;&#x3C4;&#x3B1;&#xD;
&#x3BC;&#x3B5; &#x3C4;&#x3BF; &#x3C3;&#x3CD;&#x3C3;&#x3C4;&#x3B7;&#x3BC;&#x3B1; &#x3B3;&#x3C1;&#x3AE;&#x3B3;&#x3BF;&#x3C1;&#x3BF;&#x3C5; &#x3B1;&#x3BD;&#x3BF;&#x3AF;&#x3B3;&#x3BC;&#x3B1;&#x3C4;&#x3BF;&#x3C2;, &#x3C3;&#x3B1;&#x3C2; &#x3B4;&#x3AF;&#x3BD;&#x3B5;&#x3B9; &#x3C4;&#x3B7;&#x3BD; &#x3B1;&#x3AF;&#x3C3;&#x3B8;&#x3B7;&#x3C3;&#x3B7; &#x3CC;&#x3C4;&#x3B9; &#x3AD;&#x3C7;&#x3B5;&#x3B9; &#x3C6;&#x3C4;&#x3B9;&#x3B1;&#x3C7;&#x3C4;&#x3B5;&#x3AF; &#x3B5;&#x3B9;&#x3B4;&#x3B9;&#x3BA;&#x3AC; &#x3B3;&#x3B9;&#x3B1; &#x3B5;&#x3C3;&#x3AC;&#x3C2;! &#x3A4;&#x3BF; Backpack &#x3AD;&#x3C7;&#x3B5;&#x3B9; &#x3CC;&#x3BB;&#x3B1; &#x3C4;&#x3B1; &#x3C7;&#x3B1;&#x3C1;&#x3B1;&#x3BA;&#x3C4;&#x3B7;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3B9;&#x3C2; &#x3B5;&#x3C5;&#x3BA;&#x3BF;&#x3BB;&#x3AF;&#x3B5;&#x3C2;&#xD;
&#x3C0;&#x3C1;&#x3BF;&#x3BA;&#x3B5;&#x3B9;&#x3BC;&#x3AD;&#x3BD;&#x3BF;&#x3C5; &#x3BD;&#x3B1; &#x3BA;&#x3BF;&#x3C5;&#x3B2;&#x3B1;&#x3BB;&#x3AC;&#x3C4;&#x3B5; &#x3C0;&#x3AC;&#x3BD;&#x3C4;&#x3B1; &#x3BC;&#x3B1;&#x3B6;&#x3AF; &#x3C3;&#x3B1;&#x3C2; &#x3CC;&#x3BB;&#x3B5;&#x3C2; &#x3C3;&#x3B1;&#x3C2; &#x3C4;&#x3B9;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2;. &#x3A4;&#x3BF; &#x3B5;&#x3B9;&#x3B4;&#x3B9;&#x3BA;&#x3AC; &#x3BA;&#x3B1;&#x3C4;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x201C;&#x3BC;&#x3B1;&#x3BE;&#x3B9;&#x3BB;&#x3B1;&#x3C1;&#x3AC;&#x3BA;&#x3B9;&#x201D; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C3;&#x3AF;&#x3B1; &#x3C4;&#x3BF;&#x3C5; laptop &#x3C3;&#x3B1;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3B7; &#x3B5;&#x3BE;&#x3B5;&#x3B9;&#x3B4;&#x3B9;&#x3BA;&#x3B5;&#x3C5;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3B8;&#x3AE;&#x3BA;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3BF; iPad, &#x3C3;&#x3B1;&#x3C2; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C6;&#x3AD;&#x3C1;&#x3BF;&#x3C5;&#x3BD; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C3;&#x3AF;&#x3B1; &#x3BA;&#x3B1;&#x3B9; &#x3C0;&#x3BF;&#x3BB;&#x3C5;&#x3C7;&#x3C1;&#x3B7;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3CC;&#x3C4;&#x3B7;&#x3C4;&#x3B1; &#x3C0;&#x3BF;&#x3C5; &#x3B6;&#x3B7;&#x3C4;&#x3BF;&#x3CD;&#x3C3;&#x3B1;&#x3C4;&#x3B5;.</Description><Price>159</Price><Image>http://www.gricgroup.gr/media/catalog/product/u/s/us_backpack_top05b_1.jpg</Image></product><product><SKU>BL-US-BT-SM</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Laptop Tote - Small</Name><Description>&#x388;&#x3BD;&#x3B1; &#x3BD;&#x3AD;&#x3BF; &#x3B5;&#x3AF;&#x3B4;&#x3BF;&#x3C2; &#x3BF;&#x3C1;&#x3B3;&#x3B1;&#x3BD;&#x3C9;&#x3BC;&#x3AD;&#x3BD;&#x3B7;&#x3C2; &#x3BA;&#x3AC;&#x3B8;&#x3B5;&#x3C4;&#x3B7;&#x3C2; &#x3C4;&#x3C3;&#x3AC;&#x3BD;&#x3C4;&#x3B1;&#x3C2; (Tote), &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3C4;&#x3B1;&#x3B9;&#x3C1;&#x3B9;&#x3AC;&#x3B6;&#x3B5;&#x3B9; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3BA;&#x3B1;&#x3B8;&#x3B7;&#x3BC;&#x3B5;&#x3C1;&#x3B9;&#x3BD;&#x3AE; &#x3BC;&#x3B5;&#x3C4;&#x3B1;&#x3BA;&#x3AF;&#x3BD;&#x3B7;&#x3C3;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3BA;&#x3AC;&#x3B8;&#x3B5; &#x3C0;&#x3B5;&#x3C1;&#x3AF;&#x3C3;&#x3C4;&#x3B1;&#x3C3;&#x3B7;. &#x39C;&#x3B9;&#x3B1; &#x3BA;&#x3BF;&#x3BC;&#x3C8;&#x3AE; &#x3C3;&#x3B9;&#x3BB;&#x3BF;&#x3C5;&#x3AD;&#x3C4;&#x3B1; &#x3BC;&#x3B5; &#x3C3;&#x3C4;&#x3C5;&#x3BB; &#x3BA;&#x3B1;&#x3B9; design &#x3BA;&#x3B1;&#x3C4;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3B1;&#x3C0;&#x3CC; 100% &#x3B1;&#x3BD;&#x3B1;&#x3BA;&#x3C5;&#x3BA;&#x3BB;&#x3C9;&#x3BC;&#x3AD;&#x3BD;&#x3BF; PET &#x3CD;&#x3C6;&#x3B1;&#x3C3;&#x3BC;&#x3B1;.&#xD;
&#x3A3;&#x3BA;&#x3BB;&#x3B7;&#x3C1;&#x3CC; &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3BD;&#x3B8;&#x3B5;&#x3BA;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3B5;&#x3BE;&#x3C9;&#x3C4;&#x3B5;&#x3C1;&#x3B9;&#x3BA;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3BA;&#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3BC;&#x3B1;&#x3BB;&#x3B1;&#x3BA;&#x3CC; &#x3C3;&#x3C4;&#x3BF; &#x3B5;&#x3C3;&#x3C9;&#x3C4;&#x3B5;&#x3C1;&#x3B9;&#x3BA;&#x3CC; &#x3C4;&#x3B7;&#x3C2;.&#xD;
</Description><Price>129</Price><Image>http://www.gricgroup.gr/media/catalog/product/u/s/us_tote_top01.jpg</Image></product><product><SKU>BL-RO-WH</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Rolio</Name><Description>To Rolio &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3AF;&#x3B1; &#x3BA;&#x3BF;&#x3BC;&#x3C8;&#x3AE; &#x3BA;&#x3B1;&#x3B9; &#x3BB;&#x3B9;&#x3C4;&#x3AE; &#x3BB;&#x3B5;&#x3C5;&#x3BA;&#x3AE; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE; &#x3C0;&#x3BF;&#x3C5; &#x3BC;&#x3B5;&#x3C4;&#x3B1;&#x3C4;&#x3C1;&#x3AD;&#x3C0;&#x3B5;&#x3B9; &#x3AD;&#x3BD;&#x3B1; &#x3C3;&#x3C5;&#x3BD;&#x3B7;&#x3B8;&#x3B9;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3BA;&#x3B1;&#x3BB;&#x3CE;&#x3B4;&#x3B9;&#x3BF; &#x3C6;&#x3CC;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3B7;&#x3C2; Lightning &#x3C4;&#x3B7;&#x3C2; Apple, &#x3C3;&#x3B5; &#x3BC;&#x3B9;&#x3B1; &#x3BD;&#x3BF;&#x3B9;&#x3BA;&#x3BF;&#x3BA;&#x3C5;&#x3C1;&#x3B5;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE; &#x3B4;&#x3B9;&#x3B1;&#x3C7;&#x3B5;&#x3AF;&#x3C1;&#x3B9;&#x3C3;&#x3B7;&#x3C2;/&#x3C6;&#x3CC;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3B7;&#x3C2; &#x3C4;&#x3BF;&#x3C5; &#x3B9;Phone 5/5s &#x3BA;&#x3B9;&#x3BD;&#x3B7;&#x3C4;&#x3BF;&#x3CD; &#x3C3;&#x3B1;&#x3C2; &#x3B1;&#x3C0;&#x3B5;&#x3C5;&#x3B8;&#x3B5;&#x3AF;&#x3B1;&#x3C2; &#x3C3;&#x3C4;&#x3BF;&#x3BD; &#x3C4;&#x3BF;&#x3AF;&#x3C7;&#x3BF;. </Description><Price>12.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/r/o/ro_001.jpg</Image></product><product><SKU>BL-US-MB-01</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Messenger Bag</Name><Description>&#x388;&#x3BD;&#x3B1;&#x3C2; &#x3C3;&#x3C9;&#x3C3;&#x3C4;&#x3CC;&#x3C2; &#x3C4;&#x3B1;&#x3BE;&#x3B9;&#x3B4;&#x3B9;&#x3CE;&#x3C4;&#x3B7;&#x3C2; &#x3C0;&#x3BF;&#x3C4;&#x3AD; &#x3B4;&#x3B5;&#x3BD; &#x3B1;&#x3C6;&#x3AE;&#x3BD;&#x3B5;&#x3B9; &#x3BD;&#x3B1; &#x3C4;&#x3BF;&#x3BD; &#x3B2;&#x3B1;&#x3C1;&#x3B1;&#x3AF;&#x3BD;&#x3BF;&#x3C5;&#x3BD; &#x3BF;&#x3B9; &#x3B1;&#x3C0;&#x3BF;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3C4;&#x3BF;&#x3C5;. H &#x3BA;&#x3BB;&#x3B1;&#x3C3;&#x3C3;&#x3B9;&#x3BA;&#x3AE; Messenger bag, &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3AD;&#x3C4;&#x3BF;&#x3B9;&#x3BC;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3BF; &#x3C4;&#x3B1;&#x3BE;&#x3AF;&#x3B4;&#x3B9; &#x3C4;&#x3B7;&#x3C2; &#x3B7;&#x3BC;&#x3AD;&#x3C1;&#x3B1;&#x3C2;. &#x39F; &#x3B1;&#x3C0;&#x3BB;&#x3CC;&#x3C2; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3CC;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3BF;&#x3B9; &#x3BA;&#x3B1;&#x3B8;&#x3B1;&#x3C1;&#x3AD;&#x3C2; &#x3B3;&#x3C1;&#x3B1;&#x3BC;&#x3BC;&#x3AD;&#x3C2; &#x3C4;&#x3B7;&#x3C2;, &#x3C0;&#x3B1;&#x3C1;&#x3AD;&#x3C7;&#x3BF;&#x3C5;&#x3BD; &#x3B1;&#x3C1;&#x3BA;&#x3B5;&#x3C4;&#x3CC; &#x3C7;&#x3CE;&#x3C1;&#x3BF; &#x3BA;&#x3B1;&#x3B9; &#x3BF;&#x3C1;&#x3B3;&#x3AC;&#x3BD;&#x3C9;&#x3C3;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AE;&#x3C3;&#x3C4;&#x3B5; &#x3C4;&#x3BF; laptop &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3BF; tablet &#x3C3;&#x3B1;&#x3C2; &#x3C0;&#x3C1;&#x3BF;&#x3C6;&#x3C5;&#x3BB;&#x3B1;&#x3B3;&#x3BC;&#x3AD;&#x3BD;&#x3B1; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3B1; &#x3C0;&#x3C1;&#x3AC;&#x3B3;&#x3BC;&#x3B1;&#x3C4;&#x3B1; &#x3C3;&#x3B1;&#x3C2; &#x3C4;&#x3B1;&#x3BA;&#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B7;&#x3BC;&#x3AD;&#x3BD;&#x3B1; .&#xD;
&#xD;
</Description><Price>139</Price><Image>http://www.gricgroup.gr/media/catalog/product/u/s/us_099.jpg</Image></product><product><SKU>BL-US-MB-01-BK</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Messenger Bag - Black</Name><Description>&#x388;&#x3BD;&#x3B1;&#x3C2; &#x3C3;&#x3C9;&#x3C3;&#x3C4;&#x3CC;&#x3C2; &#x3C4;&#x3B1;&#x3BE;&#x3B9;&#x3B4;&#x3B9;&#x3CE;&#x3C4;&#x3B7;&#x3C2; &#x3C0;&#x3BF;&#x3C4;&#x3AD; &#x3B4;&#x3B5;&#x3BD; &#x3B1;&#x3C6;&#x3AE;&#x3BD;&#x3B5;&#x3B9; &#x3BD;&#x3B1; &#x3C4;&#x3BF;&#x3BD; &#x3B2;&#x3B1;&#x3C1;&#x3B1;&#x3AF;&#x3BD;&#x3BF;&#x3C5;&#x3BD; &#x3BF;&#x3B9; &#x3B1;&#x3C0;&#x3BF;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3C4;&#x3BF;&#x3C5;. H &#x3C3;&#x3CD;&#x3B3;&#x3C7;&#x3C1;&#x3BF;&#x3BD;&#x3B7; &#x3B5;&#x3BA;&#x3B4;&#x3BF;&#x3C7;&#x3AE; &#x3C4;&#x3B7;&#x3C2; &#x3BA;&#x3BB;&#x3B1;&#x3C3;&#x3C3;&#x3B9;&#x3BA;&#x3AE;&#x3C2; Messenger bag &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3AD;&#x3C4;&#x3BF;&#x3B9;&#x3BC;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3BF; &#x3C4;&#x3B1;&#x3BE;&#x3AF;&#x3B4;&#x3B9; &#x3C4;&#x3B7;&#x3C2; &#x3B7;&#x3BC;&#x3AD;&#x3C1;&#x3B1;&#x3C2;. &#x39F; &#x3B1;&#x3C0;&#x3BB;&#x3CC;&#x3C2; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3CC;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3BF;&#x3B9; &#x3BA;&#x3B1;&#x3B8;&#x3B1;&#x3C1;&#x3AD;&#x3C2; &#x3B3;&#x3C1;&#x3B1;&#x3BC;&#x3BC;&#x3AD;&#x3C2; &#x3C4;&#x3B7;&#x3C2;, &#x3C0;&#x3B1;&#x3C1;&#x3AD;&#x3C7;&#x3BF;&#x3C5;&#x3BD; &#x3B1;&#x3C1;&#x3BA;&#x3B5;&#x3C4;&#x3CC; &#x3C7;&#x3CE;&#x3C1;&#x3BF; &#x3BA;&#x3B1;&#x3B9; &#x3BF;&#x3C1;&#x3B3;&#x3AC;&#x3BD;&#x3C9;&#x3C3;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AE;&#x3C3;&#x3B5;&#x3C4;&#x3B5; &#x3C4;&#x3B1; &#x3C0;&#x3C1;&#x3AC;&#x3B3;&#x3BC;&#x3B1;&#x3C4;&#x3B1; &#x3C4;&#x3B1;&#x3BA;&#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B7;&#x3BC;&#x3AD;&#x3BD;&#x3B1;. &#x39A;&#x3BB;&#x3B5;&#x3AF;&#x3C3;&#x3C4;&#x3B5; &#x3C4;&#x3BF; &#x3C0;&#x3C4;&#x3B5;&#x3C1;&#x3CD;&#x3B3;&#x3B9;&#x3BF; &#x3BC;&#x3B5; &#x3B2;&#x3AD;&#x3BB;&#x3BA;&#x3C1;&#x3BF; &#x3AE; &#x3C7;&#x3C1;&#x3B7;&#x3C3;&#x3B9;&#x3BC;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3CE;&#x3BD;&#x3C4;&#x3B1;&#x3C2; &#x3C4;&#x3B1; &#x3B1;&#x3BB;&#x3BF;&#x3C5;&#x3BC;&#x3B9;&#x3BD;&#x3AD;&#x3BD;&#x3B9;&#x3B1; &#x3BA;&#x3BF;&#x3C5;&#x3BC;&#x3C0;&#x3CE;&#x3BC;&#x3B1;&#x3C4;&#x3B1; / &#x3B1;&#x3B3;&#x3BA;&#x3C1;&#x3AC;&#x3C6;&#x3B5;&#x3C2;.</Description><Price>139</Price><Image>http://www.gricgroup.gr/media/catalog/product/u/s/us_messenger_top01_1.jpg</Image></product><product><SKU>BL-US-MB-01-RU-LRG</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Messenger Bag - Lrg - Rust</Name><Description>&#x388;&#x3BD;&#x3B1;&#x3C2; &#x3C3;&#x3C9;&#x3C3;&#x3C4;&#x3CC;&#x3C2; &#x3C4;&#x3B1;&#x3BE;&#x3B9;&#x3B4;&#x3B9;&#x3CE;&#x3C4;&#x3B7;&#x3C2; &#x3C0;&#x3BF;&#x3C4;&#x3AD; &#x3B4;&#x3B5;&#x3BD; &#x3B1;&#x3C6;&#x3AE;&#x3BD;&#x3B5;&#x3B9; &#x3BD;&#x3B1; &#x3C4;&#x3BF;&#x3BD; &#x3B2;&#x3B1;&#x3C1;&#x3B1;&#x3AF;&#x3BD;&#x3BF;&#x3C5;&#x3BD; &#x3BF;&#x3B9; &#x3B1;&#x3C0;&#x3BF;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3C4;&#x3BF;&#x3C5;. H &#x3C3;&#x3CD;&#x3B3;&#x3C7;&#x3C1;&#x3BF;&#x3BD;&#x3B7; &#x3B5;&#x3BA;&#x3B4;&#x3BF;&#x3C7;&#x3AE; &#x3C4;&#x3B7;&#x3C2; &#x3BA;&#x3BB;&#x3B1;&#x3C3;&#x3C3;&#x3B9;&#x3BA;&#x3AE;&#x3C2; Messenger bag &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3AD;&#x3C4;&#x3BF;&#x3B9;&#x3BC;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3BF; &#x3C4;&#x3B1;&#x3BE;&#x3AF;&#x3B4;&#x3B9; &#x3C4;&#x3B7;&#x3C2; &#x3B7;&#x3BC;&#x3AD;&#x3C1;&#x3B1;&#x3C2;. &#x39F; &#x3B1;&#x3C0;&#x3BB;&#x3CC;&#x3C2; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3CC;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3BF;&#x3B9; &#x3BA;&#x3B1;&#x3B8;&#x3B1;&#x3C1;&#x3AD;&#x3C2; &#x3B3;&#x3C1;&#x3B1;&#x3BC;&#x3BC;&#x3AD;&#x3C2; &#x3C4;&#x3B7;&#x3C2;, &#x3C0;&#x3B1;&#x3C1;&#x3AD;&#x3C7;&#x3BF;&#x3C5;&#x3BD; &#x3B1;&#x3C1;&#x3BA;&#x3B5;&#x3C4;&#x3CC; &#x3C7;&#x3CE;&#x3C1;&#x3BF; &#x3BA;&#x3B1;&#x3B9; &#x3BF;&#x3C1;&#x3B3;&#x3AC;&#x3BD;&#x3C9;&#x3C3;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AE;&#x3C3;&#x3B5;&#x3C4;&#x3B5; &#x3C4;&#x3B1; &#x3C0;&#x3C1;&#x3AC;&#x3B3;&#x3BC;&#x3B1;&#x3C4;&#x3B1; &#x3C4;&#x3B1;&#x3BA;&#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B7;&#x3BC;&#x3AD;&#x3BD;&#x3B1;.&#xD;
&#x39A;&#x3BB;&#x3B5;&#x3AF;&#x3C3;&#x3C4;&#x3B5; &#x3C4;&#x3BF; &#x3C0;&#x3C4;&#x3B5;&#x3C1;&#x3CD;&#x3B3;&#x3B9;&#x3BF; &#x3BC;&#x3B5; &#x3B2;&#x3AD;&#x3BB;&#x3BA;&#x3C1;&#x3BF; &#x3AE; &#x3C7;&#x3C1;&#x3B7;&#x3C3;&#x3B9;&#x3BC;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3CE;&#x3BD;&#x3C4;&#x3B1;&#x3C2; &#x3C4;&#x3B1; &#x3B1;&#x3BB;&#x3BF;&#x3C5;&#x3BC;&#x3B9;&#x3BD;&#x3AD;&#x3BD;&#x3B9;&#x3B1;&#xD;
&#x3BA;&#x3BF;&#x3C5;&#x3BC;&#x3C0;&#x3CE;&#x3BC;&#x3B1;&#x3C4;&#x3B1; / &#x3B1;&#x3B3;&#x3BA;&#x3C1;&#x3AC;&#x3C6;&#x3B5;&#x3C2;.</Description><Price>141</Price><Image>http://www.gricgroup.gr/media/catalog/productno_selection</Image></product><product><SKU>BL-US-MB-01-GRY</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Messenger Bag - Grey</Name><Description> &#x388;&#x3BD;&#x3B1;&#x3C2; &#x3C3;&#x3C9;&#x3C3;&#x3C4;&#x3CC;&#x3C2; &#x3C4;&#x3B1;&#x3BE;&#x3B9;&#x3B4;&#x3B9;&#x3CE;&#x3C4;&#x3B7;&#x3C2; &#x3C0;&#x3BF;&#x3C4;&#x3AD; &#x3B4;&#x3B5;&#x3BD; &#x3B1;&#x3C6;&#x3AE;&#x3BD;&#x3B5;&#x3B9; &#x3BD;&#x3B1; &#x3C4;&#x3BF;&#x3BD; &#x3B2;&#x3B1;&#x3C1;&#x3B1;&#x3AF;&#x3BD;&#x3BF;&#x3C5;&#x3BD; &#x3BF;&#x3B9; &#x3B1;&#x3C0;&#x3BF;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3C4;&#x3BF;&#x3C5;. H &#x3C3;&#x3CD;&#x3B3;&#x3C7;&#x3C1;&#x3BF;&#x3BD;&#x3B7; &#x3B5;&#x3BA;&#x3B4;&#x3BF;&#x3C7;&#x3AE; &#x3C4;&#x3B7;&#x3C2; &#x3BA;&#x3BB;&#x3B1;&#x3C3;&#x3C3;&#x3B9;&#x3BA;&#x3AE;&#x3C2; Messenger bag &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3AD;&#x3C4;&#x3BF;&#x3B9;&#x3BC;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3BF; &#x3C4;&#x3B1;&#x3BE;&#x3AF;&#x3B4;&#x3B9; &#x3C4;&#x3B7;&#x3C2; &#x3B7;&#x3BC;&#x3AD;&#x3C1;&#x3B1;&#x3C2;. &#x39F; &#x3B1;&#x3C0;&#x3BB;&#x3CC;&#x3C2; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3CC;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3BF;&#x3B9; &#x3BA;&#x3B1;&#x3B8;&#x3B1;&#x3C1;&#x3AD;&#x3C2; &#x3B3;&#x3C1;&#x3B1;&#x3BC;&#x3BC;&#x3AD;&#x3C2; &#x3C4;&#x3B7;&#x3C2;, &#x3C0;&#x3B1;&#x3C1;&#x3AD;&#x3C7;&#x3BF;&#x3C5;&#x3BD; &#x3B1;&#x3C1;&#x3BA;&#x3B5;&#x3C4;&#x3CC; &#x3C7;&#x3CE;&#x3C1;&#x3BF; &#x3BA;&#x3B1;&#x3B9; &#x3BF;&#x3C1;&#x3B3;&#x3AC;&#x3BD;&#x3C9;&#x3C3;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AE;&#x3C3;&#x3B5;&#x3C4;&#x3B5; &#x3C4;&#x3B1; &#x3C0;&#x3C1;&#x3AC;&#x3B3;&#x3BC;&#x3B1;&#x3C4;&#x3B1; &#x3C4;&#x3B1;&#x3BA;&#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B7;&#x3BC;&#x3AD;&#x3BD;&#x3B1;. &#x39A;&#x3BB;&#x3B5;&#x3AF;&#x3C3;&#x3C4;&#x3B5; &#x3C4;&#x3BF; &#x3C0;&#x3C4;&#x3B5;&#x3C1;&#x3CD;&#x3B3;&#x3B9;&#x3BF; &#x3BC;&#x3B5; &#x3B2;&#x3AD;&#x3BB;&#x3BA;&#x3C1;&#x3BF; &#x3AE; &#x3C7;&#x3C1;&#x3B7;&#x3C3;&#x3B9;&#x3BC;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3CE;&#x3BD;&#x3C4;&#x3B1;&#x3C2; &#x3C4;&#x3B1; &#x3B1;&#x3BB;&#x3BF;&#x3C5;&#x3BC;&#x3B9;&#x3BD;&#x3AD;&#x3BD;&#x3B9;&#x3B1; &#x3BA;&#x3BF;&#x3C5;&#x3BC;&#x3C0;&#x3CE;&#x3BC;&#x3B1;&#x3C4;&#x3B1; / &#x3B1;&#x3B3;&#x3BA;&#x3C1;&#x3AC;&#x3C6;&#x3B5;&#x3C2;.</Description><Price>139</Price><Image>http://www.gricgroup.gr/media/catalog/productno_selection</Image></product><product><SKU>BL-US-MB-01-RU-SM</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Messenger Bag - Sm - Rust</Name><Description>&#x388;&#x3BD;&#x3B1;&#x3C2; &#x3C3;&#x3C9;&#x3C3;&#x3C4;&#x3CC;&#x3C2; &#x3C4;&#x3B1;&#x3BE;&#x3B9;&#x3B4;&#x3B9;&#x3CE;&#x3C4;&#x3B7;&#x3C2; &#x3C0;&#x3BF;&#x3C4;&#x3AD; &#x3B4;&#x3B5;&#x3BD; &#x3B1;&#x3C6;&#x3AE;&#x3BD;&#x3B5;&#x3B9; &#x3BD;&#x3B1; &#x3C4;&#x3BF;&#x3BD; &#x3B2;&#x3B1;&#x3C1;&#x3B1;&#x3AF;&#x3BD;&#x3BF;&#x3C5;&#x3BD; &#x3BF;&#x3B9; &#x3B1;&#x3C0;&#x3BF;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3C4;&#x3BF;&#x3C5;. H &#x3C3;&#x3CD;&#x3B3;&#x3C7;&#x3C1;&#x3BF;&#x3BD;&#x3B7; &#x3B5;&#x3BA;&#x3B4;&#x3BF;&#x3C7;&#x3AE; &#x3C4;&#x3B7;&#x3C2; &#x3BA;&#x3BB;&#x3B1;&#x3C3;&#x3C3;&#x3B9;&#x3BA;&#x3AE;&#x3C2; Messenger bag &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3AD;&#x3C4;&#x3BF;&#x3B9;&#x3BC;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3BF; &#x3C4;&#x3B1;&#x3BE;&#x3AF;&#x3B4;&#x3B9; &#x3C4;&#x3B7;&#x3C2; &#x3B7;&#x3BC;&#x3AD;&#x3C1;&#x3B1;&#x3C2;. &#x39F; &#x3B1;&#x3C0;&#x3BB;&#x3CC;&#x3C2; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3CC;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3BF;&#x3B9; &#x3BA;&#x3B1;&#x3B8;&#x3B1;&#x3C1;&#x3AD;&#x3C2; &#x3B3;&#x3C1;&#x3B1;&#x3BC;&#x3BC;&#x3AD;&#x3C2; &#x3C4;&#x3B7;&#x3C2;, &#x3C0;&#x3B1;&#x3C1;&#x3AD;&#x3C7;&#x3BF;&#x3C5;&#x3BD; &#x3B1;&#x3C1;&#x3BA;&#x3B5;&#x3C4;&#x3CC; &#x3C7;&#x3CE;&#x3C1;&#x3BF; &#x3BA;&#x3B1;&#x3B9; &#x3BF;&#x3C1;&#x3B3;&#x3AC;&#x3BD;&#x3C9;&#x3C3;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AE;&#x3C3;&#x3B5;&#x3C4;&#x3B5; &#x3C4;&#x3B1; &#x3C0;&#x3C1;&#x3AC;&#x3B3;&#x3BC;&#x3B1;&#x3C4;&#x3B1; &#x3C4;&#x3B1;&#x3BA;&#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B7;&#x3BC;&#x3AD;&#x3BD;&#x3B1;. &#x39A;&#x3BB;&#x3B5;&#x3AF;&#x3C3;&#x3C4;&#x3B5; &#x3C4;&#x3BF; &#x3C0;&#x3C4;&#x3B5;&#x3C1;&#x3CD;&#x3B3;&#x3B9;&#x3BF; &#x3BC;&#x3B5; &#x3B2;&#x3AD;&#x3BB;&#x3BA;&#x3C1;&#x3BF; &#x3AE; &#x3C7;&#x3C1;&#x3B7;&#x3C3;&#x3B9;&#x3BC;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3CE;&#x3BD;&#x3C4;&#x3B1;&#x3C2; &#x3C4;&#x3B1; &#x3B1;&#x3BB;&#x3BF;&#x3C5;&#x3BC;&#x3B9;&#x3BD;&#x3AD;&#x3BD;&#x3B9;&#x3B1; &#x3BA;&#x3BF;&#x3C5;&#x3BC;&#x3C0;&#x3CE;&#x3BC;&#x3B1;&#x3C4;&#x3B1; / &#x3B1;&#x3B3;&#x3BA;&#x3C1;&#x3AC;&#x3C6;&#x3B5;&#x3C2;.</Description><Price>139</Price><Image>http://www.gricgroup.gr/media/catalog/productno_selection</Image></product><product><SKU>BL-US-BT</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Laptop Tote</Name><Description>&#x388;&#x3BD;&#x3B1; &#x3BD;&#x3AD;&#x3BF; &#x3B5;&#x3AF;&#x3B4;&#x3BF;&#x3C2; &#x3BF;&#x3C1;&#x3B3;&#x3B1;&#x3BD;&#x3C9;&#x3BC;&#x3AD;&#x3BD;&#x3B7;&#x3C2; &#x3BA;&#x3AC;&#x3B8;&#x3B5;&#x3C4;&#x3B7;&#x3C2; &#x3C4;&#x3C3;&#x3AC;&#x3BD;&#x3C4;&#x3B1;&#x3C2; (Tote), &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3C4;&#x3B1;&#x3B9;&#x3C1;&#x3B9;&#x3AC;&#x3B6;&#x3B5;&#x3B9; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3BA;&#x3B1;&#x3B8;&#x3B7;&#x3BC;&#x3B5;&#x3C1;&#x3B9;&#x3BD;&#x3AE; &#x3BC;&#x3B5;&#x3C4;&#x3B1;&#x3BA;&#x3AF;&#x3BD;&#x3B7;&#x3C3;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3BA;&#x3AC;&#x3B8;&#x3B5; &#x3C0;&#x3B5;&#x3C1;&#x3AF;&#x3C3;&#x3C4;&#x3B1;&#x3C3;&#x3B7;. &#x39C;&#x3B9;&#x3B1; &#x3BA;&#x3BF;&#x3BC;&#x3C8;&#x3AE; &#x3C3;&#x3B9;&#x3BB;&#x3BF;&#x3C5;&#x3AD;&#x3C4;&#x3B1; &#x3BC;&#x3B5; &#x3C3;&#x3C4;&#x3C5;&#x3BB; &#x3BA;&#x3B1;&#x3B9; design &#x3BA;&#x3B1;&#x3C4;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3B1;&#x3C0;&#x3CC; 100% &#x3B1;&#x3BD;&#x3B1;&#x3BA;&#x3C5;&#x3BA;&#x3BB;&#x3C9;&#x3BC;&#x3AD;&#x3BD;&#x3BF; PET &#x3CD;&#x3C6;&#x3B1;&#x3C3;&#x3BC;&#x3B1;.&#xD;
&#x3A3;&#x3BA;&#x3BB;&#x3B7;&#x3C1;&#x3CC; &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3BD;&#x3B8;&#x3B5;&#x3BA;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3B5;&#x3BE;&#x3C9;&#x3C4;&#x3B5;&#x3C1;&#x3B9;&#x3BA;&#x3AC; &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3BA;&#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3BC;&#x3B1;&#x3BB;&#x3B1;&#x3BA;&#x3CC; &#x3C3;&#x3C4;&#x3BF; &#x3B5;&#x3C3;&#x3C9;&#x3C4;&#x3B5;&#x3C1;&#x3B9;&#x3BA;&#x3CC; &#x3C4;&#x3B7;&#x3C2;.&#xD;
</Description><Price>129</Price><Image>http://www.gricgroup.gr/media/catalog/product/3/1/319242_10150451057124919_843721624_n.jpg</Image></product><product><SKU>BL-US-LS-03</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Laptop Sleeve</Name><Description>&#x3A0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3AD;&#x3C8;&#x3C4;&#x3B5; &#x3C4;&#x3BF; Macbook Pro &#x3BA;&#x3B1;&#x3B9; Macbook Air &#x3C3;&#x3B1;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3AD;&#x3C7;&#x3B5;&#x3C4;&#x3B5; &#x3C4;&#x3BF; &#x3BA;&#x3B5;&#x3C6;&#x3AC;&#x3BB;&#x3B9; &#x3C3;&#x3B1;&#x3C2; &#x3AE;&#x3C3;&#x3C5;&#x3C7;&#x3BF;. &#x395;&#x3C6;&#x3B1;&#x3C1;&#x3BC;&#x3CC;&#x3B6;&#x3B5;&#x3B9; &#x3BA;&#x3B1;&#x3BB;&#x3AC; &#x3C7;&#x3C9;&#x3C1;&#x3AF;&#x3C2; &#x3BD;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3B8;&#x3AD;&#x3C4;&#x3B5;&#x3B9; &#x3CC;&#x3B3;&#x3BA;&#x3BF; &#x3AE; &#x3B2;&#x3AC;&#x3C1;&#x3BF;&#x3C2;, &#x3BA;&#x3B1;&#x3B9; &#x3B4;&#x3B7;&#x3BC;&#x3B9;&#x3BF;&#x3C5;&#x3C1;&#x3B3;&#x3B5;&#x3AF; &#x3BC;&#x3AF;&#x3B1; &#x3BA;&#x3BF;&#x3BC;&#x3C8;&#x3AE; &#x3B5;&#x3C0;&#x3B1;&#x3B3;&#x3B3;&#x3B5;&#x3BB;&#x3BC;&#x3B1;&#x3C4;&#x3B9;&#x3BA;&#x3AE; &#x3B5;&#x3BC;&#x3C6;&#x3AC;&#x3BD;&#x3B9;&#x3C3;&#x3B7;. &#x3A4;&#x3BF; Sleeve &#x3BA;&#x3BB;&#x3B5;&#x3AF;&#x3BD;&#x3B5;&#x3B9; &#x3BC;&#x3B5; &#x3BC;&#x3B1;&#x3B3;&#x3BD;&#x3B7;&#x3C4;&#x3B9;&#x3BA;&#x3AC; snaps &#x3BA;&#x3B1;&#x3B9; &#x3C3;&#x3C4;&#x3B5;&#x3C1;&#x3B5;&#x3CE;&#x3BD;&#x3B5;&#x3C4;&#x3B1;&#x3B9; &#x3C0;&#x3B5;&#x3C1;&#x3B1;&#x3B9;&#x3C4;&#x3AD;&#x3C1;&#x3C9; &#x3BC;&#x3B5; &#x3C4;&#x3B7;&#x3BD; &#x3B1;&#x3B3;&#x3BA;&#x3C1;&#x3AC;&#x3C6;&#x3B1; &#x3B1;&#x3BB;&#x3BF;&#x3C5;&#x3BC;&#x3B9;&#x3BD;&#x3AF;&#x3BF;&#x3C5; &#x3B1;&#x3C0;&#x3CC; &#x3BC;&#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3AC;.&#xD;
A&#x3BD;&#x3B8;&#x3B5;&#x3BA;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3C7;&#x3B1;&#x3C1;&#x3B1;&#x3BA;&#x3C4;&#x3B7;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3BF;&#x3CD;&#x3BD; &#x3C4;&#x3B9;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3C3;&#x3B1;&#x3C2; &#x3B1;&#x3C3;&#x3C6;&#x3B1;&#x3BB;&#x3B5;&#x3AF;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3C5;&#x3BC;&#x3AD;&#x3BD;&#x3B5;&#x3C2;, &#x3C4;&#x3C5;&#x3BB;&#x3B9;&#x3B3;&#x3BC;&#x3AD;&#x3BD;&#x3B5;&#x3C2; &#x3C0;&#x3B1;&#x3C1;&#x3AC;&#x3BB;&#x3BB;&#x3B7;&#x3BB;&#x3B1; &#x3C3;&#x3B5; &#x3AD;&#x3BD;&#x3B1; &#x3BC;&#x3BF;&#x3BD;&#x3C4;&#x3AD;&#x3C1;&#x3BD;&#x3BF; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3CC;.</Description><Price>49.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/u/s/us_101.jpg</Image></product><product><SKU>BL-US-LS-03-BK</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Laptop Sleeve - Black 13"</Name><Description>&#x3A0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3AD;&#x3C8;&#x3C4;&#x3B5; &#x3C4;&#x3BF; Macbook Pro &#x3BA;&#x3B1;&#x3B9; Macbook Air &#x3C3;&#x3B1;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3AD;&#x3C7;&#x3B5;&#x3C4;&#x3B5; &#x3C4;&#x3BF; &#x3BA;&#x3B5;&#x3C6;&#x3AC;&#x3BB;&#x3B9; &#x3C3;&#x3B1;&#x3C2; &#x3AE;&#x3C3;&#x3C5;&#x3C7;&#x3BF;. &#x395;&#x3C6;&#x3B1;&#x3C1;&#x3BC;&#x3CC;&#x3B6;&#x3B5;&#x3B9; &#x3BA;&#x3B1;&#x3BB;&#x3AC; &#x3C7;&#x3C9;&#x3C1;&#x3AF;&#x3C2; &#x3BD;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3B8;&#x3AD;&#x3C4;&#x3B5;&#x3B9; &#x3CC;&#x3B3;&#x3BA;&#x3BF; &#x3AE; &#x3B2;&#x3AC;&#x3C1;&#x3BF;&#x3C2;, &#x3BA;&#x3B1;&#x3B9; &#x3B4;&#x3B7;&#x3BC;&#x3B9;&#x3BF;&#x3C5;&#x3C1;&#x3B3;&#x3B5;&#x3AF; &#x3BC;&#x3AF;&#x3B1; &#x3BA;&#x3BF;&#x3BC;&#x3C8;&#x3AE; &#x3B5;&#x3C0;&#x3B1;&#x3B3;&#x3B3;&#x3B5;&#x3BB;&#x3BC;&#x3B1;&#x3C4;&#x3B9;&#x3BA;&#x3AE; &#x3B5;&#x3BC;&#x3C6;&#x3AC;&#x3BD;&#x3B9;&#x3C3;&#x3B7;. &#x3A4;&#x3BF; Sleeve &#x3BA;&#x3BB;&#x3B5;&#x3AF;&#x3BD;&#x3B5;&#x3B9; &#x3BC;&#x3B5; &#x3BC;&#x3B1;&#x3B3;&#x3BD;&#x3B7;&#x3C4;&#x3B9;&#x3BA;&#x3AC; snaps &#x3BA;&#x3B1;&#x3B9; &#x3C3;&#x3C4;&#x3B5;&#x3C1;&#x3B5;&#x3CE;&#x3BD;&#x3B5;&#x3C4;&#x3B1;&#x3B9; &#x3C0;&#x3B5;&#x3C1;&#x3B1;&#x3B9;&#x3C4;&#x3AD;&#x3C1;&#x3C9; &#x3BC;&#x3B5; &#x3C4;&#x3B7;&#x3BD; &#x3B1;&#x3B3;&#x3BA;&#x3C1;&#x3AC;&#x3C6;&#x3B1; &#x3B1;&#x3BB;&#x3BF;&#x3C5;&#x3BC;&#x3B9;&#x3BD;&#x3AF;&#x3BF;&#x3C5; &#x3B1;&#x3C0;&#x3CC; &#x3BC;&#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3AC;.&#xD;
A&#x3BD;&#x3B8;&#x3B5;&#x3BA;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3C7;&#x3B1;&#x3C1;&#x3B1;&#x3BA;&#x3C4;&#x3B7;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3BF;&#x3CD;&#x3BD; &#x3C4;&#x3B9;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3C3;&#x3B1;&#x3C2; &#x3B1;&#x3C3;&#x3C6;&#x3B1;&#x3BB;&#x3B5;&#x3AF;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3C5;&#x3BC;&#x3AD;&#x3BD;&#x3B5;&#x3C2;, &#x3C4;&#x3C5;&#x3BB;&#x3B9;&#x3B3;&#x3BC;&#x3AD;&#x3BD;&#x3B5;&#x3C2; &#x3C0;&#x3B1;&#x3C1;&#x3AC;&#x3BB;&#x3BB;&#x3B7;&#x3BB;&#x3B1; &#x3C3;&#x3B5; &#x3AD;&#x3BD;&#x3B1; &#x3BC;&#x3BF;&#x3BD;&#x3C4;&#x3AD;&#x3C1;&#x3BD;&#x3BF; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3CC;.</Description><Price>49.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/u/s/us_sleeve_top01_2.jpg</Image></product><product><SKU>BL-US-LS-03-RU</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Laptop Sleeve - Rust 13"</Name><Description>&#x3A0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3AD;&#x3C8;&#x3C4;&#x3B5; &#x3C4;&#x3BF; Macbook Pro &#x3BA;&#x3B1;&#x3B9; Macbook Air &#x3C3;&#x3B1;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3AD;&#x3C7;&#x3B5;&#x3C4;&#x3B5; &#x3C4;&#x3BF; &#x3BA;&#x3B5;&#x3C6;&#x3AC;&#x3BB;&#x3B9; &#x3C3;&#x3B1;&#x3C2; &#x3AE;&#x3C3;&#x3C5;&#x3C7;&#x3BF;. &#x395;&#x3C6;&#x3B1;&#x3C1;&#x3BC;&#x3CC;&#x3B6;&#x3B5;&#x3B9; &#x3BA;&#x3B1;&#x3BB;&#x3AC; &#x3C7;&#x3C9;&#x3C1;&#x3AF;&#x3C2; &#x3BD;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3B8;&#x3AD;&#x3C4;&#x3B5;&#x3B9; &#x3CC;&#x3B3;&#x3BA;&#x3BF; &#x3AE; &#x3B2;&#x3AC;&#x3C1;&#x3BF;&#x3C2;, &#x3BA;&#x3B1;&#x3B9; &#x3B4;&#x3B7;&#x3BC;&#x3B9;&#x3BF;&#x3C5;&#x3C1;&#x3B3;&#x3B5;&#x3AF; &#x3BC;&#x3AF;&#x3B1; &#x3BA;&#x3BF;&#x3BC;&#x3C8;&#x3AE; &#x3B5;&#x3C0;&#x3B1;&#x3B3;&#x3B3;&#x3B5;&#x3BB;&#x3BC;&#x3B1;&#x3C4;&#x3B9;&#x3BA;&#x3AE; &#x3B5;&#x3BC;&#x3C6;&#x3AC;&#x3BD;&#x3B9;&#x3C3;&#x3B7;. &#x3A4;&#x3BF; Sleeve &#x3BA;&#x3BB;&#x3B5;&#x3AF;&#x3BD;&#x3B5;&#x3B9; &#x3BC;&#x3B5; &#x3BC;&#x3B1;&#x3B3;&#x3BD;&#x3B7;&#x3C4;&#x3B9;&#x3BA;&#x3AC; snaps &#x3BA;&#x3B1;&#x3B9; &#x3C3;&#x3C4;&#x3B5;&#x3C1;&#x3B5;&#x3CE;&#x3BD;&#x3B5;&#x3C4;&#x3B1;&#x3B9; &#x3C0;&#x3B5;&#x3C1;&#x3B1;&#x3B9;&#x3C4;&#x3AD;&#x3C1;&#x3C9; &#x3BC;&#x3B5; &#x3C4;&#x3B7;&#x3BD; &#x3B1;&#x3B3;&#x3BA;&#x3C1;&#x3AC;&#x3C6;&#x3B1; &#x3B1;&#x3BB;&#x3BF;&#x3C5;&#x3BC;&#x3B9;&#x3BD;&#x3AF;&#x3BF;&#x3C5; &#x3B1;&#x3C0;&#x3CC; &#x3BC;&#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3AC;.&#xD;
A&#x3BD;&#x3B8;&#x3B5;&#x3BA;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3C7;&#x3B1;&#x3C1;&#x3B1;&#x3BA;&#x3C4;&#x3B7;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3BF;&#x3CD;&#x3BD; &#x3C4;&#x3B9;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3C3;&#x3B1;&#x3C2; &#x3B1;&#x3C3;&#x3C6;&#x3B1;&#x3BB;&#x3B5;&#x3AF;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3C5;&#x3BC;&#x3AD;&#x3BD;&#x3B5;&#x3C2;, &#x3C4;&#x3C5;&#x3BB;&#x3B9;&#x3B3;&#x3BC;&#x3AD;&#x3BD;&#x3B5;&#x3C2; &#x3C0;&#x3B1;&#x3C1;&#x3AC;&#x3BB;&#x3BB;&#x3B7;&#x3BB;&#x3B1; &#x3C3;&#x3B5; &#x3AD;&#x3BD;&#x3B1; &#x3BC;&#x3BF;&#x3BD;&#x3C4;&#x3AD;&#x3C1;&#x3BD;&#x3BF; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3CC;.</Description><Price>49.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/u/s/us_sleeve_top02b_1.jpg</Image></product><product><SKU>BL-US-LS-02-RU</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Laptop Sleeve - Rust 15"</Name><Description>&#x3A0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3AD;&#x3C8;&#x3C4;&#x3B5; &#x3C4;&#x3BF; Macbook Pro &#x3BA;&#x3B1;&#x3B9; Macbook Air &#x3C3;&#x3B1;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3AD;&#x3C7;&#x3B5;&#x3C4;&#x3B5; &#x3C4;&#x3BF; &#x3BA;&#x3B5;&#x3C6;&#x3AC;&#x3BB;&#x3B9; &#x3C3;&#x3B1;&#x3C2; &#x3AE;&#x3C3;&#x3C5;&#x3C7;&#x3BF;. &#x395;&#x3C6;&#x3B1;&#x3C1;&#x3BC;&#x3CC;&#x3B6;&#x3B5;&#x3B9; &#x3BA;&#x3B1;&#x3BB;&#x3AC; &#x3C7;&#x3C9;&#x3C1;&#x3AF;&#x3C2; &#x3BD;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3B8;&#x3AD;&#x3C4;&#x3B5;&#x3B9; &#x3CC;&#x3B3;&#x3BA;&#x3BF; &#x3AE; &#x3B2;&#x3AC;&#x3C1;&#x3BF;&#x3C2;, &#x3BA;&#x3B1;&#x3B9; &#x3B4;&#x3B7;&#x3BC;&#x3B9;&#x3BF;&#x3C5;&#x3C1;&#x3B3;&#x3B5;&#x3AF; &#x3BC;&#x3AF;&#x3B1; &#x3BA;&#x3BF;&#x3BC;&#x3C8;&#x3AE; &#x3B5;&#x3C0;&#x3B1;&#x3B3;&#x3B3;&#x3B5;&#x3BB;&#x3BC;&#x3B1;&#x3C4;&#x3B9;&#x3BA;&#x3AE; &#x3B5;&#x3BC;&#x3C6;&#x3AC;&#x3BD;&#x3B9;&#x3C3;&#x3B7;. &#x3A4;&#x3BF; Sleeve &#x3BA;&#x3BB;&#x3B5;&#x3AF;&#x3BD;&#x3B5;&#x3B9; &#x3BC;&#x3B5; &#x3BC;&#x3B1;&#x3B3;&#x3BD;&#x3B7;&#x3C4;&#x3B9;&#x3BA;&#x3AC; snaps &#x3BA;&#x3B1;&#x3B9; &#x3C3;&#x3C4;&#x3B5;&#x3C1;&#x3B5;&#x3CE;&#x3BD;&#x3B5;&#x3C4;&#x3B1;&#x3B9; &#x3C0;&#x3B5;&#x3C1;&#x3B1;&#x3B9;&#x3C4;&#x3AD;&#x3C1;&#x3C9; &#x3BC;&#x3B5; &#x3C4;&#x3B7;&#x3BD; &#x3B1;&#x3B3;&#x3BA;&#x3C1;&#x3AC;&#x3C6;&#x3B1; &#x3B1;&#x3BB;&#x3BF;&#x3C5;&#x3BC;&#x3B9;&#x3BD;&#x3AF;&#x3BF;&#x3C5; &#x3B1;&#x3C0;&#x3CC; &#x3BC;&#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3AC;.&#xD;
A&#x3BD;&#x3B8;&#x3B5;&#x3BA;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3C7;&#x3B1;&#x3C1;&#x3B1;&#x3BA;&#x3C4;&#x3B7;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3BF;&#x3CD;&#x3BD; &#x3C4;&#x3B9;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3C3;&#x3B1;&#x3C2; &#x3B1;&#x3C3;&#x3C6;&#x3B1;&#x3BB;&#x3B5;&#x3AF;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3C5;&#x3BC;&#x3AD;&#x3BD;&#x3B5;&#x3C2;, &#x3C4;&#x3C5;&#x3BB;&#x3B9;&#x3B3;&#x3BC;&#x3AD;&#x3BD;&#x3B5;&#x3C2; &#x3C0;&#x3B1;&#x3C1;&#x3AC;&#x3BB;&#x3BB;&#x3B7;&#x3BB;&#x3B1; &#x3C3;&#x3B5; &#x3AD;&#x3BD;&#x3B1; &#x3BC;&#x3BF;&#x3BD;&#x3C4;&#x3AD;&#x3C1;&#x3BD;&#x3BF; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3CC;.</Description><Price>54.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/u/s/us_sleeve_top02b.jpg</Image></product><product><SKU>BL-US-LS-02-BK</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Laptop Sleeve - Black 15"</Name><Description>&#x3A0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3AD;&#x3C8;&#x3C4;&#x3B5; &#x3C4;&#x3BF; Macbook Pro &#x3BA;&#x3B1;&#x3B9; Macbook Air &#x3C3;&#x3B1;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3AD;&#x3C7;&#x3B5;&#x3C4;&#x3B5; &#x3C4;&#x3BF; &#x3BA;&#x3B5;&#x3C6;&#x3AC;&#x3BB;&#x3B9; &#x3C3;&#x3B1;&#x3C2; &#x3AE;&#x3C3;&#x3C5;&#x3C7;&#x3BF;. &#x395;&#x3C6;&#x3B1;&#x3C1;&#x3BC;&#x3CC;&#x3B6;&#x3B5;&#x3B9; &#x3BA;&#x3B1;&#x3BB;&#x3AC; &#x3C7;&#x3C9;&#x3C1;&#x3AF;&#x3C2; &#x3BD;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3B8;&#x3AD;&#x3C4;&#x3B5;&#x3B9; &#x3CC;&#x3B3;&#x3BA;&#x3BF; &#x3AE; &#x3B2;&#x3AC;&#x3C1;&#x3BF;&#x3C2;, &#x3BA;&#x3B1;&#x3B9; &#x3B4;&#x3B7;&#x3BC;&#x3B9;&#x3BF;&#x3C5;&#x3C1;&#x3B3;&#x3B5;&#x3AF; &#x3BC;&#x3AF;&#x3B1; &#x3BA;&#x3BF;&#x3BC;&#x3C8;&#x3AE; &#x3B5;&#x3C0;&#x3B1;&#x3B3;&#x3B3;&#x3B5;&#x3BB;&#x3BC;&#x3B1;&#x3C4;&#x3B9;&#x3BA;&#x3AE; &#x3B5;&#x3BC;&#x3C6;&#x3AC;&#x3BD;&#x3B9;&#x3C3;&#x3B7;. &#x3A4;&#x3BF; Sleeve &#x3BA;&#x3BB;&#x3B5;&#x3AF;&#x3BD;&#x3B5;&#x3B9; &#x3BC;&#x3B5; &#x3BC;&#x3B1;&#x3B3;&#x3BD;&#x3B7;&#x3C4;&#x3B9;&#x3BA;&#x3AC; snaps &#x3BA;&#x3B1;&#x3B9; &#x3C3;&#x3C4;&#x3B5;&#x3C1;&#x3B5;&#x3CE;&#x3BD;&#x3B5;&#x3C4;&#x3B1;&#x3B9; &#x3C0;&#x3B5;&#x3C1;&#x3B1;&#x3B9;&#x3C4;&#x3AD;&#x3C1;&#x3C9; &#x3BC;&#x3B5; &#x3C4;&#x3B7;&#x3BD; &#x3B1;&#x3B3;&#x3BA;&#x3C1;&#x3AC;&#x3C6;&#x3B1; &#x3B1;&#x3BB;&#x3BF;&#x3C5;&#x3BC;&#x3B9;&#x3BD;&#x3AF;&#x3BF;&#x3C5; &#x3B1;&#x3C0;&#x3CC; &#x3BC;&#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3AC;.&#xD;
A&#x3BD;&#x3B8;&#x3B5;&#x3BA;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3C7;&#x3B1;&#x3C1;&#x3B1;&#x3BA;&#x3C4;&#x3B7;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3BF;&#x3CD;&#x3BD; &#x3C4;&#x3B9;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3C3;&#x3B1;&#x3C2; &#x3B1;&#x3C3;&#x3C6;&#x3B1;&#x3BB;&#x3B5;&#x3AF;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3C5;&#x3BC;&#x3AD;&#x3BD;&#x3B5;&#x3C2;, &#x3C4;&#x3C5;&#x3BB;&#x3B9;&#x3B3;&#x3BC;&#x3AD;&#x3BD;&#x3B5;&#x3C2; &#x3C0;&#x3B1;&#x3C1;&#x3AC;&#x3BB;&#x3BB;&#x3B7;&#x3BB;&#x3B1; &#x3C3;&#x3B5; &#x3AD;&#x3BD;&#x3B1; &#x3BC;&#x3BF;&#x3BD;&#x3C4;&#x3AD;&#x3C1;&#x3BD;&#x3BF; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3CC;.</Description><Price>54.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/u/s/us_sleeve_top01_1.jpg</Image></product><product><SKU>BL-US-LS-01-BK</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Laptop Sleeve - Black 17"</Name><Description>&#x3A0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3AD;&#x3C8;&#x3C4;&#x3B5; &#x3C4;&#x3BF; Macbook Pro &#x3BA;&#x3B1;&#x3B9; Macbook Air &#x3C3;&#x3B1;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3AD;&#x3C7;&#x3B5;&#x3C4;&#x3B5; &#x3C4;&#x3BF; &#x3BA;&#x3B5;&#x3C6;&#x3AC;&#x3BB;&#x3B9; &#x3C3;&#x3B1;&#x3C2; &#x3AE;&#x3C3;&#x3C5;&#x3C7;&#x3BF;. &#x395;&#x3C6;&#x3B1;&#x3C1;&#x3BC;&#x3CC;&#x3B6;&#x3B5;&#x3B9; &#x3BA;&#x3B1;&#x3BB;&#x3AC; &#x3C7;&#x3C9;&#x3C1;&#x3AF;&#x3C2; &#x3BD;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3B8;&#x3AD;&#x3C4;&#x3B5;&#x3B9; &#x3CC;&#x3B3;&#x3BA;&#x3BF; &#x3AE; &#x3B2;&#x3AC;&#x3C1;&#x3BF;&#x3C2;, &#x3BA;&#x3B1;&#x3B9; &#x3B4;&#x3B7;&#x3BC;&#x3B9;&#x3BF;&#x3C5;&#x3C1;&#x3B3;&#x3B5;&#x3AF; &#x3BC;&#x3AF;&#x3B1; &#x3BA;&#x3BF;&#x3BC;&#x3C8;&#x3AE; &#x3B5;&#x3C0;&#x3B1;&#x3B3;&#x3B3;&#x3B5;&#x3BB;&#x3BC;&#x3B1;&#x3C4;&#x3B9;&#x3BA;&#x3AE; &#x3B5;&#x3BC;&#x3C6;&#x3AC;&#x3BD;&#x3B9;&#x3C3;&#x3B7;. &#x3A4;&#x3BF; Sleeve &#x3BA;&#x3BB;&#x3B5;&#x3AF;&#x3BD;&#x3B5;&#x3B9; &#x3BC;&#x3B5; &#x3BC;&#x3B1;&#x3B3;&#x3BD;&#x3B7;&#x3C4;&#x3B9;&#x3BA;&#x3AC; snaps &#x3BA;&#x3B1;&#x3B9; &#x3C3;&#x3C4;&#x3B5;&#x3C1;&#x3B5;&#x3CE;&#x3BD;&#x3B5;&#x3C4;&#x3B1;&#x3B9; &#x3C0;&#x3B5;&#x3C1;&#x3B1;&#x3B9;&#x3C4;&#x3AD;&#x3C1;&#x3C9; &#x3BC;&#x3B5; &#x3C4;&#x3B7;&#x3BD; &#x3B1;&#x3B3;&#x3BA;&#x3C1;&#x3AC;&#x3C6;&#x3B1; &#x3B1;&#x3BB;&#x3BF;&#x3C5;&#x3BC;&#x3B9;&#x3BD;&#x3AF;&#x3BF;&#x3C5; &#x3B1;&#x3C0;&#x3CC; &#x3BC;&#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3AC;.&#xD;
A&#x3BD;&#x3B8;&#x3B5;&#x3BA;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3C7;&#x3B1;&#x3C1;&#x3B1;&#x3BA;&#x3C4;&#x3B7;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3BF;&#x3CD;&#x3BD; &#x3C4;&#x3B9;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3C3;&#x3B1;&#x3C2; &#x3B1;&#x3C3;&#x3C6;&#x3B1;&#x3BB;&#x3B5;&#x3AF;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3C5;&#x3BC;&#x3AD;&#x3BD;&#x3B5;&#x3C2;, &#x3C4;&#x3C5;&#x3BB;&#x3B9;&#x3B3;&#x3BC;&#x3AD;&#x3BD;&#x3B5;&#x3C2; &#x3C0;&#x3B1;&#x3C1;&#x3AC;&#x3BB;&#x3BB;&#x3B7;&#x3BB;&#x3B1; &#x3C3;&#x3B5; &#x3AD;&#x3BD;&#x3B1; &#x3BC;&#x3BF;&#x3BD;&#x3C4;&#x3AD;&#x3C1;&#x3BD;&#x3BF; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3CC;.</Description><Price>59.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/u/s/us_sleeve_top01.jpg</Image></product><product><SKU>BL-US-BT-LRG</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - Laptop Tote - Large</Name><Description>Carry your laptop and daily gear fashionably with your laptop in it own special compartment and enough space for all your other gear.</Description><Price>149</Price><Image>http://www.gricgroup.gr/media/catalog/product/u/s/us_backpack_top03_1.jpg</Image></product><product><SKU>BL - JM-USB-01</SKU><Manufacturer>bluelounge</Manufacturer><Name>BlueLounge - JIMI </Name><Description>&#x388;&#x3BD;&#x3B1; J &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3BF; iMac &#x3C3;&#x3B1;&#x3C2;, &#x3A4;&#x3BF; &#x3A4;&#x3B6;&#x3AF;&#x3BC;&#x3B9; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3AF;&#x3B1; &#x3B5;&#x3C0;&#x3AD;&#x3BA;&#x3C4;&#x3B1;&#x3C3;&#x3B7; USB &#x3C3;&#x3B5; &#x3C3;&#x3C7;&#x3AE;&#x3BC;&#x3B1;  "J", &#x3C0;&#x3BF;&#x3C5; &#x3B5;&#x3BE;&#x3B1;&#x3BB;&#x3B5;&#x3AF;&#x3C6;&#x3B5;&#x3B9; &#x3C4;&#x3B7;&#x3BD; &#x3B1;&#x3BD;&#x3AC;&#x3B3;&#x3BA;&#x3B7; &#x3BD;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C0;&#x3B1;&#x3B8;&#x3B5;&#x3AF;&#x3C4;&#x3B5; &#x3BA;&#x3AC;&#x3B8;&#x3B5; &#x3C6;&#x3BF;&#x3C1;&#x3AC; &#x3BD;&#x3B1; &#x3C3;&#x3C5;&#x3BD;&#x3B4;&#x3AD;&#x3C3;&#x3B5;&#x3C4;&#x3B5; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B1;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3B5;&#x3BE;&#x3C9;&#x3C4;&#x3B5;&#x3C1;&#x3B9;&#x3BA;&#x3AE; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE; &#x3BC;&#x3B5; &#x3C4;&#x3BF; &#x3C0;&#x3AF;&#x3C3;&#x3C9; &#x3BC;&#x3AD;&#x3C1;&#x3BF;&#x3C2; &#x3C4;&#x3BF;&#x3C5; iMac &#x3C3;&#x3B1;&#x3C2; &#x3BC;&#x3AD;&#x3C3;&#x3C9; USB. &#x391;&#x3C0;&#x3BB;&#x3AC; &#x3C3;&#x3C5;&#x3BD;&#x3B4;&#x3AD;&#x3C3;&#x3C4;&#x3B5; &#x3C4;&#x3BF; Jimi &#x3C3;&#x3C4;&#x3B7; &#x3B8;&#x3CD;&#x3C1;&#x3B1; USB &#x3C3;&#x3C4;&#x3BF; &#x3C0;&#x3AF;&#x3C3;&#x3C9; &#x3BC;&#x3AD;&#x3C1;&#x3BF;&#x3C2; &#x3C4;&#x3BF;&#x3C5; iMac &#x3C3;&#x3B1;&#x3C2;, &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3C6;&#x3AE;&#x3C3;&#x3C4;&#x3B5; &#x3C4;&#x3BF; &#x3BD;&#x3B1; &#x3B5;&#x3C0;&#x3B5;&#x3BA;&#x3C4;&#x3B5;&#x3AF;&#x3BD;&#x3B5;&#x3B9; &#x3C4;&#x3B7; &#x3B8;&#x3CD;&#x3C1;&#x3B1; USB  &#x3C4;&#x3BF;&#x3C5; &#x3C5;&#x3C0;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B9;&#x3C3;&#x3C4;&#x3AE; &#x3C3;&#x3B1;&#x3C2;  &#x3BA;&#x3B1;&#x3C4;&#x3AC; &#x3BC;&#x3AE;&#x3BA;&#x3BF;&#x3C2; &#x3C4;&#x3BF;&#x3C5; &#x3BA;&#x3AC;&#x3C4;&#x3C9; &#x3AC;&#x3BA;&#x3C1;&#x3BF;&#x3C5; &#x3C4;&#x3BF;&#x3C5;. &#x3A3;&#x3C5;&#x3BD;&#x3B4;&#x3AD;&#x3C3;&#x3C4;&#x3B5; &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3C0;&#x3BF;&#x3C3;&#x3C5;&#x3BD;&#x3B4;&#x3AD;&#x3C3;&#x3C4;&#x3B5; &#x3C4;&#x3B9;&#x3C2; &#x3C5;&#x3C0;&#x3BF;&#x3B4;&#x3BF;&#x3C7;&#x3AD;&#x3C2; USB &#x3C3;&#x3B1;&#x3C2; &#x3BC;&#x3B5; &#x3B5;&#x3C5;&#x3BA;&#x3BF;&#x3BB;&#x3AF;&#x3B1;. &#x3A4;&#x3BF; Jimi &#x3AD;&#x3C7;&#x3B5;&#x3B9; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3C4;&#x3B5;&#x3AF; &#x3B1;&#x3C0;&#x3BF;&#x3BA;&#x3BB;&#x3B5;&#x3B9;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3BF; iMac Slim Aluminium Unibody (&#x3C0;&#x3BF;&#x3C5; &#x3BA;&#x3C5;&#x3BA;&#x3BB;&#x3BF;&#x3C6;&#x3CC;&#x3C1;&#x3B7;&#x3C3;&#x3B5; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3BF; &#x39D;&#x3BF;&#x3AD;&#x3BC;&#x3B2;&#x3C1;&#x3B9;&#x3BF; 2012 &#x3AE; &#x3B1;&#x3C1;&#x3B3;&#x3CC;&#x3C4;&#x3B5;&#x3C1;&#x3B1;).</Description><Price>16.95</Price><Image>http://www.gricgroup.gr/media/catalog/product/j/m/jm_03_1.jpg</Image></product></xml>
