<?xml version="1.0"?>
<xml><product><SKU>ZAGG-FOAM</SKU><Manufacturer>zagg</Manufacturer><Name>ZAGG - Foam Gadget Cleaning Kit (w/ pump spray)</Name><Description>&#x3A4;&#x3BF; &#x3C3;&#x3B5;&#x3C4; &#x3BA;&#x3B1;&#x3B8;&#x3B1;&#x3C1;&#x3B9;&#x3C3;&#x3BC;&#x3BF;&#x3CD; ZAGGfoam &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3AD;&#x3BD;&#x3B1; &#x3B9;&#x3C3;&#x3C7;&#x3C5;&#x3C1;&#x3CC; &#x3B1;&#x3BD;&#x3C4;&#x3B9;&#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3BF;&#x3B2;&#x3B9;&#x3B1;&#x3BA;&#x3CC; &#x3BA;&#x3B1;&#x3B8;&#x3B1;&#x3C1;&#x3B9;&#x3C3;&#x3BC;&#x3BF;&#x3CD; &#x3C0;&#x3BF;&#x3C5; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AC; &#x3C4;&#x3B9;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3C3;&#x3B1;&#x3C2; &#x3C0;&#x3B5;&#x3BD;&#x3C4;&#x3B1;&#x3BA;&#x3AC;&#x3B8;&#x3B1;&#x3C1;&#x3B5;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3B1; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC;&#x3B2;&#x3B9;&#x3B1; &#x3BC;&#x3B1;&#x3BA;&#x3C1;&#x3C5;&#x3AC;. &#x397; &#x3B2;&#x3BF;&#x3BB;&#x3B9;&#x3BA;&#x3AE; &#x3B1;&#x3BD;&#x3C4;&#x3BB;&#x3AF;&#x3B1; &#x3B1;&#x3C0;&#x3B5;&#x3BB;&#x3B5;&#x3C5;&#x3B8;&#x3B5;&#x3C1;&#x3CE;&#x3BD;&#x3B5;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x3B9;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3AE; &#x3C0;&#x3BF;&#x3C3;&#x3CC;&#x3C4;&#x3B7;&#x3C4;&#x3B1; &#x3C4;&#x3BF;&#x3C5; &#x3B4;&#x3B9;&#x3B1;&#x3BB;&#x3CD;&#x3BC;&#x3B1;&#x3C4;&#x3BF;&#x3C2; &#x3BA;&#x3B1;&#x3B8;&#x3B1;&#x3C1;&#x3B9;&#x3C3;&#x3BC;&#x3BF;&#x3CD;, &#x3BA;&#x3B1;&#x3B9; &#x3BC;&#x3B5; &#x3C4;&#x3BF; &#x3C0;&#x3B1;&#x3C1;&#x3B5;&#x3C7;&#x3CC;&#x3BC;&#x3B5;&#x3BD;&#x3BF; &#x3C0;&#x3B1;&#x3BD;&#x3AF; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3BF;&#x3CA;&#x3BD;&#x3CE;&#x3BD;, &#x3BC;&#x3C0;&#x3BF;&#x3C1;&#x3B5;&#x3AF;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3BA;&#x3B1;&#x3B8;&#x3B1;&#x3C1;&#x3AF;&#x3C3;&#x3B5;&#x3C4;&#x3B5; &#x3C4;&#x3B1; gadgets &#x3C3;&#x3B1;&#x3C2; &#x3C0;&#x3AC;&#x3BD;&#x3C9; &#x3B1;&#x3C0;&#x3CC; 200 &#x3C6;&#x3BF;&#x3C1;&#x3AD;&#x3C2; &#x3BC;&#x3B5; &#x3BA;&#x3AC;&#x3B8;&#x3B5; &#x3C6;&#x3B9;&#x3AC;&#x3BB;&#x3B7;.</Description><Price>9.99</Price><Image>http://www.gricgroup.gr/media/catalog/product/z/3/z34zaggfoam.png</Image></product><product><SKU>ZA-INVSH</SKU><Manufacturer>zagg</Manufacturer><Name>ZAGG - Mobile Phone InvisibleSHIELD Screen - iPhone 5/5s</Name><Description>&#x397; &#x3B1;&#x3CC;&#x3C1;&#x3B1;&#x3C4;&#x3B7; &#x3B1;&#x3C3;&#x3C0;&#x3AF;&#x3B4;&#x3B1; &#xAE; &#x3C0;&#x3BF;&#x3C5; &#x3C0;&#x3C1;&#x3BF;&#x3C6;&#x3C5;&#x3BB;&#x3AC;&#x3C3;&#x3C3;&#x3B5;&#x3B9; &#x3C4;&#x3B9;&#x3C2; &#x3C0;&#x3BF;&#x3BB;&#x3CD;&#x3C4;&#x3B9;&#x3BC;&#x3B5;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3C3;&#x3B1;&#x3C2; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3CC;&#x3BD;&#x3BF; ZAGG &#xAE;, &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3B1;&#x3C1;&#x3BC;&#x3BF;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3C3;&#x3C4;&#x3B9;&#x3C2; &#x3B1;&#x3BD;&#x3AC;&#x3B3;&#x3BA;&#x3B5;&#x3C2; &#x3C4;&#x3BF;&#x3C5; &#x3C0;&#x3B5;&#x3BB;&#x3AC;&#x3C4;&#x3B7;, &#x3BA;&#x3B1;&#x3C4;&#x3BF;&#x3C7;&#x3C5;&#x3C1;&#x3C9;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3BC;&#x3B5; &#x3B4;&#x3AF;&#x3C0;&#x3BB;&#x3C9;&#x3BC;&#x3B1; &#x3B5;&#x3C5;&#x3C1;&#x3B5;&#x3C3;&#x3B9;&#x3C4;&#x3B5;&#x3C7;&#x3BD;&#x3AF;&#x3B1;&#x3C2;, &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B7; &#x3BD;&#x3B1;&#x3C5;&#x3B1;&#x3C1;&#x3C7;&#x3AF;&#x3B4;&#x3B1; &#x3C4;&#x3C9;&#x3BD; &#x3C0;&#x3C1;&#x3BF;&#x3CA;&#x3CC;&#x3BD;&#x3C4;&#x3C9;&#x3BD; &#x3C0;&#x3BF;&#x3C5; &#x3C6;&#x3C5;&#x3BB;&#x3AC;&#x3BD;&#x3B5; &#x3C4;&#x3B1; &#x3B7;&#x3BB;&#x3B5;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BD;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3B1;&#x3C2; &#x3B5;&#x3AF;&#x3B4;&#x3B7; &#x3B5;&#x3C5;&#x3C1;&#x3B5;&#x3AF;&#x3B1;&#x3C2; &#x3BA;&#x3B1;&#x3C4;&#x3B1;&#x3BD;&#x3AC;&#x3BB;&#x3C9;&#x3C3;&#x3B7;&#x3C2;, &#x3C0;&#x3B1;&#x3C1;&#x3AD;&#x3C7;&#x3BF;&#x3BD;&#x3C4;&#x3B1;&#x3C2; &#x3B1;&#x3C0;&#x3B1;&#x3C1;&#x3AC;&#x3BC;&#x3B9;&#x3BB;&#x3BB;&#x3B7; &#x3B1;&#x3BD;&#x3C4;&#x3BF;&#x3C7;&#x3AE; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3C4;&#x3C1;&#x3B9;&#x3B2;&#x3AE;. &#x395;&#x3B9;&#x3B4;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3C7;&#x3B9;&#x3BB;&#x3B9;&#x3AC;&#x3B4;&#x3B5;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2;, &#x3CC;&#x3C0;&#x3C9;&#x3C2; &#x3BA;&#x3B9;&#x3BD;&#x3B7;&#x3C4;&#x3AC; &#x3C4;&#x3B7;&#x3BB;&#x3AD;&#x3C6;&#x3C9;&#x3BD;&#x3B1;, &#x3C4;&#x3B1;&#x3BC;&#x3C0;&#x3BB;&#x3AD;&#x3C4;&#x3B5;&#x3C2;, &#x3C8;&#x3B7;&#x3C6;&#x3B9;&#x3B1;&#x3BA;&#x3AD;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3B1;&#x3BD;&#x3B1;&#x3C0;&#x3B1;&#x3C1;&#x3B1;&#x3B3;&#x3C9;&#x3B3;&#x3AE;&#x3C2; &#x3C0;&#x3BF;&#x3BB;&#x3C5;&#x3BC;&#x3AD;&#x3C3;&#x3C9;&#x3BD; &#x3BA;&#x3B1;&#x3B9; &#x3C6;&#x3BF;&#x3C1;&#x3B7;&#x3C4;&#x3BF;&#x3CD;&#x3C2; &#x3C5;&#x3C0;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B9;&#x3C3;&#x3C4;&#x3AD;&#x3C2;, &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C4;&#x3BF; &#x3BD;&#x3BF;&#x3CD;&#x3BC;&#x3B5;&#x3C1;&#x3BF; 1 &#x3C0;&#x3C1;&#x3BF;&#x3CA;&#x3CC;&#x3BD; &#x3C0;&#x3CE;&#x3BB;&#x3B7;&#x3C3;&#x3B7;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C3;&#x3AF;&#x3B1; &#x3C4;&#x3B7;&#x3C2; &#x3BF;&#x3B8;&#x3CC;&#x3BD;&#x3B7;&#x3C2;.</Description><Price>14.99</Price><Image>http://www.gricgroup.gr/media/catalog/product/i/s/is-iphone-5c.jpg</Image></product><product><SKU>ZA-INVSH-OR</SKU><Manufacturer>zagg</Manufacturer><Name>ZAGG - Mobile Phone InvisibleSHIELD Screen - iPhone 5/5s - Original</Name><Description>&#x397; "&#x3B1;&#x3CC;&#x3C1;&#x3B1;&#x3C4;&#x3B7; &#x3B1;&#x3C3;&#x3C0;&#x3AF;&#x3B4;&#x3B1;" Invisible Shield &#xAE; &#x3C0;&#x3BF;&#x3C5; &#x3C0;&#x3C1;&#x3BF;&#x3C6;&#x3C5;&#x3BB;&#x3AC;&#x3C3;&#x3C3;&#x3B5;&#x3B9; &#x3C4;&#x3B9;&#x3C2; &#x3C0;&#x3BF;&#x3BB;&#x3CD;&#x3C4;&#x3B9;&#x3BC;&#x3B5;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3C3;&#x3B1;&#x3C2; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3CC;&#x3BD;&#x3BF; ZAGG &#xAE;, &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3B1;&#x3C1;&#x3BC;&#x3BF;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3C3;&#x3C4;&#x3B9;&#x3C2; &#x3B1;&#x3BD;&#x3AC;&#x3B3;&#x3BA;&#x3B5;&#x3C2; &#x3C4;&#x3BF;&#x3C5; &#x3C0;&#x3B5;&#x3BB;&#x3AC;&#x3C4;&#x3B7;, &#x3BA;&#x3B1;&#x3C4;&#x3BF;&#x3C7;&#x3C5;&#x3C1;&#x3C9;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3BC;&#x3B5; &#x3B4;&#x3AF;&#x3C0;&#x3BB;&#x3C9;&#x3BC;&#x3B1; &#x3B5;&#x3C5;&#x3C1;&#x3B5;&#x3C3;&#x3B9;&#x3C4;&#x3B5;&#x3C7;&#x3BD;&#x3AF;&#x3B1;&#x3C2;, &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B7; &#x3BD;&#x3B1;&#x3C5;&#x3B1;&#x3C1;&#x3C7;&#x3AF;&#x3B4;&#x3B1; &#x3C4;&#x3C9;&#x3BD; &#x3C0;&#x3C1;&#x3BF;&#x3CA;&#x3CC;&#x3BD;&#x3C4;&#x3C9;&#x3BD; &#x3C0;&#x3BF;&#x3C5; &#x3C6;&#x3C5;&#x3BB;&#x3AC;&#x3BD;&#x3B5; &#x3C4;&#x3B1; &#x3B7;&#x3BB;&#x3B5;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BD;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3B1;&#x3C2; &#x3B5;&#x3AF;&#x3B4;&#x3B7; &#x3B5;&#x3C5;&#x3C1;&#x3B5;&#x3AF;&#x3B1;&#x3C2; &#x3BA;&#x3B1;&#x3C4;&#x3B1;&#x3BD;&#x3AC;&#x3BB;&#x3C9;&#x3C3;&#x3B7;&#x3C2;, &#x3C0;&#x3B1;&#x3C1;&#x3AD;&#x3C7;&#x3BF;&#x3BD;&#x3C4;&#x3B1;&#x3C2; &#x3B1;&#x3C0;&#x3B1;&#x3C1;&#x3AC;&#x3BC;&#x3B9;&#x3BB;&#x3BB;&#x3B7; &#x3B1;&#x3BD;&#x3C4;&#x3BF;&#x3C7;&#x3AE; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3C4;&#x3C1;&#x3B9;&#x3B2;&#x3AE;. &#x395;&#x3B9;&#x3B4;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3C7;&#x3B9;&#x3BB;&#x3B9;&#x3AC;&#x3B4;&#x3B5;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2;, &#x3CC;&#x3C0;&#x3C9;&#x3C2; &#x3BA;&#x3B9;&#x3BD;&#x3B7;&#x3C4;&#x3AC; &#x3C4;&#x3B7;&#x3BB;&#x3AD;&#x3C6;&#x3C9;&#x3BD;&#x3B1;, &#x3C4;&#x3B1;&#x3BC;&#x3C0;&#x3BB;&#x3AD;&#x3C4;&#x3B5;&#x3C2;, &#x3C8;&#x3B7;&#x3C6;&#x3B9;&#x3B1;&#x3BA;&#x3AD;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3B1;&#x3BD;&#x3B1;&#x3C0;&#x3B1;&#x3C1;&#x3B1;&#x3B3;&#x3C9;&#x3B3;&#x3AE;&#x3C2; &#x3C0;&#x3BF;&#x3BB;&#x3C5;&#x3BC;&#x3AD;&#x3C3;&#x3C9;&#x3BD; &#x3BA;&#x3B1;&#x3B9; &#x3C6;&#x3BF;&#x3C1;&#x3B7;&#x3C4;&#x3BF;&#x3CD;&#x3C2; &#x3C5;&#x3C0;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B9;&#x3C3;&#x3C4;&#x3AD;&#x3C2;, &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C4;&#x3BF; &#x3BD;&#x3BF;&#x3CD;&#x3BC;&#x3B5;&#x3C1;&#x3BF; 1 &#x3C0;&#x3C1;&#x3BF;&#x3CA;&#x3CC;&#x3BD; &#x3C0;&#x3CE;&#x3BB;&#x3B7;&#x3C3;&#x3B7;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C3;&#x3AF;&#x3B1; &#x3C4;&#x3B7;&#x3C2; &#x3BF;&#x3B8;&#x3CC;&#x3BD;&#x3B7;&#x3C2;.</Description><Price>14.99</Price><Image>http://www.gricgroup.gr/media/catalog/product/a/p/apple-iphone_5_screen_whitebg.jpg</Image></product><product><SKU>ZA-INVSH-HD</SKU><Manufacturer>zagg</Manufacturer><Name>ZAGG - Mobile Phone InvisibleSHIELD Screen - iPhone 5/5s - HD</Name><Description>&#x395;&#x3BE;&#x3B1;&#x3B9;&#x3C1;&#x3B5;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3B1;&#x3C6;&#x3AE;&#x3C2;, &#x3B1;&#x3C0;&#x3AF;&#x3C3;&#x3C4;&#x3B5;&#x3C5;&#x3C4;&#x3B1; &#x3BB;&#x3B5;&#x3C0;&#x3C4;&#x3AE;, &#x3BA;&#x3B1;&#x3B9; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3CC;&#x3BD; &#x3AC;&#x3C6;&#x3B8;&#x3B1;&#x3C1;&#x3C4;&#x3B7;, &#x3B7; ZAGG &#xAE; High-Definition &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B7; &#x3BC;&#x3B5;&#x3BC;&#x3B2;&#x3C1;&#x3AC;&#x3BD;&#x3B7; &#x3B7; &#x3BF;&#x3C0;&#x3BF;&#x3AF;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C6;&#x3AD;&#x3C1;&#x3B5;&#x3B9; premium &#x3C7;&#x3B1;&#x3C1;&#x3B1;&#x3BA;&#x3C4;&#x3B7;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC;, &#x3CC;&#x3C0;&#x3C9;&#x3C2; &#x3C0;&#x3C1;&#x3BF;&#x3B7;&#x3B3;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3C3;&#x3B1;&#x3C6;&#x3AE;&#x3BD;&#x3B5;&#x3B9;&#x3B1; &#x3BA;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x3B3;&#x3C5;&#x3AC;&#x3BB;&#x3B9;&#x3BD;&#x3B7; &#x3B5;&#x3C0;&#x3B9;&#x3C6;&#x3AC;&#x3BD;&#x3B5;&#x3B9;&#x3B1; &#x3C0;&#x3BF;&#x3C5; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C6;&#x3C4;&#x3B9;&#x3B1;&#x3B3;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3C4;&#x3BF;&#x3BD;&#x3AF;&#x3C3;&#x3B5;&#x3B9; &#x3C4;&#x3B9;&#x3C2; &#x3B5;&#x3C5;&#x3BA;&#x3C1;&#x3B9;&#x3BD;&#x3B5;&#x3AF;&#x3C2; &#x3B5;&#x3B9;&#x3BA;&#x3CC;&#x3BD;&#x3B5;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3B1; &#x3AD;&#x3BD;&#x3C4;&#x3BF;&#x3BD;&#x3B1; &#x3C7;&#x3C1;&#x3CE;&#x3BC;&#x3B1;&#x3C4;&#x3B1; &#x3C3;&#x3C4;&#x3B1; &#x3C0;&#x3B9;&#x3BF; &#x3C3;&#x3CD;&#x3B3;&#x3C7;&#x3C1;&#x3BF;&#x3BD;&#x3B1; gadget &#x3C0;&#x3C1;&#x3BF;&#x3B7;&#x3B3;&#x3BC;&#x3AD;&#x3BD;&#x3B7;&#x3C2; &#x3C4;&#x3B5;&#x3C7;&#x3BD;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3AF;&#x3B1;&#x3C2;. &#x3A4;&#x3BF; &#x399;nvisibleSHIELD &#xAE; HIGH DEFINITION, &#x3C0;&#x3BF;&#x3C5; &#x3B4;&#x3B7;&#x3BC;&#x3B9;&#x3BF;&#x3C5;&#x3C1;&#x3B3;&#x3AE;&#x3B8;&#x3B7;&#x3BA;&#x3B5; &#x3B1;&#x3C0;&#x3CC; &#x3BC;&#x3B9;&#x3B1; &#x3C4;&#x3B1;&#x3B9;&#x3BD;&#x3AF;&#x3B1; &#x3B1;&#x3C0;&#x3BF;&#x3BA;&#x3BB;&#x3B5;&#x3B9;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3BD; ZAGG, &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B7; &#x3C4;&#x3AD;&#x3BB;&#x3B5;&#x3B9;&#x3B1; &#x3B5;&#x3C0;&#x3B9;&#x3BB;&#x3BF;&#x3B3;&#x3AE; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C3;&#x3AF;&#x3B1; &#x3C4;&#x3B7;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE;&#x3C2; &#x3C3;&#x3B1;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C4;&#x3BF; &#x3BD;&#x3BF;&#x3CD;&#x3BC;&#x3B5;&#x3C1;&#x3BF; 1 &#x3C0;&#x3C1;&#x3BF;&#x3CA;&#x3CC;&#x3BD; &#x3C0;&#x3CE;&#x3BB;&#x3B7;&#x3C3;&#x3B7;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C3;&#x3AF;&#x3B1; &#x3C4;&#x3B7;&#x3C2; &#x3BF;&#x3B8;&#x3CC;&#x3BD;&#x3B7;&#x3C2;.</Description><Price>19.99</Price><Image>http://www.gricgroup.gr/media/catalog/product/a/p/apple-iphone_5_screen_1.jpg</Image></product><product><SKU>ZA-INVSH-EX</SKU><Manufacturer>zagg</Manufacturer><Name>ZAGG - Mobile Phone InvisibleSHIELD Screen - iPhone 5/5s - Extreme</Name><Description>&#x3A3;&#x3C5;&#x3BD;&#x3B5;&#x3C7;&#x3AF;&#x3B6;&#x3BF;&#x3BD;&#x3C4;&#x3B1;&#x3C2; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3B1;&#x3C1;&#x3AC;&#x3B4;&#x3BF;&#x3C3;&#x3AE; &#x3BC;&#x3B1;&#x3C2; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3BA;&#x3B1;&#x3B9;&#x3BD;&#x3BF;&#x3C4;&#x3BF;&#x3BC;&#x3AF;&#x3B1; &#x3C0;&#x3B1;&#x3B3;&#x3BA;&#x3CC;&#x3C3;&#x3BC;&#x3B9;&#x3B1;&#x3C2; &#x3BA;&#x3BB;&#x3AC;&#x3C3;&#x3B7;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C3;&#x3AF;&#x3B1; &#x3C4;&#x3B7;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE;&#x3C2;, &#x3B7; ZAGG &#xAE; &#x3B5;&#x3B9;&#x3C3;&#x3AC;&#x3B3;&#x3B5;&#x3B9; &#x3C4;&#x3B7;&#x3BD; invisibleSHIELD &#xAE; EXTREME. &#x391;&#x3C5;&#x3C4;&#x3AE; &#x3B7; &#x3B1;&#x3C0;&#x3BF;&#x3BA;&#x3BB;&#x3B5;&#x3B9;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AE; &#x3C4;&#x3B1;&#x3B9;&#x3BD;&#x3AF;&#x3B1;, &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3CD;&#x3B5;&#x3B9; &#x3CC;&#x3C0;&#x3C9;&#x3C2; &#x3B7; Original &#x399;nvisibleSHIELD &#x3B1;&#x3BB;&#x3BB;&#x3AC; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3B8;&#x3AD;&#x3C4;&#x3B5;&#x3B9; &#x3AD;&#x3BD;&#x3B1; &#x3BD;&#x3AD;&#x3BF; &#x3B1;&#x3BD;&#x3B8;&#x3B5;&#x3BA;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3C3;&#x3C4;&#x3C1;&#x3CE;&#x3BC;&#x3B1; &#x3C0;&#x3BF;&#x3C5; &#x3B4;&#x3B9;&#x3B1;&#x3C4;&#x3B7;&#x3C1;&#x3B5;&#x3AF; &#x3C0;&#x3B1;&#x3C1;&#x3AC;&#x3BB;&#x3BB;&#x3B7;&#x3BB;&#x3B1; &#x3C4;&#x3B7; &#x3B4;&#x3B9;&#x3B1;&#x3CD;&#x3B3;&#x3B5;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3C2; &#x3BF;&#x3B8;&#x3CC;&#x3BD;&#x3B7;. &#x3A4;&#x3BF; invisibleSHIELD EXTREME &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C6;&#x3AD;&#x3C1;&#x3B5;&#x3B9; &#x3C4;&#x3B7;&#x3BD; &#x3BC;&#x3B5;&#x3B3;&#x3B1;&#x3BB;&#x3CD;&#x3C4;&#x3B5;&#x3C1;&#x3B7; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C3;&#x3AF;&#x3B1; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3BA;&#x3B1;&#x3C4;&#x3B7;&#x3B3;&#x3BF;&#x3C1;&#x3AF;&#x3B1;, &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3CD;&#x3BF;&#x3BD;&#x3C4;&#x3B1;&#x3C2; &#x3C4;&#x3BF; &#x3BA;&#x3B9;&#x3BD;&#x3B7;&#x3C4;&#x3CC; &#x3C3;&#x3B1;&#x3C2; &#x3B1;&#x3C0;&#x3CC; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B1;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3B5;&#x3C0;&#x3AF;&#x3C0;&#x3C4;&#x3C9;&#x3C3;&#x3B7; &#x3C3;&#x3B5; &#x3C4;&#x3C5;&#x3C7;&#x3CC;&#x3BD; &#x3C0;&#x3AD;&#x3C3;&#x3B9;&#x3BC;&#x3BF; &#x3AE; &#x3C7;&#x3C4;&#x3CD;&#x3C0;&#x3B7;&#x3BC;&#x3B1;.</Description><Price>29.99</Price><Image>http://www.gricgroup.gr/media/catalog/product/e/x/extreme_drop.jpg</Image></product><product><SKU>ZA-INVSH-PR</SKU><Manufacturer>zagg</Manufacturer><Name>ZAGG - Mobile Phone InvisibleSHIELD Screen - iPhone5/5s - PR</Name><Description>&#x397; "&#x3B1;&#x3CC;&#x3C1;&#x3B1;&#x3C4;&#x3B7; &#x3B1;&#x3C3;&#x3C0;&#x3AF;&#x3B4;&#x3B1;" Invisible Shield &#xAE; Privacy &#x3C0;&#x3BF;&#x3C5; &#x3C0;&#x3C1;&#x3BF;&#x3C6;&#x3C5;&#x3BB;&#x3AC;&#x3C3;&#x3C3;&#x3B5;&#x3B9; &#x3C4;&#x3B9;&#x3C2; &#x3C0;&#x3BF;&#x3BB;&#x3CD;&#x3C4;&#x3B9;&#x3BC;&#x3B5;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3C3;&#x3B1;&#x3C2; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3CC;&#x3BD;&#x3BF; ZAGG &#xAE;, &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3B1;&#x3C1;&#x3BC;&#x3BF;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3C3;&#x3C4;&#x3B9;&#x3C2; &#x3B1;&#x3BD;&#x3AC;&#x3B3;&#x3BA;&#x3B5;&#x3C2; &#x3C4;&#x3BF;&#x3C5; &#x3C0;&#x3B5;&#x3BB;&#x3AC;&#x3C4;&#x3B7;, &#x3BA;&#x3B1;&#x3C4;&#x3BF;&#x3C7;&#x3C5;&#x3C1;&#x3C9;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3BC;&#x3B5; &#x3B4;&#x3AF;&#x3C0;&#x3BB;&#x3C9;&#x3BC;&#x3B1; &#x3B5;&#x3C5;&#x3C1;&#x3B5;&#x3C3;&#x3B9;&#x3C4;&#x3B5;&#x3C7;&#x3BD;&#x3AF;&#x3B1;&#x3C2;, &#x3C3;&#x3B1;&#x3C2; &#x3B4;&#x3AF;&#x3BD;&#x3B5;&#x3B9; &#x3C4;&#x3B7;  &#x3AC;&#x3BD;&#x3B5;&#x3C3;&#x3B7; &#x3BD;&#x3B1; &#x3BB;&#x3B5;&#x3B9;&#x3C4;&#x3BF;&#x3C5;&#x3C1;&#x3B3;&#x3B5;&#x3AF;&#x3C4;&#x3B5; &#x3C4;&#x3B9;&#x3C2; &#x3B7;&#x3BB;&#x3B5;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BD;&#x3B9;&#x3BA;&#x3AD;&#x3C2; &#x3C3;&#x3B1;&#x3C2; &#x3C3;&#x3C5;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3CE;&#x3BD;&#x3C4;&#x3B1;&#x3C2; &#x3C4;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C9;&#x3C0;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3B1;&#x3C2; &#x3B4;&#x3B5;&#x3B4;&#x3BF;&#x3BC;&#x3AD;&#x3BD;&#x3B1; &#x3BC;&#x3B1;&#x3BA;&#x3C1;&#x3C5;&#x3AC; &#x3B1;&#x3C0;&#x3CC; &#x3B1;&#x3B4;&#x3B9;&#x3AC;&#x3BA;&#x3C1;&#x3B9;&#x3C4;&#x3B1; &#x3B2;&#x3BB;&#x3AD;&#x3BC;&#x3BC;&#x3B1;&#x3C4;&#x3B1; &#x3CC;&#x3C3;&#x3BF; &#x3BA;&#x3BF;&#x3BD;&#x3C4;&#x3AC; &#x3C3;&#x3B1;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3BD; &#x3B2;&#x3C1;&#x3AF;&#x3C3;&#x3BA;&#x3BF;&#x3BD;&#x3C4;&#x3B1;&#x3B9;. &#x395;&#x3B9;&#x3B4;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3C7;&#x3B9;&#x3BB;&#x3B9;&#x3AC;&#x3B4;&#x3B5;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2;, &#x3CC;&#x3C0;&#x3C9;&#x3C2; &#x3BA;&#x3B9;&#x3BD;&#x3B7;&#x3C4;&#x3AC; &#x3C4;&#x3B7;&#x3BB;&#x3AD;&#x3C6;&#x3C9;&#x3BD;&#x3B1;, &#x3C4;&#x3B1;&#x3BC;&#x3C0;&#x3BB;&#x3AD;&#x3C4;&#x3B5;&#x3C2;, &#x3C8;&#x3B7;&#x3C6;&#x3B9;&#x3B1;&#x3BA;&#x3AD;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3B1;&#x3BD;&#x3B1;&#x3C0;&#x3B1;&#x3C1;&#x3B1;&#x3B3;&#x3C9;&#x3B3;&#x3AE;&#x3C2; &#x3C0;&#x3BF;&#x3BB;&#x3C5;&#x3BC;&#x3AD;&#x3C3;&#x3C9;&#x3BD; &#x3BA;&#x3B1;&#x3B9; &#x3C6;&#x3BF;&#x3C1;&#x3B7;&#x3C4;&#x3BF;&#x3CD;&#x3C2; &#x3C5;&#x3C0;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B9;&#x3C3;&#x3C4;&#x3AD;&#x3C2;, &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C4;&#x3BF; &#x3BD;&#x3BF;&#x3CD;&#x3BC;&#x3B5;&#x3C1;&#x3BF; 1 &#x3C0;&#x3C1;&#x3BF;&#x3CA;&#x3CC;&#x3BD; &#x3C0;&#x3CE;&#x3BB;&#x3B7;&#x3C3;&#x3B7;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3BD; "&#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C3;&#x3AF;&#x3B1;" &#x3C4;&#x3C9;&#x3BD; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C9;&#x3C0;&#x3B9;&#x3BA;&#x3CE;&#x3BD; &#x3B4;&#x3B5;&#x3B4;&#x3BF;&#x3BC;&#x3AD;&#x3BD;&#x3C9;&#x3BD; &#x3C3;&#x3B1;&#x3C2; &#x3CC;&#x3C0;&#x3C9;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3B7;&#x3C2; &#x3BF;&#x3B8;&#x3CC;&#x3BD;&#x3B7;&#x3C2; &#x3C3;&#x3B1;&#x3C2;. </Description><Price>24.99</Price><Image>http://www.gricgroup.gr/media/catalog/product/i/p/ip4gsp-pvcy_1.jpg</Image></product><product><SKU>ZA-INVSH-SM-P</SKU><Manufacturer>zagg</Manufacturer><Name>ZAGG - Mobile Phone InvisibleSHIELD Screen - iPhone 5/5s - SM-P</Name><Description>&#x3A4;&#x3BF; invisibleSHIELD &#xAE; Smudge-Proof &#x2122; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3AD;&#x3BD;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3C5;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3C6;&#x3B9;&#x3BB;&#x3BC; &#x3C0;&#x3BF;&#x3C5; &#x3B2;&#x3B5;&#x3BB;&#x3C4;&#x3B9;&#x3CE;&#x3BD;&#x3B5;&#x3B9; &#x3C4;&#x3B7;&#x3BD; &#x3BF;&#x3C1;&#x3B1;&#x3C4;&#x3CC;&#x3C4;&#x3B7;&#x3C4;&#x3B1; &#x3C4;&#x3B7;&#x3C2; &#x3BF;&#x3B8;&#x3CC;&#x3BD;&#x3B7;&#x3C2; &#x3C6;&#x3B9;&#x3BB;&#x3C4;&#x3C1;&#x3AC;&#x3C1;o&#x3BD;&#x3C4;&#x3B1;&#x3C2; &#x3C4;&#x3B7;&#x3BD; &#x3B1;&#x3BD;&#x3C4;&#x3B1;&#x3BD;&#x3AC;&#x3BA;&#x3BB;&#x3B1;&#x3C3;&#x3B7; &#x3C4;&#x3BF;&#x3C5; &#x3C6;&#x3C9;&#x3C4;&#x3CC;&#x3C2;, &#x3BA;&#x3B1;&#x3B8;&#x3B9;&#x3C3;&#x3C4;&#x3CE;&#x3BD;&#x3C4;&#x3B1;&#x3C2; &#x3B5;&#x3C5;&#x3BA;&#x3BF;&#x3BB;&#x3CC;&#x3C4;&#x3B5;&#x3C1;&#x3B7; &#x3C4;&#x3B7;&#x3BD; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3B7; &#x3C4;&#x3B7;&#x3C2; &#x3B7;&#x3BB;&#x3B5;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BD;&#x3B9;&#x3BA;&#x3AE;&#x3C2; &#x3C3;&#x3B1;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE;&#x3C2; &#x3C3;&#x3B5; &#x3C6;&#x3C9;&#x3C4;&#x3B5;&#x3B9;&#x3BD;&#x3CC; &#x3C0;&#x3B5;&#x3C1;&#x3B9;&#x3B2;&#x3AC;&#x3BB;&#x3BB;&#x3BF;&#x3BD;, &#x3CC;&#x3C0;&#x3C9;&#x3C2; &#x3C4;&#x3BF;&#x3C5; &#x3B3;&#x3C1;&#x3B1;&#x3C6;&#x3B5;&#x3AF;&#x3BF;&#x3C5;. &#x3A6;&#x3C4;&#x3B9;&#x3B1;&#x3B3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3BF; &#x3AF;&#x3B4;&#x3B9;&#x3BF; &#x3B1;&#x3BD;&#x3B8;&#x3B5;&#x3BA;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3C5;&#x3BB;&#x3B9;&#x3BA;&#x3CC; &#x3CC;&#x3C0;&#x3C9;&#x3C2; &#x3C4;&#x3BF; invisibleSHIELD ORIGINAL, &#x3B7; &#x3C4;&#x3B1;&#x3B9;&#x3BD;&#x3AF;&#x3B1; &#x3B1;&#x3C5;&#x3C4;&#x3AE; &#x3B2;&#x3BF;&#x3B7;&#x3B8;&#x3AC; &#x3B5;&#x3C0;&#x3AF;&#x3C3;&#x3B7;&#x3C2; &#x3BD;&#x3B1; &#x3BC;&#x3B5;&#x3B9;&#x3CE;&#x3C3;&#x3B5;&#x3B9; &#x3C4;&#x3B7;&#x3BD; &#x3B5;&#x3BC;&#x3C6;&#x3AC;&#x3BD;&#x3B9;&#x3C3;&#x3B7; &#x3C4;&#x3B7;&#x3C2; &#x3B2;&#x3C1;&#x3C9;&#x3BC;&#x3B9;&#x3AC;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3B1; &#x3B4;&#x3B1;&#x3BA;&#x3C4;&#x3C5;&#x3BB;&#x3B9;&#x3BA;&#x3AC; &#x3B1;&#x3C0;&#x3BF;&#x3C4;&#x3C5;&#x3C0;&#x3CE;&#x3BC;&#x3B1;&#x3C4;&#x3B1;. &#x397; invisibleSHIELD &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C4;&#x3BF; &#x3BD;&#x3BF;&#x3CD;&#x3BC;&#x3B5;&#x3C1;&#x3BF; 1 &#x3C0;&#x3C1;&#x3BF;&#x3CA;&#x3CC;&#x3BD; &#x3C0;&#x3CE;&#x3BB;&#x3B7;&#x3C3;&#x3B7;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C3;&#x3AF;&#x3B1; &#x3C4;&#x3B7;&#x3C2; &#x3BF;&#x3B8;&#x3CC;&#x3BD;&#x3B7;&#x3C2;.</Description><Price>17.99</Price><Image>http://www.gricgroup.gr/media/catalog/product/i/s/is-iphone-5s.jpg</Image></product><product><SKU>ZA-INVSH-IP4/4s</SKU><Manufacturer>zagg</Manufacturer><Name>ZAGG - Mobile Phone InvisibleSHIELD Screen - iPhone 4/4s</Name><Description>&#x397; "&#x3B1;&#x3CC;&#x3C1;&#x3B1;&#x3C4;&#x3B7; &#x3B1;&#x3C3;&#x3C0;&#x3AF;&#x3B4;&#x3B1;" Invisible Shield &#xAE; &#x3C0;&#x3BF;&#x3C5; &#x3C0;&#x3C1;&#x3BF;&#x3C6;&#x3C5;&#x3BB;&#x3AC;&#x3C3;&#x3C3;&#x3B5;&#x3B9; &#x3C4;&#x3B9;&#x3C2; &#x3C0;&#x3BF;&#x3BB;&#x3CD;&#x3C4;&#x3B9;&#x3BC;&#x3B5;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3C3;&#x3B1;&#x3C2; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3CC;&#x3BD;&#x3BF; ZAGG &#xAE;, &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3B1;&#x3C1;&#x3BC;&#x3BF;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3C3;&#x3C4;&#x3B9;&#x3C2; &#x3B1;&#x3BD;&#x3AC;&#x3B3;&#x3BA;&#x3B5;&#x3C2; &#x3C4;&#x3BF;&#x3C5; &#x3C0;&#x3B5;&#x3BB;&#x3AC;&#x3C4;&#x3B7;, &#x3BA;&#x3B1;&#x3C4;&#x3BF;&#x3C7;&#x3C5;&#x3C1;&#x3C9;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3BC;&#x3B5; &#x3B4;&#x3AF;&#x3C0;&#x3BB;&#x3C9;&#x3BC;&#x3B1; &#x3B5;&#x3C5;&#x3C1;&#x3B5;&#x3C3;&#x3B9;&#x3C4;&#x3B5;&#x3C7;&#x3BD;&#x3AF;&#x3B1;&#x3C2;, &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B7; &#x3BD;&#x3B1;&#x3C5;&#x3B1;&#x3C1;&#x3C7;&#x3AF;&#x3B4;&#x3B1; &#x3C4;&#x3C9;&#x3BD; &#x3C0;&#x3C1;&#x3BF;&#x3CA;&#x3CC;&#x3BD;&#x3C4;&#x3C9;&#x3BD; &#x3C0;&#x3BF;&#x3C5; &#x3C6;&#x3C5;&#x3BB;&#x3AC;&#x3BD;&#x3B5; &#x3C4;&#x3B1; &#x3B7;&#x3BB;&#x3B5;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BD;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3B1;&#x3C2; &#x3B5;&#x3AF;&#x3B4;&#x3B7; &#x3B5;&#x3C5;&#x3C1;&#x3B5;&#x3AF;&#x3B1;&#x3C2; &#x3BA;&#x3B1;&#x3C4;&#x3B1;&#x3BD;&#x3AC;&#x3BB;&#x3C9;&#x3C3;&#x3B7;&#x3C2;, &#x3C0;&#x3B1;&#x3C1;&#x3AD;&#x3C7;&#x3BF;&#x3BD;&#x3C4;&#x3B1;&#x3C2; &#x3B1;&#x3C0;&#x3B1;&#x3C1;&#x3AC;&#x3BC;&#x3B9;&#x3BB;&#x3BB;&#x3B7; &#x3B1;&#x3BD;&#x3C4;&#x3BF;&#x3C7;&#x3AE; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3C4;&#x3C1;&#x3B9;&#x3B2;&#x3AE;. &#x395;&#x3B9;&#x3B4;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3C7;&#x3B9;&#x3BB;&#x3B9;&#x3AC;&#x3B4;&#x3B5;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2;, &#x3CC;&#x3C0;&#x3C9;&#x3C2; &#x3BA;&#x3B9;&#x3BD;&#x3B7;&#x3C4;&#x3AC; &#x3C4;&#x3B7;&#x3BB;&#x3AD;&#x3C6;&#x3C9;&#x3BD;&#x3B1;, &#x3C4;&#x3B1;&#x3BC;&#x3C0;&#x3BB;&#x3AD;&#x3C4;&#x3B5;&#x3C2;, &#x3C8;&#x3B7;&#x3C6;&#x3B9;&#x3B1;&#x3BA;&#x3AD;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3B1;&#x3BD;&#x3B1;&#x3C0;&#x3B1;&#x3C1;&#x3B1;&#x3B3;&#x3C9;&#x3B3;&#x3AE;&#x3C2; &#x3C0;&#x3BF;&#x3BB;&#x3C5;&#x3BC;&#x3AD;&#x3C3;&#x3C9;&#x3BD; &#x3BA;&#x3B1;&#x3B9; &#x3C6;&#x3BF;&#x3C1;&#x3B7;&#x3C4;&#x3BF;&#x3CD;&#x3C2; &#x3C5;&#x3C0;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B9;&#x3C3;&#x3C4;&#x3AD;&#x3C2;, &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C4;&#x3BF; &#x3BD;&#x3BF;&#x3CD;&#x3BC;&#x3B5;&#x3C1;&#x3BF; 1 &#x3C0;&#x3C1;&#x3BF;&#x3CA;&#x3CC;&#x3BD; &#x3C0;&#x3CE;&#x3BB;&#x3B7;&#x3C3;&#x3B7;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C3;&#x3AF;&#x3B1; &#x3C4;&#x3B7;&#x3C2; &#x3BF;&#x3B8;&#x3CC;&#x3BD;&#x3B7;&#x3C2;. </Description><Price>14.99</Price><Image>http://www.gricgroup.gr/media/catalog/product/a/p/apple_iphone_4-4s_screen_white.jpg</Image></product><product><SKU>ZA-INVSH-IP4/4s-OR</SKU><Manufacturer>zagg</Manufacturer><Name>ZAGG - Mobile Phone InvisibleSHIELD Screen - iPhone 4/4s - Original</Name><Description>&#x397; "&#x3B1;&#x3CC;&#x3C1;&#x3B1;&#x3C4;&#x3B7; &#x3B1;&#x3C3;&#x3C0;&#x3AF;&#x3B4;&#x3B1;" Invisible Shield &#xAE; &#x3C0;&#x3BF;&#x3C5; &#x3C0;&#x3C1;&#x3BF;&#x3C6;&#x3C5;&#x3BB;&#x3AC;&#x3C3;&#x3C3;&#x3B5;&#x3B9; &#x3C4;&#x3B9;&#x3C2; &#x3C0;&#x3BF;&#x3BB;&#x3CD;&#x3C4;&#x3B9;&#x3BC;&#x3B5;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3C3;&#x3B1;&#x3C2; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3CC;&#x3BD;&#x3BF; ZAGG &#xAE;, &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3B1;&#x3C1;&#x3BC;&#x3BF;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3C3;&#x3C4;&#x3B9;&#x3C2; &#x3B1;&#x3BD;&#x3AC;&#x3B3;&#x3BA;&#x3B5;&#x3C2; &#x3C4;&#x3BF;&#x3C5; &#x3C0;&#x3B5;&#x3BB;&#x3AC;&#x3C4;&#x3B7;, &#x3BA;&#x3B1;&#x3C4;&#x3BF;&#x3C7;&#x3C5;&#x3C1;&#x3C9;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3BC;&#x3B5; &#x3B4;&#x3AF;&#x3C0;&#x3BB;&#x3C9;&#x3BC;&#x3B1; &#x3B5;&#x3C5;&#x3C1;&#x3B5;&#x3C3;&#x3B9;&#x3C4;&#x3B5;&#x3C7;&#x3BD;&#x3AF;&#x3B1;&#x3C2;, &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B7; &#x3BD;&#x3B1;&#x3C5;&#x3B1;&#x3C1;&#x3C7;&#x3AF;&#x3B4;&#x3B1; &#x3C4;&#x3C9;&#x3BD; &#x3C0;&#x3C1;&#x3BF;&#x3CA;&#x3CC;&#x3BD;&#x3C4;&#x3C9;&#x3BD; &#x3C0;&#x3BF;&#x3C5; &#x3C6;&#x3C5;&#x3BB;&#x3AC;&#x3BD;&#x3B5; &#x3C4;&#x3B1; &#x3B7;&#x3BB;&#x3B5;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BD;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3B1;&#x3C2; &#x3B5;&#x3AF;&#x3B4;&#x3B7; &#x3B5;&#x3C5;&#x3C1;&#x3B5;&#x3AF;&#x3B1;&#x3C2; &#x3BA;&#x3B1;&#x3C4;&#x3B1;&#x3BD;&#x3AC;&#x3BB;&#x3C9;&#x3C3;&#x3B7;&#x3C2;, &#x3C0;&#x3B1;&#x3C1;&#x3AD;&#x3C7;&#x3BF;&#x3BD;&#x3C4;&#x3B1;&#x3C2; &#x3B1;&#x3C0;&#x3B1;&#x3C1;&#x3AC;&#x3BC;&#x3B9;&#x3BB;&#x3BB;&#x3B7; &#x3B1;&#x3BD;&#x3C4;&#x3BF;&#x3C7;&#x3AE; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3C4;&#x3C1;&#x3B9;&#x3B2;&#x3AE;. &#x395;&#x3B9;&#x3B4;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3C7;&#x3B9;&#x3BB;&#x3B9;&#x3AC;&#x3B4;&#x3B5;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2;, &#x3CC;&#x3C0;&#x3C9;&#x3C2; &#x3BA;&#x3B9;&#x3BD;&#x3B7;&#x3C4;&#x3AC; &#x3C4;&#x3B7;&#x3BB;&#x3AD;&#x3C6;&#x3C9;&#x3BD;&#x3B1;, &#x3C4;&#x3B1;&#x3BC;&#x3C0;&#x3BB;&#x3AD;&#x3C4;&#x3B5;&#x3C2;, &#x3C8;&#x3B7;&#x3C6;&#x3B9;&#x3B1;&#x3BA;&#x3AD;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3B1;&#x3BD;&#x3B1;&#x3C0;&#x3B1;&#x3C1;&#x3B1;&#x3B3;&#x3C9;&#x3B3;&#x3AE;&#x3C2; &#x3C0;&#x3BF;&#x3BB;&#x3C5;&#x3BC;&#x3AD;&#x3C3;&#x3C9;&#x3BD; &#x3BA;&#x3B1;&#x3B9; &#x3C6;&#x3BF;&#x3C1;&#x3B7;&#x3C4;&#x3BF;&#x3CD;&#x3C2; &#x3C5;&#x3C0;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B9;&#x3C3;&#x3C4;&#x3AD;&#x3C2;, &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C4;&#x3BF; &#x3BD;&#x3BF;&#x3CD;&#x3BC;&#x3B5;&#x3C1;&#x3BF; 1 &#x3C0;&#x3C1;&#x3BF;&#x3CA;&#x3CC;&#x3BD; &#x3C0;&#x3CE;&#x3BB;&#x3B7;&#x3C3;&#x3B7;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C3;&#x3AF;&#x3B1; &#x3C4;&#x3B7;&#x3C2; &#x3BF;&#x3B8;&#x3CC;&#x3BD;&#x3B7;&#x3C2;. </Description><Price>14.99</Price><Image>http://www.gricgroup.gr/media/catalog/product/a/p/apple_iphone_4-4s_screen_white_2.jpg</Image></product><product><SKU>ZA-INVSH-IP4/4s-EX</SKU><Manufacturer>zagg</Manufacturer><Name>ZAGG - Mobile Phone InvisibleSHIELD Screen - iPhone 4/4s - Extreme</Name><Description>&#x3A3;&#x3C5;&#x3BD;&#x3B5;&#x3C7;&#x3AF;&#x3B6;&#x3BF;&#x3BD;&#x3C4;&#x3B1;&#x3C2; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3B1;&#x3C1;&#x3AC;&#x3B4;&#x3BF;&#x3C3;&#x3AE; &#x3BC;&#x3B1;&#x3C2; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3BA;&#x3B1;&#x3B9;&#x3BD;&#x3BF;&#x3C4;&#x3BF;&#x3BC;&#x3AF;&#x3B1; &#x3C0;&#x3B1;&#x3B3;&#x3BA;&#x3CC;&#x3C3;&#x3BC;&#x3B9;&#x3B1;&#x3C2; &#x3BA;&#x3BB;&#x3AC;&#x3C3;&#x3B7;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C3;&#x3AF;&#x3B1; &#x3C4;&#x3B7;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE;&#x3C2;, &#x3B7; ZAGG &#xAE; &#x3B5;&#x3B9;&#x3C3;&#x3AC;&#x3B3;&#x3B5;&#x3B9; &#x3C4;&#x3B7;&#x3BD; invisibleSHIELD &#xAE; EXTREME. &#x391;&#x3C5;&#x3C4;&#x3AE; &#x3B7; &#x3B1;&#x3C0;&#x3BF;&#x3BA;&#x3BB;&#x3B5;&#x3B9;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AE; &#x3C4;&#x3B1;&#x3B9;&#x3BD;&#x3AF;&#x3B1;, &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3CD;&#x3B5;&#x3B9; &#x3CC;&#x3C0;&#x3C9;&#x3C2; &#x3B7; Original &#x399;nvisibleSHIELD &#x3B1;&#x3BB;&#x3BB;&#x3AC; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3B8;&#x3AD;&#x3C4;&#x3B5;&#x3B9; &#x3AD;&#x3BD;&#x3B1; &#x3BD;&#x3AD;&#x3BF; &#x3B1;&#x3BD;&#x3B8;&#x3B5;&#x3BA;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3C3;&#x3C4;&#x3C1;&#x3CE;&#x3BC;&#x3B1; &#x3C0;&#x3BF;&#x3C5; &#x3B4;&#x3B9;&#x3B1;&#x3C4;&#x3B7;&#x3C1;&#x3B5;&#x3AF; &#x3C0;&#x3B1;&#x3C1;&#x3AC;&#x3BB;&#x3BB;&#x3B7;&#x3BB;&#x3B1; &#x3C4;&#x3B7; &#x3B4;&#x3B9;&#x3B1;&#x3CD;&#x3B3;&#x3B5;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3C2; &#x3BF;&#x3B8;&#x3CC;&#x3BD;&#x3B7;. &#x3A4;&#x3BF; invisibleSHIELD EXTREME &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C6;&#x3AD;&#x3C1;&#x3B5;&#x3B9; &#x3C4;&#x3B7;&#x3BD; &#x3BC;&#x3B5;&#x3B3;&#x3B1;&#x3BB;&#x3CD;&#x3C4;&#x3B5;&#x3C1;&#x3B7; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C3;&#x3AF;&#x3B1; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3BA;&#x3B1;&#x3C4;&#x3B7;&#x3B3;&#x3BF;&#x3C1;&#x3AF;&#x3B1;, &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3CD;&#x3BF;&#x3BD;&#x3C4;&#x3B1;&#x3C2; &#x3C4;&#x3BF; &#x3BA;&#x3B9;&#x3BD;&#x3B7;&#x3C4;&#x3CC; &#x3C3;&#x3B1;&#x3C2; &#x3B1;&#x3C0;&#x3CC; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B1;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3B5;&#x3C0;&#x3AF;&#x3C0;&#x3C4;&#x3C9;&#x3C3;&#x3B7; &#x3C3;&#x3B5; &#x3C4;&#x3C5;&#x3C7;&#x3CC;&#x3BD; &#x3C0;&#x3AD;&#x3C3;&#x3B9;&#x3BC;&#x3BF; &#x3AE; &#x3C7;&#x3C4;&#x3CD;&#x3C0;&#x3B7;&#x3BC;&#x3B1;.</Description><Price>29.99</Price><Image>http://www.gricgroup.gr/media/catalog/product/e/x/extreme_drop_1.jpg</Image></product><product><SKU>ZA-INVSH-IP4/4s-PR</SKU><Manufacturer>zagg</Manufacturer><Name>ZAGG - Mobile Phone InvisibleSHIELD Screen - iPhone 4/4s - Privacy</Name><Description>&#x397; "&#x3B1;&#x3CC;&#x3C1;&#x3B1;&#x3C4;&#x3B7; &#x3B1;&#x3C3;&#x3C0;&#x3AF;&#x3B4;&#x3B1;" Invisible Shield &#xAE; Privacy &#x3C0;&#x3BF;&#x3C5; &#x3C0;&#x3C1;&#x3BF;&#x3C6;&#x3C5;&#x3BB;&#x3AC;&#x3C3;&#x3C3;&#x3B5;&#x3B9; &#x3C4;&#x3B9;&#x3C2; &#x3C0;&#x3BF;&#x3BB;&#x3CD;&#x3C4;&#x3B9;&#x3BC;&#x3B5;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3C3;&#x3B1;&#x3C2; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3CC;&#x3BD;&#x3BF; ZAGG &#xAE;, &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3B1;&#x3C1;&#x3BC;&#x3BF;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3C3;&#x3C4;&#x3B9;&#x3C2; &#x3B1;&#x3BD;&#x3AC;&#x3B3;&#x3BA;&#x3B5;&#x3C2; &#x3C4;&#x3BF;&#x3C5; &#x3C0;&#x3B5;&#x3BB;&#x3AC;&#x3C4;&#x3B7;, &#x3BA;&#x3B1;&#x3C4;&#x3BF;&#x3C7;&#x3C5;&#x3C1;&#x3C9;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3BC;&#x3B5; &#x3B4;&#x3AF;&#x3C0;&#x3BB;&#x3C9;&#x3BC;&#x3B1; &#x3B5;&#x3C5;&#x3C1;&#x3B5;&#x3C3;&#x3B9;&#x3C4;&#x3B5;&#x3C7;&#x3BD;&#x3AF;&#x3B1;&#x3C2;, &#x3C3;&#x3B1;&#x3C2; &#x3B4;&#x3AF;&#x3BD;&#x3B5;&#x3B9; &#x3C4;&#x3B7;  &#x3AC;&#x3BD;&#x3B5;&#x3C3;&#x3B7; &#x3BD;&#x3B1; &#x3BB;&#x3B5;&#x3B9;&#x3C4;&#x3BF;&#x3C5;&#x3C1;&#x3B3;&#x3B5;&#x3AF;&#x3C4;&#x3B5; &#x3C4;&#x3B9;&#x3C2; &#x3B7;&#x3BB;&#x3B5;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BD;&#x3B9;&#x3BA;&#x3AD;&#x3C2; &#x3C3;&#x3B1;&#x3C2; &#x3C3;&#x3C5;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3CE;&#x3BD;&#x3C4;&#x3B1;&#x3C2; &#x3C4;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C9;&#x3C0;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3B1;&#x3C2; &#x3B4;&#x3B5;&#x3B4;&#x3BF;&#x3BC;&#x3AD;&#x3BD;&#x3B1; &#x3BC;&#x3B1;&#x3BA;&#x3C1;&#x3C5;&#x3AC; &#x3B1;&#x3C0;&#x3CC; &#x3B1;&#x3B4;&#x3B9;&#x3AC;&#x3BA;&#x3C1;&#x3B9;&#x3C4;&#x3B1; &#x3B2;&#x3BB;&#x3AD;&#x3BC;&#x3BC;&#x3B1;&#x3C4;&#x3B1; &#x3CC;&#x3C3;&#x3BF; &#x3BA;&#x3BF;&#x3BD;&#x3C4;&#x3AC; &#x3C3;&#x3B1;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3BD; &#x3B2;&#x3C1;&#x3AF;&#x3C3;&#x3BA;&#x3BF;&#x3BD;&#x3C4;&#x3B1;&#x3B9;. &#x395;&#x3B9;&#x3B4;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3C7;&#x3B9;&#x3BB;&#x3B9;&#x3AC;&#x3B4;&#x3B5;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2;, &#x3CC;&#x3C0;&#x3C9;&#x3C2; &#x3BA;&#x3B9;&#x3BD;&#x3B7;&#x3C4;&#x3AC; &#x3C4;&#x3B7;&#x3BB;&#x3AD;&#x3C6;&#x3C9;&#x3BD;&#x3B1;, &#x3C4;&#x3B1;&#x3BC;&#x3C0;&#x3BB;&#x3AD;&#x3C4;&#x3B5;&#x3C2;, &#x3C8;&#x3B7;&#x3C6;&#x3B9;&#x3B1;&#x3BA;&#x3AD;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AD;&#x3C2; &#x3B1;&#x3BD;&#x3B1;&#x3C0;&#x3B1;&#x3C1;&#x3B1;&#x3B3;&#x3C9;&#x3B3;&#x3AE;&#x3C2; &#x3C0;&#x3BF;&#x3BB;&#x3C5;&#x3BC;&#x3AD;&#x3C3;&#x3C9;&#x3BD; &#x3BA;&#x3B1;&#x3B9; &#x3C6;&#x3BF;&#x3C1;&#x3B7;&#x3C4;&#x3BF;&#x3CD;&#x3C2; &#x3C5;&#x3C0;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B9;&#x3C3;&#x3C4;&#x3AD;&#x3C2;, &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C4;&#x3BF; &#x3BD;&#x3BF;&#x3CD;&#x3BC;&#x3B5;&#x3C1;&#x3BF; 1 &#x3C0;&#x3C1;&#x3BF;&#x3CA;&#x3CC;&#x3BD; &#x3C0;&#x3CE;&#x3BB;&#x3B7;&#x3C3;&#x3B7;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3BD; "&#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C3;&#x3AF;&#x3B1;" &#x3C4;&#x3C9;&#x3BD; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C9;&#x3C0;&#x3B9;&#x3BA;&#x3CE;&#x3BD; &#x3B4;&#x3B5;&#x3B4;&#x3BF;&#x3BC;&#x3AD;&#x3BD;&#x3C9;&#x3BD; &#x3C3;&#x3B1;&#x3C2; &#x3CC;&#x3C0;&#x3C9;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3B7;&#x3C2; &#x3BF;&#x3B8;&#x3CC;&#x3BD;&#x3B7;&#x3C2; &#x3C3;&#x3B1;&#x3C2;. </Description><Price>24.99</Price><Image>http://www.gricgroup.gr/media/catalog/product/i/p/ip4gsp-pvcy_3.jpg</Image></product><product><SKU>ZA-INVSH-IP4/4s-HD</SKU><Manufacturer>zagg</Manufacturer><Name>ZAGG - Mobile Phone InvisibleSHIELD Screen - iPhone 4/4s - HD</Name><Description>&#x395;&#x3BE;&#x3B1;&#x3B9;&#x3C1;&#x3B5;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3C3;&#x3B1;&#x3C6;&#x3AE;&#x3C2;, &#x3B1;&#x3C0;&#x3AF;&#x3C3;&#x3C4;&#x3B5;&#x3C5;&#x3C4;&#x3B1; &#x3BB;&#x3B5;&#x3C0;&#x3C4;&#x3AE;, &#x3BA;&#x3B1;&#x3B9; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3CC;&#x3BD; &#x3AC;&#x3C6;&#x3B8;&#x3B1;&#x3C1;&#x3C4;&#x3B7;, &#x3B7; ZAGG &#xAE; High-Definition &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B7; &#x3BC;&#x3B5;&#x3BC;&#x3B2;&#x3C1;&#x3AC;&#x3BD;&#x3B7; &#x3B7; &#x3BF;&#x3C0;&#x3BF;&#x3AF;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C6;&#x3AD;&#x3C1;&#x3B5;&#x3B9; premium &#x3C7;&#x3B1;&#x3C1;&#x3B1;&#x3BA;&#x3C4;&#x3B7;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC;, &#x3CC;&#x3C0;&#x3C9;&#x3C2; &#x3C0;&#x3C1;&#x3BF;&#x3B7;&#x3B3;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3C3;&#x3B1;&#x3C6;&#x3AE;&#x3BD;&#x3B5;&#x3B9;&#x3B1; &#x3BA;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x3B3;&#x3C5;&#x3AC;&#x3BB;&#x3B9;&#x3BD;&#x3B7; &#x3B5;&#x3C0;&#x3B9;&#x3C6;&#x3AC;&#x3BD;&#x3B5;&#x3B9;&#x3B1; &#x3C0;&#x3BF;&#x3C5; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C6;&#x3C4;&#x3B9;&#x3B1;&#x3B3;&#x3BC;&#x3AD;&#x3BD;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3C4;&#x3BF;&#x3BD;&#x3AF;&#x3C3;&#x3B5;&#x3B9; &#x3C4;&#x3B9;&#x3C2; &#x3B5;&#x3C5;&#x3BA;&#x3C1;&#x3B9;&#x3BD;&#x3B5;&#x3AF;&#x3C2; &#x3B5;&#x3B9;&#x3BA;&#x3CC;&#x3BD;&#x3B5;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3B1; &#x3AD;&#x3BD;&#x3C4;&#x3BF;&#x3BD;&#x3B1; &#x3C7;&#x3C1;&#x3CE;&#x3BC;&#x3B1;&#x3C4;&#x3B1; &#x3C3;&#x3C4;&#x3B1; &#x3C0;&#x3B9;&#x3BF; &#x3C3;&#x3CD;&#x3B3;&#x3C7;&#x3C1;&#x3BF;&#x3BD;&#x3B1; gadget &#x3C0;&#x3C1;&#x3BF;&#x3B7;&#x3B3;&#x3BC;&#x3AD;&#x3BD;&#x3B7;&#x3C2; &#x3C4;&#x3B5;&#x3C7;&#x3BD;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3AF;&#x3B1;&#x3C2;. &#x3A4;&#x3BF; &#x399;nvisibleSHIELD &#xAE; HIGH DEFINITION, &#x3C0;&#x3BF;&#x3C5; &#x3B4;&#x3B7;&#x3BC;&#x3B9;&#x3BF;&#x3C5;&#x3C1;&#x3B3;&#x3AE;&#x3B8;&#x3B7;&#x3BA;&#x3B5; &#x3B1;&#x3C0;&#x3CC; &#x3BC;&#x3B9;&#x3B1; &#x3C4;&#x3B1;&#x3B9;&#x3BD;&#x3AF;&#x3B1; &#x3B1;&#x3C0;&#x3BF;&#x3BA;&#x3BB;&#x3B5;&#x3B9;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3BD; ZAGG, &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B7; &#x3C4;&#x3AD;&#x3BB;&#x3B5;&#x3B9;&#x3B1; &#x3B5;&#x3C0;&#x3B9;&#x3BB;&#x3BF;&#x3B3;&#x3AE; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C3;&#x3AF;&#x3B1; &#x3C4;&#x3B7;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE;&#x3C2; &#x3C3;&#x3B1;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3C4;&#x3BF; &#x3BD;&#x3BF;&#x3CD;&#x3BC;&#x3B5;&#x3C1;&#x3BF; 1 &#x3C0;&#x3C1;&#x3BF;&#x3CA;&#x3CC;&#x3BD; &#x3C0;&#x3CE;&#x3BB;&#x3B7;&#x3C3;&#x3B7;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C3;&#x3AF;&#x3B1; &#x3C4;&#x3B7;&#x3C2; &#x3BF;&#x3B8;&#x3CC;&#x3BD;&#x3B7;&#x3C2;.</Description><Price>19.99</Price><Image>http://www.gricgroup.gr/media/catalog/product/i/p/ip4gsp3-agl.jpg</Image></product><product><SKU>ZAGG-WIPE</SKU><Manufacturer>zagg</Manufacturer><Name>ZAGGwipes Antibacterial (15 wipes)</Name><Description>&#x3A4;&#x3B1; ZAGGwipes &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x3B9;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3AE; &#x3BB;&#x3CD;&#x3C3;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3BF;&#x3BD; &#x3BA;&#x3B1;&#x3B8;&#x3B1;&#x3C1;&#x3B9;&#x3C3;&#x3BC;&#x3CC; &#x3C4;&#x3C9;&#x3BD; &#x3B1;&#x3B3;&#x3B1;&#x3C0;&#x3B7;&#x3BC;&#x3AD;&#x3BD;&#x3C9;&#x3BD; gadgets &#x3C3;&#x3B1;&#x3C2; &#x3CC;&#x3C4;&#x3B1;&#x3BD; &#x3B5;&#x3AF;&#x3C3;&#x3C4;&#x3B5; &#x3B5;&#x3BD; &#x3BA;&#x3B9;&#x3BD;&#x3AE;&#x3C3;&#x3B5;&#x3B9;. &#x391;&#x3C0;&#x3BB;&#x3AC; &#x3C4;&#x3C1;&#x3B1;&#x3B2;&#x3AE;&#x3BE;&#x3C4;&#x3B5; &#x384;&#x3B5;&#x3BD;&#x3B1; &#x3BC;&#x3B1;&#x3BD;&#x3C4;&#x3B7;&#x3BB;&#x3AC;&#x3BA;&#x3B9; &#x3AD;&#x3BE;&#x3C9; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3B7; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3B1;&#x3C3;&#x3AF;&#x3B1; &#x3BA;&#x3B1;&#x3B9; &#x3B3;&#x3C1;&#x3AE;&#x3B3;&#x3BF;&#x3C1;&#x3B1; &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B1; &#x3C3;&#x3BA;&#x3BF;&#x3C5;&#x3C0;&#x3AF;&#x3C3;&#x3C4;&#x3B5; &#x3B2;&#x3C1;&#x3C9;&#x3BC;&#x3B9;&#x3AC;, &#x3C4;&#x3B1; &#x3AF;&#x3C7;&#x3BD;&#x3B7; &#x3C4;&#x3BF;&#x3C5; &#x3B4;&#x3AD;&#x3C1;&#x3BC;&#x3B1;&#x3C4;&#x3BF;&#x3C2;, &#x3C4;&#x3B1; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC;&#x3B2;&#x3B9;&#x3B1;,&#x3C4;&#x3BF; &#x3BC;&#x3B1;&#x3BA;&#x3B9;&#x3B3;&#x3B9;&#x3AC;&#x3B6;, &#x3BA;&#x3B1;&#x3B9; &#x3C0;&#x3BF;&#x3BB;&#x3BB;&#x3AC; &#x3AC;&#x3BB;&#x3BB;&#x3B1;. &#x3A4;&#x3B1; &#x3BC;&#x3B1;&#x3BD;&#x3C4;&#x3B7;&#x3BB;&#x3AC;&#x3BA;&#x3B9;&#x3B1; &#x3BC;&#x3B5; &#x3C4;&#x3B7;&#x3BD; Dry Feel Technology &#x3B8;&#x3B1; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AE;&#x3C3;&#x3BF;&#x3C5;&#x3BD; &#x3BA;&#x3B1;&#x3B8;&#x3B1;&#x3C1;&#x3AE; &#x3C4;&#x3B7; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE; &#x3C3;&#x3B1;&#x3C2; &#x3C7;&#x3C9;&#x3C1;&#x3AF;&#x3C2; &#x3BD;&#x3B1; &#x3B1;&#x3C6;&#x3AE;&#x3C3;&#x3BF;&#x3C5;&#x3BD; &#x3AF;&#x3C7;&#x3BD;&#x3B7;.</Description><Price>4.99</Price><Image>http://www.gricgroup.gr/media/catalog/product/z/3/z34zaggwipe.png</Image></product><product><SKU>ZAGG-WIPE-XL</SKU><Manufacturer>zagg</Manufacturer><Name>ZAGGwipes Antibacterial XL</Name><Description>&#x3A4;&#x3B1; &#x3BC;&#x3B5;&#x3B3;&#x3AC;&#x3BB;&#x3B1; gadgets &#x3B1;&#x3C0;&#x3B1;&#x3B9;&#x3C4;&#x3BF;&#x3CD;&#x3BD; &#x3BC;&#x3B5;&#x3B3;&#x3AC;&#x3BB;&#x3B1; &#x3BA;&#x3B1;&#x3B9; &#x3B9;&#x3C3;&#x3C7;&#x3C5;&#x3C1;&#x3AC; &#x3BC;&#x3B1;&#x3BD;&#x3C4;&#x3B7;&#x3BB;&#x3B1;&#x3BA;&#x3B9;&#x3B1; &#x3BA;&#x3B1;&#x3B8;&#x3B1;&#x3C1;&#x3B9;&#x3C3;&#x3BC;&#x3BF;&#x3CD;. &#x3A4;&#x3B1; ZAGGwipes XL &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3B5;&#x3B3;&#x3AC;&#x3BB;&#x3BF;&#x3C5; &#x3BC;&#x3B5;&#x3B3;&#x3AD;&#x3B8;&#x3BF;&#x3C5;&#x3C2; &#x3BC;&#x3B1;&#x3BD;&#x3C4;&#x3B7;&#x3BB;&#x3AC;&#x3BA;&#x3B9;&#x3B1; &#x3BA;&#x3B1;&#x3B8;&#x3B1;&#x3C1;&#x3B9;&#x3C3;&#x3BC;&#x3BF;&#x3CD; &#x3C0;&#x3BF;&#x3C5; &#x3B2;&#x3BF;&#x3B7;&#x3B8;&#x3BF;&#x3CD;&#x3BD; &#x3BD;&#x3B1; &#x3B1;&#x3C0;&#x3BF;&#x3BC;&#x3B1;&#x3BA;&#x3C1;&#x3CD;&#x3BD;&#x3B5;&#x3C4;&#x3B5; &#x3C4;&#x3B1; &#x3AF;&#x3C7;&#x3BD;&#x3B7; &#x3C4;&#x3BF;&#x3C5; &#x3B4;&#x3AD;&#x3C1;&#x3BC;&#x3B1;&#x3C4;&#x3BF;&#x3C2;, &#x3C4;&#x3B1; &#x3B4;&#x3B1;&#x3BA;&#x3C4;&#x3C5;&#x3BB;&#x3B9;&#x3BA;&#x3AC; &#x3B1;&#x3C0;&#x3BF;&#x3C4;&#x3C5;&#x3C0;&#x3CE;&#x3BC;&#x3B1;&#x3C4;&#x3B1;, &#x3C4;&#x3BF; &#x3BC;&#x3B1;&#x3BA;&#x3B9;&#x3B3;&#x3B9;&#x3AC;&#x3B6;, &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3BF;&#x3C5;&#x3C2; &#x3BB;&#x3B5;&#x3BA;&#x3AD;&#x3B4;&#x3B5;&#x3C2; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3B1; gadget &#x3C3;&#x3B1;&#x3C2;. &#x399;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3CC; &#x3B3;&#x3B9;&#x3B1; &#x3BC;&#x3B5;&#x3B3;&#x3AC;&#x3BB;&#x3B5;&#x3C2; &#x3B5;&#x3C0;&#x3B9;&#x3C6;&#x3AC;&#x3BD;&#x3B5;&#x3B9;&#x3B5;&#x3C2;, &#x3CC;&#x3C0;&#x3C9;&#x3C2; &#x3C4;&#x3BF; iPad &#x3C4;&#x3B7;&#x3C2; Apple, &#x3C6;&#x3BF;&#x3C1;&#x3B7;&#x3C4;&#x3BF;&#x3CD;&#x3C2; &#x3C5;&#x3C0;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B9;&#x3C3;&#x3C4;&#x3AD;&#x3C2;, e-book readers, &#x3BA;&#x3B1;&#x3B9; &#x3BF;&#x3B8;&#x3CC;&#x3BD;&#x3B5;&#x3C2; &#x3C5;&#x3C0;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B9;&#x3C3;&#x3C4;&#x3CE;&#x3BD;, &#x3A4;&#x3B1; ZAGGwipes XL &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3BF;&#x3CD;&#x3BD; &#x3C4;&#x3B9;&#x3C2; &#x3BF;&#x3B8;&#x3CC;&#x3BD;&#x3B5;&#x3C2; &#x3B1;&#x3C6;&#x3AE;&#x3C2; &#x3C7;&#x3C9;&#x3C1;&#x3AF;&#x3C2; &#x3BC;&#x3BF;&#x3C5;&#x3C4;&#x3B6;&#x3BF;&#x3CD;&#x3C1;&#x3B5;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3BA;&#x3B1;&#x3B8;&#x3B1;&#x3C1;&#x3AD;&#x3C2;. &#x39C;&#x3B5; 15 &#x3BC;&#x3B5;&#x3B3;&#x3AC;&#x3BB;&#x3B1; &#x3BC;&#x3B1;&#x3BD;&#x3C4;&#x3B7;&#x3BB;&#x3AC;&#x3BA;&#x3B9;&#x3B1; &#x3C3;&#x3B5; &#x3BA;&#x3AC;&#x3B8;&#x3B5; on-the-go &#x3C0;&#x3B1;&#x3BA;&#x3AD;&#x3C4;&#x3BF;, &#x3C4;&#x3B1; ZAGGwipes XL &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3AD;&#x3BD;&#x3B1;&#x3C2; &#x3B2;&#x3BF;&#x3BB;&#x3B9;&#x3BA;&#x3CC;&#x3C2; &#x3C4;&#x3C1;&#x3CC;&#x3C0;&#x3BF;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AE;&#x3C3;&#x3B5;&#x3C4;&#x3B5; &#x3C4;&#x3B7;&#x3BD; &#x3BF;&#x3B8;&#x3CC;&#x3BD;&#x3B7; &#x3C3;&#x3B1;&#x3C2; &#x3BA;&#x3B1;&#x3B8;&#x3B1;&#x3C1;&#x3AE; &#x3CC;&#x3C0;&#x3BF;&#x3C5; &#x3BA;&#x3B9; &#x3B1;&#x3BD; &#x3C0;&#x3AC;&#x3C4;&#x3B5;.</Description><Price>9.99</Price><Image>http://www.gricgroup.gr/media/catalog/product/z/3/z34xlzaggwipe.png</Image></product><product><SKU>ZAGG-KUNI-BLK</SKU><Manufacturer>zagg</Manufacturer><Name>ZAGGkeys Universal Black Keyboard</Name><Description>&#x3A0;&#x3B1;&#x3C1;&#x3BF;&#x3C5;&#x3C3;&#x3B9;&#x3AC;&#x3B6;&#x3BF;&#x3BD;&#x3C4;&#x3B1;&#x3C2; &#x3C4;&#x3BF; &#x3C0;&#x3B9;&#x3BF; &#x3B5;&#x3C5;&#x3AD;&#x3BB;&#x3B9;&#x3BA;&#x3C4;&#x3BF; iOS, Windows &#x3BA;&#x3B1;&#x3B9; Android Bluetooth &#xAE; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3CC;&#x3B3;&#x3B9;&#x3BF;. &#x3A4;&#x3BF; ZAGG Universal &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BA;&#x3B1;&#x3C4;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3B1;&#x3C3;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3BC;&#x3B5; &#x3C7;&#x3B1;&#x3C1;&#x3B1;&#x3BA;&#x3C4;&#x3B7;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3BA;&#x3B1;&#x3B9;&#x3BD;&#x3BF;&#x3C4;&#x3CC;&#x3BC;&#x3BF;&#x3C5; &#x3C0;&#x3C1;&#x3BF;&#x3B3;&#x3C1;&#x3B1;&#x3BC;&#x3BC;&#x3B1;&#x3C4;&#x3B9;&#x3C3;&#x3BC;&#x3BF;&#x3CD; &#x3C0;&#x3BF;&#x3C5; &#x3C4;&#x3BF;&#x3C5; &#x3B5;&#x3C0;&#x3B9;&#x3C4;&#x3C1;&#x3AD;&#x3C0;&#x3BF;&#x3C5;&#x3BD; &#x3BD;&#x3B1; &#x3BB;&#x3B5;&#x3B9;&#x3C4;&#x3BF;&#x3C5;&#x3C1;&#x3B3;&#x3B5;&#x3AF; &#x3BC;&#x3B5; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3CC;&#x3BD; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B1;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE;, &#x3C3;&#x3B5; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B1;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3C0;&#x3BB;&#x3B1;&#x3C4;&#x3C6;&#x3CC;&#x3C1;&#x3BC;&#x3B1;. &#x395;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B7; &#x3B5;&#x3BD;&#x3B1;&#x3BB;&#x3BB;&#x3B1;&#x3B3;&#x3AE; &#x3BC;&#x3B5;&#x3C4;&#x3B1;&#x3BE;&#x3CD; iOS, Android &#x3BA;&#x3B1;&#x3B9; Windows &#x3BB;&#x3B5;&#x3B9;&#x3C4;&#x3BF;&#x3C5;&#x3C1;&#x3B3;&#x3B9;&#x3BA;&#x3CE;&#x3BD; &#x3C3;&#x3C5;&#x3C3;&#x3C4;&#x3B7;&#x3BC;&#x3AC;&#x3C4;&#x3C9;&#x3BD; &#x3BC;&#x3B5; &#x3AD;&#x3BD;&#x3B1; &#x3B1;&#x3C0;&#x3BB;&#x3CC; &#x3B4;&#x3B9;&#x3B1;&#x3BA;&#x3CC;&#x3C0;&#x3C4;&#x3B7;, &#x3BA;&#x3B1;&#x3B9; &#x3C3;&#x3C4;&#x3B7; &#x3C3;&#x3C5;&#x3BD;&#x3AD;&#x3C7;&#x3B5;&#x3B9;&#x3B1; &#x3BC;&#x3C0;&#x3BF;&#x3C1;&#x3B5;&#x3AF;&#x3C4;&#x3B5;  &#x3BD;&#x3B1; &#x3B1;&#x3C0;&#x3BF;&#x3BB;&#x3B1;&#x3CD;&#x3C3;&#x3B5;&#x3C4;&#x3B5; &#x3C4;&#x3B7;&#x3BD; &#x3AC;&#x3BD;&#x3B5;&#x3C3;&#x3B7; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3B7;&#x3BD; &#x3B5;&#x3C1;&#x3B3;&#x3BF;&#x3BD;&#x3BF;&#x3BC;&#x3B9;&#x3BA;&#x3AE; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3AF;&#x3B1;&#x3C3;&#x3B7; &#x3C0;&#x3BF;&#x3C5; &#x3C3;&#x3B1;&#x3C2; &#x3C0;&#x3B1;&#x3C1;&#x3AD;&#x3C7;&#x3B5;&#x3B9; &#x3B5;&#x3BD;&#x3CE; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B5;&#x3AF;&#x3C4;&#x3B5;. &#x3A4;&#x3B1; Island-style &#x3C0;&#x3BB;&#x3AE;&#x3BA;&#x3C4;&#x3C1;&#x3B1; &#x3C0;&#x3B1;&#x3C1;&#x3AD;&#x3C7;&#x3BF;&#x3C5;&#x3BD; &#x3B1;&#x3C1;&#x3BA;&#x3B5;&#x3C4;&#x3CC; &#x3C7;&#x3CE;&#x3C1;&#x3BF; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3AE;&#x3C3;&#x3B5;&#x3C4;&#x3B5;, &#x3CE;&#x3C3;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3BC;&#x3C0;&#x3BF;&#x3C1;&#x3B5;&#x3AF;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B5;&#x3AF;&#x3C4;&#x3B5; &#x3C4;&#x3B1;&#x3C7;&#x3CD;&#x3C4;&#x3B5;&#x3C1;&#x3B1; &#x3BA;&#x3B1;&#x3B9; &#x3BC;&#x3B5; &#x3BB;&#x3B9;&#x3B3;&#x3CC;&#x3C4;&#x3B5;&#x3C1;&#x3B1; &#x3BB;&#x3AC;&#x3B8;&#x3B7; &#x3B1;&#x3C0;&#x3CC; &#x3CC;, &#x3C4;&#x3B9; &#x3AC;&#x3BB;&#x3BB;&#x3B1; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3CC;&#x3B3;&#x3B9;&#x3B1; Bluetooth &#xAE;. &#x397; &#x3B1;&#x3BD;&#x3B8;&#x3B5;&#x3BA;&#x3C4;&#x3B9;&#x3BA;&#x3AE; &#x3B8;&#x3AE;&#x3BA;&#x3B7; &#x3C4;&#x3BF;&#x3C5; Universal &#x3B4;&#x3AF;&#x3BD;&#x3B5;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x3B2;&#x3BF;&#x3BB;&#x3B9;&#x3BA;&#x3AE; &#x3C3;&#x3C4;&#x3AC;&#x3C3;&#x3B7; &#x3C3;&#x3C4;&#x3B7; &#x3C3;&#x3C5;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3AE; &#x3C3;&#x3B1;&#x3C2; &#x3CE;&#x3C3;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3BC;&#x3C0;&#x3BF;&#x3C1;&#x3B5;&#x3AF;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3C1;&#x3C5;&#x3B8;&#x3BC;&#x3AF;&#x3C3;&#x3B5;&#x3C4;&#x3B5; &#x3C4;&#x3BF; &#x3BA;&#x3B9;&#x3BD;&#x3B7;&#x3C4;&#x3CC; &#x3B3;&#x3C1;&#x3B1;&#x3C6;&#x3B5;&#x3AF;&#x3BF; &#x3C3;&#x3B1;&#x3C2; &#x3BF;&#x3C0;&#x3BF;&#x3C5;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3BA;&#x3B1;&#x3B9; &#x3B1;&#x3BD; &#x3B2;&#x3C1;&#x3AF;&#x3C3;&#x3BA;&#x3B5;&#x3C3;&#x3C4;&#x3B5;. &#x397; &#x3BC;&#x3C0;&#x3B1;&#x3C4;&#x3B1;&#x3C1;&#x3AF;&#x3B1; &#x3C0;&#x3BF;&#x3C5; &#x3B4;&#x3B9;&#x3B1;&#x3C1;&#x3BA;&#x3B5;&#x3AF; &#x3BC;&#x3AD;&#x3C7;&#x3C1;&#x3B9; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3C1;&#x3B5;&#x3B9;&#x3C2; &#x3BC;&#x3AE;&#x3BD;&#x3B5;&#x3C2; &#x3C4;&#x3B1;&#x3BA;&#x3C4;&#x3B9;&#x3BA;&#x3AE;&#x3C2; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3B7;&#x3C2;* &#x3B1;&#x3BD;&#x3AC; &#x3C6;&#x3CC;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3B7;, &#x3C3;&#x3B1;&#x3C2; &#x3B4;&#x3AF;&#x3BD;&#x3B5;&#x3B9; &#x3C4;&#x3B7; &#x3B4;&#x3C5;&#x3BD;&#x3B1;&#x3C4;&#x3CC;&#x3C4;&#x3B7;&#x3C4;&#x3B1; &#x3BD;&#x3B1; &#x3BC;&#x3C0;&#x3BF;&#x3C1;&#x3B5;&#x3AF;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3C3;&#x3C4;&#x3B5;&#x3AF;&#x3C4;&#x3B5; &#x3C3;&#x3B5; &#x3C0;&#x3BF;&#x3BB;&#x3BB;&#x3AC; &#x3BC;&#x3AD;&#x3C1;&#x3B7; &#x3C7;&#x3C9;&#x3C1;&#x3AF;&#x3C2; &#x3BD;&#x3B1; &#x3B1;&#x3BD;&#x3B7;&#x3C3;&#x3C5;&#x3C7;&#x3B5;&#x3AF;&#x3C4;&#x3B5; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7; &#x3C6;&#x3CC;&#x3C1;&#x3C4;&#x3B9;&#x3C3;&#x3B7; &#x3C4;&#x3BF;&#x3C5; Universal &#x3C3;&#x3B1;&#x3C2;.</Description><Price>69.99</Price><Image>http://www.gricgroup.gr/media/catalog/product/i/m/img_0990.jpg</Image></product><product><SKU>ZAGG-KFOLiP-BLK</SKU><Manufacturer>zagg</Manufacturer><Name>ZAGGkeys Folio Black with Backlit Keyboard (Apple iPad Air)</Name><Description>&#x3A4;&#x3BF; &#x3BD;&#x3AD;&#x3BF; ZAGGkeys Folio &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3AD;&#x3BD;&#x3B1; &#x3B1;&#x3C0;&#x3BB;&#x3CC; &#x3BB;&#x3B5;&#x3C0;&#x3C4;&#x3CC;, &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3CD;&#x3C7;&#x3C1;&#x3B7;&#x3C3;&#x3C4;&#x3BF; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3CC;&#x3B3;&#x3B9;&#x3BF;.  &#x391;&#x3BB;&#x3BB;&#x3AC; &#x3B5;&#x3BD;&#x3CE; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC; &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3BF; &#x3C3;&#x3C4;&#x3B7; &#x3BC;&#x3B5;&#x3C4;&#x3B1;&#x3C6;&#x3BF;&#x3C1;&#x3AC; &#x3C4;&#x3BF;&#x3C5;, &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C6;&#x3AD;&#x3C1;&#x3B5;&#x3B9; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3C1;&#x3B1;&#x3B3;&#x3BC;&#x3B1;&#x3C4;&#x3B9;&#x3BA;&#x3CC;&#x3C4;&#x3B7;&#x3C4;&#x3B1; 30% &#x3C0;&#x3B5;&#x3C1;&#x3B9;&#x3C3;&#x3C3;&#x3CC;&#x3C4;&#x3B5;&#x3C1;&#x3BF; &#x3C7;&#x3CE;&#x3C1;&#x3BF; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3CC;&#x3B3;&#x3B7;&#x3C3;&#x3B7; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3BF;&#x3BD; &#x3B1;&#x3BD;&#x3C4;&#x3B1;&#x3B3;&#x3C9;&#x3BD;&#x3B9;&#x3C3;&#x3BC;&#x3CC;. &#x395;&#x3C0;&#x3B9;&#x3C0;&#x3BB;&#x3AD;&#x3BF;&#x3BD;, &#x3B4;&#x3B9;&#x3B1;&#x3B8;&#x3AD;&#x3C4;&#x3B5;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x3C0;&#x3B5;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3C1;&#x3B5;&#x3C6;&#x3CC;&#x3BC;&#x3B5;&#x3BD;&#x3B7; &#x3AC;&#x3C1;&#x3B8;&#x3C1;&#x3C9;&#x3C3;&#x3B7; &#x3C0;&#x3BF;&#x3C5; &#x3C3;&#x3B1;&#x3C2; &#x3B5;&#x3C0;&#x3B9;&#x3C4;&#x3C1;&#x3AD;&#x3C0;&#x3B5;&#x3B9; &#x3BD;&#x3B1; &#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B8;&#x3B5;&#x3C4;&#x3AE;&#x3C3;&#x3B5;&#x3C4;&#x3B5; &#x3C4;&#x3BF; iPad &#x3C3;&#x3B1;&#x3C2; &#x3C3;&#x3B5; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3CC;&#x3BD; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B1;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3B3;&#x3C9;&#x3BD;&#x3AF;&#x3B1; &#x3B8;&#x3AD;&#x3B1;&#x3C3;&#x3B7;&#x3C2;, &#x3B1;&#x3BA;&#x3C1;&#x3B9;&#x3B2;&#x3CE;&#x3C2; &#x3CC;&#x3C0;&#x3C9;&#x3C2; &#x3BC;&#x3B9;&#x3B1; &#x3BF;&#x3B8;&#x3CC;&#x3BD;&#x3B7; &#x3C6;&#x3BF;&#x3C1;&#x3B7;&#x3C4;&#x3BF;&#x3CD; &#x3C5;&#x3C0;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B9;&#x3C3;&#x3C4;&#x3AE;. &#x391;&#x3BD;&#x3BF;&#x3AF;&#x3BE;&#x3C4;&#x3B5; &#x3C4;&#x3BF; iPad &#x3C3;&#x3B1;&#x3C2;, &#x3C1;&#x3C5;&#x3B8;&#x3BC;&#x3AF;&#x3C3;&#x3C4;&#x3B5; &#x3C4;&#x3B7;&#x3BD; &#x3B5;&#x3C0;&#x3B9;&#x3B8;&#x3C5;&#x3BC;&#x3B7;&#x3C4;&#x3AE; &#x3B3;&#x3C9;&#x3BD;&#x3AF;&#x3B1;, &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3AF;&#x3C3;&#x3C4;&#x3B5; &#x3AD;&#x3C4;&#x3BF;&#x3B9;&#x3BC;&#x3BF;&#x3B9; &#x3BD;&#x3B1; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B5;&#x3AF;&#x3C4;&#x3B5; &#x3BC;&#x3B5; &#x3AC;&#x3BD;&#x3B5;&#x3C3;&#x3B7;.&#xD;
&#x3A4;&#x3BF; Folio &#x3B4;&#x3B9;&#x3B1;&#x3B8;&#x3AD;&#x3C4;&#x3B5;&#x3B9; &#x3B9;&#x3C3;&#x3C7;&#x3C5;&#x3C1;&#x3AE; &#x3BC;&#x3C0;&#x3B1;&#x3C4;&#x3B1;&#x3C1;&#x3AF;&#x3B1; &#x3C0;&#x3BF;&#x3C5; &#x3B8;&#x3B1; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AE;&#x3C3;&#x3B5;&#x3B9; &#x3C4;&#x3B7;&#x3BD; &#x3C4;&#x3C1;&#x3BF;&#x3C6;&#x3BF;&#x3B4;&#x3BF;&#x3C3;&#x3AF;&#x3B1; &#x3AD;&#x3C9;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3C1;&#x3B5;&#x3B9;&#x3C2; &#x3BC;&#x3AE;&#x3BD;&#x3B5;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3C4;&#x3B7;&#x3BC;&#x3B1;&#x3C4;&#x3B9;&#x3BA;&#x3AE;&#x3C2; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3B7;&#x3C2; &#x3BC;&#x3B5;&#x3C4;&#x3B1;&#x3BE;&#x3CD; &#x3C4;&#x3C9;&#x3BD; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3AF;&#x3C3;&#x3B5;&#x3C9;&#x3BD; *. &#x395;&#x3C0;&#x3B9;&#x3C0;&#x3BB;&#x3AD;&#x3BF;&#x3BD;, &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C6;&#x3AD;&#x3C1;&#x3B5;&#x3B9; &#x3C6;&#x3C9;&#x3C4;&#x3B9;&#x3B6;&#x3CC;&#x3BC;&#x3B5;&#x3BD;&#x3B1; &#x3C0;&#x3BB;&#x3AE;&#x3BA;&#x3C4;&#x3C1;&#x3B1; &#x3C0;&#x3BF;&#x3C5; &#x3BA;&#x3AC;&#x3BD;&#x3BF;&#x3C5;&#x3BD; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3CC;&#x3B3;&#x3B7;&#x3C3;&#x3B7; &#x3C3;&#x3B5; &#x3C0;&#x3B5;&#x3C1;&#x3B9;&#x3BF;&#x3C7;&#x3AD;&#x3C2; &#x3C7;&#x3B1;&#x3BC;&#x3B7;&#x3BB;&#x3BF;&#x3CD; &#x3C6;&#x3C9;&#x3C4;&#x3B9;&#x3C3;&#x3BC;&#x3BF;&#x3CD; &#x3C0;&#x3BF;&#x3BB;&#x3CD; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B1; &#x3BC;&#x3AC;&#x3C4;&#x3B9;&#x3B1;. &#x39C;&#x3B5; &#x3B1;&#x3C5;&#x3C4;&#x3AC; &#x3C4;&#x3B1; &#x3C7;&#x3B1;&#x3C1;&#x3B1;&#x3BA;&#x3C4;&#x3B7;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC;, &#x3BA;&#x3B1;&#x3B9; &#x3C0;&#x3BF;&#x3BB;&#x3BB;&#x3AC; &#x3AC;&#x3BB;&#x3BB;&#x3B1;, &#x3C4;&#x3BF; ZAGGkeys Folio &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B7; - &#x3CC;&#x3BB;&#x3B1; &#x3C3;&#x3B5; &#x3AD;&#x3BD;&#x3B1; - &#x3BB;&#x3CD;&#x3C3;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3CC;&#x3B3;&#x3B7;&#x3C3;&#x3B7; &#x3CC;&#x3C0;&#x3BF;&#x3C5; &#x3BA;&#x3B9; &#x3B1;&#x3BD; &#x3B2;&#x3C1;&#x3AF;&#x3C3;&#x3BA;&#x3B5;&#x3C3;&#x3C4;&#x3B5;.</Description><Price>99.99</Price><Image>http://www.gricgroup.gr/media/catalog/product/z/3/z34zkfhfbklit105.png</Image></product><product><SKU>ZAGG-KFOLiPM</SKU><Manufacturer>zagg</Manufacturer><Name>ZAGGkeys - Folio with Backlit Keyboard (Apple iPad mini)</Name><Description>&#x3A4;&#x3BF; &#x3BD;&#x3AD;&#x3BF; ZAGGkeys Folio &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3AD;&#x3BD;&#x3B1; &#x3B1;&#x3C0;&#x3BB;&#x3CC; &#x3BB;&#x3B5;&#x3C0;&#x3C4;&#x3CC;, &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3CD;&#x3C7;&#x3C1;&#x3B7;&#x3C3;&#x3C4;&#x3BF; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3CC;&#x3B3;&#x3B9;&#x3BF;.  &#x391;&#x3BB;&#x3BB;&#x3AC; &#x3B5;&#x3BD;&#x3CE; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC; &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3BF; &#x3C3;&#x3C4;&#x3B7; &#x3BC;&#x3B5;&#x3C4;&#x3B1;&#x3C6;&#x3BF;&#x3C1;&#x3AC; &#x3C4;&#x3BF;&#x3C5;, &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C6;&#x3AD;&#x3C1;&#x3B5;&#x3B9; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3C1;&#x3B1;&#x3B3;&#x3BC;&#x3B1;&#x3C4;&#x3B9;&#x3BA;&#x3CC;&#x3C4;&#x3B7;&#x3C4;&#x3B1; 30% &#x3C0;&#x3B5;&#x3C1;&#x3B9;&#x3C3;&#x3C3;&#x3CC;&#x3C4;&#x3B5;&#x3C1;&#x3BF; &#x3C7;&#x3CE;&#x3C1;&#x3BF; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3CC;&#x3B3;&#x3B7;&#x3C3;&#x3B7; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3BF;&#x3BD; &#x3B1;&#x3BD;&#x3C4;&#x3B1;&#x3B3;&#x3C9;&#x3BD;&#x3B9;&#x3C3;&#x3BC;&#x3CC;. &#x395;&#x3C0;&#x3B9;&#x3C0;&#x3BB;&#x3AD;&#x3BF;&#x3BD;, &#x3B4;&#x3B9;&#x3B1;&#x3B8;&#x3AD;&#x3C4;&#x3B5;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x3C0;&#x3B5;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3C1;&#x3B5;&#x3C6;&#x3CC;&#x3BC;&#x3B5;&#x3BD;&#x3B7; &#x3AC;&#x3C1;&#x3B8;&#x3C1;&#x3C9;&#x3C3;&#x3B7; &#x3C0;&#x3BF;&#x3C5; &#x3C3;&#x3B1;&#x3C2; &#x3B5;&#x3C0;&#x3B9;&#x3C4;&#x3C1;&#x3AD;&#x3C0;&#x3B5;&#x3B9; &#x3BD;&#x3B1; &#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B8;&#x3B5;&#x3C4;&#x3AE;&#x3C3;&#x3B5;&#x3C4;&#x3B5; &#x3C4;&#x3BF; iPad &#x3C3;&#x3B1;&#x3C2; &#x3C3;&#x3B5; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3CC;&#x3BD; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B1;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3B3;&#x3C9;&#x3BD;&#x3AF;&#x3B1; &#x3B8;&#x3AD;&#x3B1;&#x3C3;&#x3B7;&#x3C2;, &#x3B1;&#x3BA;&#x3C1;&#x3B9;&#x3B2;&#x3CE;&#x3C2; &#x3CC;&#x3C0;&#x3C9;&#x3C2; &#x3BC;&#x3B9;&#x3B1; &#x3BF;&#x3B8;&#x3CC;&#x3BD;&#x3B7; &#x3C6;&#x3BF;&#x3C1;&#x3B7;&#x3C4;&#x3BF;&#x3CD; &#x3C5;&#x3C0;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B9;&#x3C3;&#x3C4;&#x3AE;. &#x391;&#x3BD;&#x3BF;&#x3AF;&#x3BE;&#x3C4;&#x3B5; &#x3C4;&#x3BF; iPad &#x3C3;&#x3B1;&#x3C2;, &#x3C1;&#x3C5;&#x3B8;&#x3BC;&#x3AF;&#x3C3;&#x3C4;&#x3B5; &#x3C4;&#x3B7;&#x3BD; &#x3B5;&#x3C0;&#x3B9;&#x3B8;&#x3C5;&#x3BC;&#x3B7;&#x3C4;&#x3AE; &#x3B3;&#x3C9;&#x3BD;&#x3AF;&#x3B1;, &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3AF;&#x3C3;&#x3C4;&#x3B5; &#x3AD;&#x3C4;&#x3BF;&#x3B9;&#x3BC;&#x3BF;&#x3B9; &#x3BD;&#x3B1; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B5;&#x3AF;&#x3C4;&#x3B5; &#x3BC;&#x3B5; &#x3AC;&#x3BD;&#x3B5;&#x3C3;&#x3B7;.&#xD;
&#x3A4;&#x3BF; Folio &#x3B4;&#x3B9;&#x3B1;&#x3B8;&#x3AD;&#x3C4;&#x3B5;&#x3B9; &#x3B9;&#x3C3;&#x3C7;&#x3C5;&#x3C1;&#x3AE; &#x3BC;&#x3C0;&#x3B1;&#x3C4;&#x3B1;&#x3C1;&#x3AF;&#x3B1; &#x3C0;&#x3BF;&#x3C5; &#x3B8;&#x3B1; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AE;&#x3C3;&#x3B5;&#x3B9; &#x3C4;&#x3B7;&#x3BD; &#x3C4;&#x3C1;&#x3BF;&#x3C6;&#x3BF;&#x3B4;&#x3BF;&#x3C3;&#x3AF;&#x3B1; &#x3AD;&#x3C9;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3C1;&#x3B5;&#x3B9;&#x3C2; &#x3BC;&#x3AE;&#x3BD;&#x3B5;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3C4;&#x3B7;&#x3BC;&#x3B1;&#x3C4;&#x3B9;&#x3BA;&#x3AE;&#x3C2; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3B7;&#x3C2; &#x3BC;&#x3B5;&#x3C4;&#x3B1;&#x3BE;&#x3CD; &#x3C4;&#x3C9;&#x3BD; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3AF;&#x3C3;&#x3B5;&#x3C9;&#x3BD; *. &#x395;&#x3C0;&#x3B9;&#x3C0;&#x3BB;&#x3AD;&#x3BF;&#x3BD;, &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C6;&#x3AD;&#x3C1;&#x3B5;&#x3B9; &#x3C6;&#x3C9;&#x3C4;&#x3B9;&#x3B6;&#x3CC;&#x3BC;&#x3B5;&#x3BD;&#x3B1; &#x3C0;&#x3BB;&#x3AE;&#x3BA;&#x3C4;&#x3C1;&#x3B1; &#x3C0;&#x3BF;&#x3C5; &#x3BA;&#x3AC;&#x3BD;&#x3BF;&#x3C5;&#x3BD; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3CC;&#x3B3;&#x3B7;&#x3C3;&#x3B7; &#x3C3;&#x3B5; &#x3C0;&#x3B5;&#x3C1;&#x3B9;&#x3BF;&#x3C7;&#x3AD;&#x3C2; &#x3C7;&#x3B1;&#x3BC;&#x3B7;&#x3BB;&#x3BF;&#x3CD; &#x3C6;&#x3C9;&#x3C4;&#x3B9;&#x3C3;&#x3BC;&#x3BF;&#x3CD; &#x3C0;&#x3BF;&#x3BB;&#x3CD; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B1; &#x3BC;&#x3AC;&#x3C4;&#x3B9;&#x3B1;. &#x39C;&#x3B5; &#x3B1;&#x3C5;&#x3C4;&#x3AC; &#x3C4;&#x3B1; &#x3C7;&#x3B1;&#x3C1;&#x3B1;&#x3BA;&#x3C4;&#x3B7;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC;, &#x3BA;&#x3B1;&#x3B9; &#x3C0;&#x3BF;&#x3BB;&#x3BB;&#x3AC; &#x3AC;&#x3BB;&#x3BB;&#x3B1;, &#x3C4;&#x3BF; ZAGGkeys Folio &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B7; - &#x3CC;&#x3BB;&#x3B1; &#x3C3;&#x3B5; &#x3AD;&#x3BD;&#x3B1; - &#x3BB;&#x3CD;&#x3C3;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3CC;&#x3B3;&#x3B7;&#x3C3;&#x3B7; &#x3CC;&#x3C0;&#x3BF;&#x3C5; &#x3BA;&#x3B9; &#x3B1;&#x3BD; &#x3B2;&#x3C1;&#x3AF;&#x3C3;&#x3BA;&#x3B5;&#x3C3;&#x3C4;&#x3B5;.</Description><Price>99.99</Price><Image>http://www.gricgroup.gr/media/catalog/product/z/3/z34zkmhfbklit103.png</Image></product><product><SKU>ZAGG-KFOLiPM-BK</SKU><Manufacturer>zagg</Manufacturer><Name>ZAGGkeys - Folio with Backlit Keyboard (Apple iPad mini) - Black</Name><Description>&#x3A4;&#x3BF; &#x3BD;&#x3AD;&#x3BF; ZAGGkeys Folio &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3AD;&#x3BD;&#x3B1; &#x3B1;&#x3C0;&#x3BB;&#x3CC; &#x3BB;&#x3B5;&#x3C0;&#x3C4;&#x3CC;, &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3CD;&#x3C7;&#x3C1;&#x3B7;&#x3C3;&#x3C4;&#x3BF; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3CC;&#x3B3;&#x3B9;&#x3BF;.  &#x391;&#x3BB;&#x3BB;&#x3AC; &#x3B5;&#x3BD;&#x3CE; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC; &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3BF; &#x3C3;&#x3C4;&#x3B7; &#x3BC;&#x3B5;&#x3C4;&#x3B1;&#x3C6;&#x3BF;&#x3C1;&#x3AC; &#x3C4;&#x3BF;&#x3C5;, &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C6;&#x3AD;&#x3C1;&#x3B5;&#x3B9; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3C1;&#x3B1;&#x3B3;&#x3BC;&#x3B1;&#x3C4;&#x3B9;&#x3BA;&#x3CC;&#x3C4;&#x3B7;&#x3C4;&#x3B1; 30% &#x3C0;&#x3B5;&#x3C1;&#x3B9;&#x3C3;&#x3C3;&#x3CC;&#x3C4;&#x3B5;&#x3C1;&#x3BF; &#x3C7;&#x3CE;&#x3C1;&#x3BF; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3CC;&#x3B3;&#x3B7;&#x3C3;&#x3B7; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3BF;&#x3BD; &#x3B1;&#x3BD;&#x3C4;&#x3B1;&#x3B3;&#x3C9;&#x3BD;&#x3B9;&#x3C3;&#x3BC;&#x3CC;. &#x395;&#x3C0;&#x3B9;&#x3C0;&#x3BB;&#x3AD;&#x3BF;&#x3BD;, &#x3B4;&#x3B9;&#x3B1;&#x3B8;&#x3AD;&#x3C4;&#x3B5;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x3C0;&#x3B5;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3C1;&#x3B5;&#x3C6;&#x3CC;&#x3BC;&#x3B5;&#x3BD;&#x3B7; &#x3AC;&#x3C1;&#x3B8;&#x3C1;&#x3C9;&#x3C3;&#x3B7; &#x3C0;&#x3BF;&#x3C5; &#x3C3;&#x3B1;&#x3C2; &#x3B5;&#x3C0;&#x3B9;&#x3C4;&#x3C1;&#x3AD;&#x3C0;&#x3B5;&#x3B9; &#x3BD;&#x3B1; &#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B8;&#x3B5;&#x3C4;&#x3AE;&#x3C3;&#x3B5;&#x3C4;&#x3B5; &#x3C4;&#x3BF; iPad &#x3C3;&#x3B1;&#x3C2; &#x3C3;&#x3B5; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3CC;&#x3BD; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B1;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3B3;&#x3C9;&#x3BD;&#x3AF;&#x3B1; &#x3B8;&#x3AD;&#x3B1;&#x3C3;&#x3B7;&#x3C2;, &#x3B1;&#x3BA;&#x3C1;&#x3B9;&#x3B2;&#x3CE;&#x3C2; &#x3CC;&#x3C0;&#x3C9;&#x3C2; &#x3BC;&#x3B9;&#x3B1; &#x3BF;&#x3B8;&#x3CC;&#x3BD;&#x3B7; &#x3C6;&#x3BF;&#x3C1;&#x3B7;&#x3C4;&#x3BF;&#x3CD; &#x3C5;&#x3C0;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B9;&#x3C3;&#x3C4;&#x3AE;. &#x391;&#x3BD;&#x3BF;&#x3AF;&#x3BE;&#x3C4;&#x3B5; &#x3C4;&#x3BF; iPad &#x3C3;&#x3B1;&#x3C2;, &#x3C1;&#x3C5;&#x3B8;&#x3BC;&#x3AF;&#x3C3;&#x3C4;&#x3B5; &#x3C4;&#x3B7;&#x3BD; &#x3B5;&#x3C0;&#x3B9;&#x3B8;&#x3C5;&#x3BC;&#x3B7;&#x3C4;&#x3AE; &#x3B3;&#x3C9;&#x3BD;&#x3AF;&#x3B1;, &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3AF;&#x3C3;&#x3C4;&#x3B5; &#x3AD;&#x3C4;&#x3BF;&#x3B9;&#x3BC;&#x3BF;&#x3B9; &#x3BD;&#x3B1; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B5;&#x3AF;&#x3C4;&#x3B5; &#x3BC;&#x3B5; &#x3AC;&#x3BD;&#x3B5;&#x3C3;&#x3B7;.&#xD;
&#x3A4;&#x3BF; Folio &#x3B4;&#x3B9;&#x3B1;&#x3B8;&#x3AD;&#x3C4;&#x3B5;&#x3B9; &#x3B9;&#x3C3;&#x3C7;&#x3C5;&#x3C1;&#x3AE; &#x3BC;&#x3C0;&#x3B1;&#x3C4;&#x3B1;&#x3C1;&#x3AF;&#x3B1; &#x3C0;&#x3BF;&#x3C5; &#x3B8;&#x3B1; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AE;&#x3C3;&#x3B5;&#x3B9; &#x3C4;&#x3B7;&#x3BD; &#x3C4;&#x3C1;&#x3BF;&#x3C6;&#x3BF;&#x3B4;&#x3BF;&#x3C3;&#x3AF;&#x3B1; &#x3AD;&#x3C9;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3C1;&#x3B5;&#x3B9;&#x3C2; &#x3BC;&#x3AE;&#x3BD;&#x3B5;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3C4;&#x3B7;&#x3BC;&#x3B1;&#x3C4;&#x3B9;&#x3BA;&#x3AE;&#x3C2; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3B7;&#x3C2; &#x3BC;&#x3B5;&#x3C4;&#x3B1;&#x3BE;&#x3CD; &#x3C4;&#x3C9;&#x3BD; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3AF;&#x3C3;&#x3B5;&#x3C9;&#x3BD; *. &#x395;&#x3C0;&#x3B9;&#x3C0;&#x3BB;&#x3AD;&#x3BF;&#x3BD;, &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C6;&#x3AD;&#x3C1;&#x3B5;&#x3B9; &#x3C6;&#x3C9;&#x3C4;&#x3B9;&#x3B6;&#x3CC;&#x3BC;&#x3B5;&#x3BD;&#x3B1; &#x3C0;&#x3BB;&#x3AE;&#x3BA;&#x3C4;&#x3C1;&#x3B1; &#x3C0;&#x3BF;&#x3C5; &#x3BA;&#x3AC;&#x3BD;&#x3BF;&#x3C5;&#x3BD; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3CC;&#x3B3;&#x3B7;&#x3C3;&#x3B7; &#x3C3;&#x3B5; &#x3C0;&#x3B5;&#x3C1;&#x3B9;&#x3BF;&#x3C7;&#x3AD;&#x3C2; &#x3C7;&#x3B1;&#x3BC;&#x3B7;&#x3BB;&#x3BF;&#x3CD; &#x3C6;&#x3C9;&#x3C4;&#x3B9;&#x3C3;&#x3BC;&#x3BF;&#x3CD; &#x3C0;&#x3BF;&#x3BB;&#x3CD; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B1; &#x3BC;&#x3AC;&#x3C4;&#x3B9;&#x3B1;. &#x39C;&#x3B5; &#x3B1;&#x3C5;&#x3C4;&#x3AC; &#x3C4;&#x3B1; &#x3C7;&#x3B1;&#x3C1;&#x3B1;&#x3BA;&#x3C4;&#x3B7;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC;, &#x3BA;&#x3B1;&#x3B9; &#x3C0;&#x3BF;&#x3BB;&#x3BB;&#x3AC; &#x3AC;&#x3BB;&#x3BB;&#x3B1;, &#x3C4;&#x3BF; ZAGGkeys Folio &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B7; - &#x3CC;&#x3BB;&#x3B1; &#x3C3;&#x3B5; &#x3AD;&#x3BD;&#x3B1; - &#x3BB;&#x3CD;&#x3C3;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3CC;&#x3B3;&#x3B7;&#x3C3;&#x3B7; &#x3CC;&#x3C0;&#x3BF;&#x3C5; &#x3BA;&#x3B9; &#x3B1;&#x3BD; &#x3B2;&#x3C1;&#x3AF;&#x3C3;&#x3BA;&#x3B5;&#x3C3;&#x3C4;&#x3B5;.</Description><Price>99.99</Price><Image>http://www.gricgroup.gr/media/catalog/product/z/3/z34zkmhfbklit103_1.png</Image></product><product><SKU>ZAGG-KCOViPM</SKU><Manufacturer>zagg</Manufacturer><Name>ZAGGkeys - Cover with Backlit Keyboard (Apple iPad mini)</Name><Description>&#x3A4;&#x3BF; &#x3BD;&#x3AD;&#x3BF; ZAGGkeys Cover &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3AD;&#x3BD;&#x3B1; &#x3B1;&#x3C0;&#x3BB;&#x3CC; &#x3BB;&#x3B5;&#x3C0;&#x3C4;&#x3CC;, &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3CD;&#x3C7;&#x3C1;&#x3B7;&#x3C3;&#x3C4;&#x3BF; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3CC;&#x3B3;&#x3B9;&#x3BF;.  &#x391;&#x3BB;&#x3BB;&#x3AC; &#x3B5;&#x3BD;&#x3CE; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC; &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3BF; &#x3C3;&#x3C4;&#x3B7; &#x3BC;&#x3B5;&#x3C4;&#x3B1;&#x3C6;&#x3BF;&#x3C1;&#x3AC; &#x3C4;&#x3BF;&#x3C5;, &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C6;&#x3AD;&#x3C1;&#x3B5;&#x3B9; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3C1;&#x3B1;&#x3B3;&#x3BC;&#x3B1;&#x3C4;&#x3B9;&#x3BA;&#x3CC;&#x3C4;&#x3B7;&#x3C4;&#x3B1; 30% &#x3C0;&#x3B5;&#x3C1;&#x3B9;&#x3C3;&#x3C3;&#x3CC;&#x3C4;&#x3B5;&#x3C1;&#x3BF; &#x3C7;&#x3CE;&#x3C1;&#x3BF; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3CC;&#x3B3;&#x3B7;&#x3C3;&#x3B7; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3BF;&#x3BD; &#x3B1;&#x3BD;&#x3C4;&#x3B1;&#x3B3;&#x3C9;&#x3BD;&#x3B9;&#x3C3;&#x3BC;&#x3CC;. &#x395;&#x3C0;&#x3B9;&#x3C0;&#x3BB;&#x3AD;&#x3BF;&#x3BD;, &#x3B4;&#x3B9;&#x3B1;&#x3B8;&#x3AD;&#x3C4;&#x3B5;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x3C0;&#x3B5;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3C1;&#x3B5;&#x3C6;&#x3CC;&#x3BC;&#x3B5;&#x3BD;&#x3B7; &#x3AC;&#x3C1;&#x3B8;&#x3C1;&#x3C9;&#x3C3;&#x3B7; &#x3C0;&#x3BF;&#x3C5; &#x3C3;&#x3B1;&#x3C2; &#x3B5;&#x3C0;&#x3B9;&#x3C4;&#x3C1;&#x3AD;&#x3C0;&#x3B5;&#x3B9; &#x3BD;&#x3B1; &#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B8;&#x3B5;&#x3C4;&#x3AE;&#x3C3;&#x3B5;&#x3C4;&#x3B5; &#x3C4;&#x3BF; iPad &#x3C3;&#x3B1;&#x3C2; &#x3C3;&#x3B5; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3CC;&#x3BD; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B1;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3B3;&#x3C9;&#x3BD;&#x3AF;&#x3B1; &#x3B8;&#x3AD;&#x3B1;&#x3C3;&#x3B7;&#x3C2;, &#x3B1;&#x3BA;&#x3C1;&#x3B9;&#x3B2;&#x3CE;&#x3C2; &#x3CC;&#x3C0;&#x3C9;&#x3C2; &#x3BC;&#x3B9;&#x3B1; &#x3BF;&#x3B8;&#x3CC;&#x3BD;&#x3B7; &#x3C6;&#x3BF;&#x3C1;&#x3B7;&#x3C4;&#x3BF;&#x3CD; &#x3C5;&#x3C0;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B9;&#x3C3;&#x3C4;&#x3AE;. &#x391;&#x3BD;&#x3BF;&#x3AF;&#x3BE;&#x3C4;&#x3B5; &#x3C4;&#x3BF; iPad &#x3C3;&#x3B1;&#x3C2;, &#x3C1;&#x3C5;&#x3B8;&#x3BC;&#x3AF;&#x3C3;&#x3C4;&#x3B5; &#x3C4;&#x3B7;&#x3BD; &#x3B5;&#x3C0;&#x3B9;&#x3B8;&#x3C5;&#x3BC;&#x3B7;&#x3C4;&#x3AE; &#x3B3;&#x3C9;&#x3BD;&#x3AF;&#x3B1;, &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3AF;&#x3C3;&#x3C4;&#x3B5; &#x3AD;&#x3C4;&#x3BF;&#x3B9;&#x3BC;&#x3BF;&#x3B9; &#x3BD;&#x3B1; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B5;&#x3AF;&#x3C4;&#x3B5; &#x3BC;&#x3B5; &#x3AC;&#x3BD;&#x3B5;&#x3C3;&#x3B7;.&#xD;
&#x3A4;&#x3BF; Cover &#x3B4;&#x3B9;&#x3B1;&#x3B8;&#x3AD;&#x3C4;&#x3B5;&#x3B9; &#x3B9;&#x3C3;&#x3C7;&#x3C5;&#x3C1;&#x3AE; &#x3BC;&#x3C0;&#x3B1;&#x3C4;&#x3B1;&#x3C1;&#x3AF;&#x3B1; &#x3C0;&#x3BF;&#x3C5; &#x3B8;&#x3B1; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AE;&#x3C3;&#x3B5;&#x3B9; &#x3C4;&#x3B7;&#x3BD; &#x3C4;&#x3C1;&#x3BF;&#x3C6;&#x3BF;&#x3B4;&#x3BF;&#x3C3;&#x3AF;&#x3B1; &#x3AD;&#x3C9;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3C1;&#x3B5;&#x3B9;&#x3C2; &#x3BC;&#x3AE;&#x3BD;&#x3B5;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3C4;&#x3B7;&#x3BC;&#x3B1;&#x3C4;&#x3B9;&#x3BA;&#x3AE;&#x3C2; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3B7;&#x3C2; &#x3BC;&#x3B5;&#x3C4;&#x3B1;&#x3BE;&#x3CD; &#x3C4;&#x3C9;&#x3BD; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3AF;&#x3C3;&#x3B5;&#x3C9;&#x3BD; *. &#x395;&#x3C0;&#x3B9;&#x3C0;&#x3BB;&#x3AD;&#x3BF;&#x3BD;, &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C6;&#x3AD;&#x3C1;&#x3B5;&#x3B9; &#x3C6;&#x3C9;&#x3C4;&#x3B9;&#x3B6;&#x3CC;&#x3BC;&#x3B5;&#x3BD;&#x3B1; &#x3C0;&#x3BB;&#x3AE;&#x3BA;&#x3C4;&#x3C1;&#x3B1; &#x3C0;&#x3BF;&#x3C5; &#x3BA;&#x3AC;&#x3BD;&#x3BF;&#x3C5;&#x3BD; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3CC;&#x3B3;&#x3B7;&#x3C3;&#x3B7; &#x3C3;&#x3B5; &#x3C0;&#x3B5;&#x3C1;&#x3B9;&#x3BF;&#x3C7;&#x3AD;&#x3C2; &#x3C7;&#x3B1;&#x3BC;&#x3B7;&#x3BB;&#x3BF;&#x3CD; &#x3C6;&#x3C9;&#x3C4;&#x3B9;&#x3C3;&#x3BC;&#x3BF;&#x3CD; &#x3C0;&#x3BF;&#x3BB;&#x3CD; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B1; &#x3BC;&#x3AC;&#x3C4;&#x3B9;&#x3B1;. &#x39C;&#x3B5; &#x3B1;&#x3C5;&#x3C4;&#x3AC; &#x3C4;&#x3B1; &#x3C7;&#x3B1;&#x3C1;&#x3B1;&#x3BA;&#x3C4;&#x3B7;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC;, &#x3BA;&#x3B1;&#x3B9; &#x3C0;&#x3BF;&#x3BB;&#x3BB;&#x3AC; &#x3AC;&#x3BB;&#x3BB;&#x3B1;, &#x3C4;&#x3BF; ZAGGkeys Cover &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B7; - &#x3CC;&#x3BB;&#x3B1; &#x3C3;&#x3B5; &#x3AD;&#x3BD;&#x3B1; - &#x3BB;&#x3CD;&#x3C3;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3CC;&#x3B3;&#x3B7;&#x3C3;&#x3B7; &#x3CC;&#x3C0;&#x3BF;&#x3C5; &#x3BA;&#x3B9; &#x3B1;&#x3BD; &#x3B2;&#x3C1;&#x3AF;&#x3C3;&#x3BA;&#x3B5;&#x3C3;&#x3C4;&#x3B5;.</Description><Price>99.99</Price><Image>http://www.gricgroup.gr/media/catalog/product/z/3/z34zkmhcbklit103.png</Image></product><product><SKU>ZAGG-KCOViPM-BK</SKU><Manufacturer>zagg</Manufacturer><Name>ZAGGkeys - Cover with Backlit Keyboard (Apple iPad mini) - Black</Name><Description>&#x3A4;&#x3BF; &#x3BD;&#x3AD;&#x3BF; ZAGGkeys Cover &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3AD;&#x3BD;&#x3B1; &#x3B1;&#x3C0;&#x3BB;&#x3CC; &#x3BB;&#x3B5;&#x3C0;&#x3C4;&#x3CC;, &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3CD;&#x3C7;&#x3C1;&#x3B7;&#x3C3;&#x3C4;&#x3BF; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3CC;&#x3B3;&#x3B9;&#x3BF;.  &#x391;&#x3BB;&#x3BB;&#x3AC; &#x3B5;&#x3BD;&#x3CE; &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3BC;&#x3B9;&#x3BA;&#x3C1;&#x3CC; &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3BF; &#x3C3;&#x3C4;&#x3B7; &#x3BC;&#x3B5;&#x3C4;&#x3B1;&#x3C6;&#x3BF;&#x3C1;&#x3AC; &#x3C4;&#x3BF;&#x3C5;, &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C6;&#x3AD;&#x3C1;&#x3B5;&#x3B9; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3C1;&#x3B1;&#x3B3;&#x3BC;&#x3B1;&#x3C4;&#x3B9;&#x3BA;&#x3CC;&#x3C4;&#x3B7;&#x3C4;&#x3B1; 30% &#x3C0;&#x3B5;&#x3C1;&#x3B9;&#x3C3;&#x3C3;&#x3CC;&#x3C4;&#x3B5;&#x3C1;&#x3BF; &#x3C7;&#x3CE;&#x3C1;&#x3BF; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3CC;&#x3B3;&#x3B7;&#x3C3;&#x3B7; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3BF;&#x3BD; &#x3B1;&#x3BD;&#x3C4;&#x3B1;&#x3B3;&#x3C9;&#x3BD;&#x3B9;&#x3C3;&#x3BC;&#x3CC;. &#x395;&#x3C0;&#x3B9;&#x3C0;&#x3BB;&#x3AD;&#x3BF;&#x3BD;, &#x3B4;&#x3B9;&#x3B1;&#x3B8;&#x3AD;&#x3C4;&#x3B5;&#x3B9; &#x3BC;&#x3B9;&#x3B1; &#x3C0;&#x3B5;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3C1;&#x3B5;&#x3C6;&#x3CC;&#x3BC;&#x3B5;&#x3BD;&#x3B7; &#x3AC;&#x3C1;&#x3B8;&#x3C1;&#x3C9;&#x3C3;&#x3B7; &#x3C0;&#x3BF;&#x3C5; &#x3C3;&#x3B1;&#x3C2; &#x3B5;&#x3C0;&#x3B9;&#x3C4;&#x3C1;&#x3AD;&#x3C0;&#x3B5;&#x3B9; &#x3BD;&#x3B1; &#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B8;&#x3B5;&#x3C4;&#x3AE;&#x3C3;&#x3B5;&#x3C4;&#x3B5; &#x3C4;&#x3BF; iPad &#x3C3;&#x3B1;&#x3C2; &#x3C3;&#x3B5; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3CC;&#x3BD; &#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3B1;&#x3B4;&#x3AE;&#x3C0;&#x3BF;&#x3C4;&#x3B5; &#x3B3;&#x3C9;&#x3BD;&#x3AF;&#x3B1; &#x3B8;&#x3AD;&#x3B1;&#x3C3;&#x3B7;&#x3C2;, &#x3B1;&#x3BA;&#x3C1;&#x3B9;&#x3B2;&#x3CE;&#x3C2; &#x3CC;&#x3C0;&#x3C9;&#x3C2; &#x3BC;&#x3B9;&#x3B1; &#x3BF;&#x3B8;&#x3CC;&#x3BD;&#x3B7; &#x3C6;&#x3BF;&#x3C1;&#x3B7;&#x3C4;&#x3BF;&#x3CD; &#x3C5;&#x3C0;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B9;&#x3C3;&#x3C4;&#x3AE;. &#x391;&#x3BD;&#x3BF;&#x3AF;&#x3BE;&#x3C4;&#x3B5; &#x3C4;&#x3BF; iPad &#x3C3;&#x3B1;&#x3C2;, &#x3C1;&#x3C5;&#x3B8;&#x3BC;&#x3AF;&#x3C3;&#x3C4;&#x3B5; &#x3C4;&#x3B7;&#x3BD; &#x3B5;&#x3C0;&#x3B9;&#x3B8;&#x3C5;&#x3BC;&#x3B7;&#x3C4;&#x3AE; &#x3B3;&#x3C9;&#x3BD;&#x3AF;&#x3B1;, &#x3BA;&#x3B1;&#x3B9; &#x3B5;&#x3AF;&#x3C3;&#x3C4;&#x3B5; &#x3AD;&#x3C4;&#x3BF;&#x3B9;&#x3BC;&#x3BF;&#x3B9; &#x3BD;&#x3B1; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B5;&#x3AF;&#x3C4;&#x3B5; &#x3BC;&#x3B5; &#x3AC;&#x3BD;&#x3B5;&#x3C3;&#x3B7;.&#xD;
&#x3A4;&#x3BF; Cover &#x3B4;&#x3B9;&#x3B1;&#x3B8;&#x3AD;&#x3C4;&#x3B5;&#x3B9; &#x3B9;&#x3C3;&#x3C7;&#x3C5;&#x3C1;&#x3AE; &#x3BC;&#x3C0;&#x3B1;&#x3C4;&#x3B1;&#x3C1;&#x3AF;&#x3B1; &#x3C0;&#x3BF;&#x3C5; &#x3B8;&#x3B1; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AE;&#x3C3;&#x3B5;&#x3B9; &#x3C4;&#x3B7;&#x3BD; &#x3C4;&#x3C1;&#x3BF;&#x3C6;&#x3BF;&#x3B4;&#x3BF;&#x3C3;&#x3AF;&#x3B1; &#x3AD;&#x3C9;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3C1;&#x3B5;&#x3B9;&#x3C2; &#x3BC;&#x3AE;&#x3BD;&#x3B5;&#x3C2; &#x3C3;&#x3C5;&#x3C3;&#x3C4;&#x3B7;&#x3BC;&#x3B1;&#x3C4;&#x3B9;&#x3BA;&#x3AE;&#x3C2; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3B7;&#x3C2; &#x3BC;&#x3B5;&#x3C4;&#x3B1;&#x3BE;&#x3CD; &#x3C4;&#x3C9;&#x3BD; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3AF;&#x3C3;&#x3B5;&#x3C9;&#x3BD; *. &#x395;&#x3C0;&#x3B9;&#x3C0;&#x3BB;&#x3AD;&#x3BF;&#x3BD;, &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C6;&#x3AD;&#x3C1;&#x3B5;&#x3B9; &#x3C6;&#x3C9;&#x3C4;&#x3B9;&#x3B6;&#x3CC;&#x3BC;&#x3B5;&#x3BD;&#x3B1; &#x3C0;&#x3BB;&#x3AE;&#x3BA;&#x3C4;&#x3C1;&#x3B1; &#x3C0;&#x3BF;&#x3C5; &#x3BA;&#x3AC;&#x3BD;&#x3BF;&#x3C5;&#x3BD; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3CC;&#x3B3;&#x3B7;&#x3C3;&#x3B7; &#x3C3;&#x3B5; &#x3C0;&#x3B5;&#x3C1;&#x3B9;&#x3BF;&#x3C7;&#x3AD;&#x3C2; &#x3C7;&#x3B1;&#x3BC;&#x3B7;&#x3BB;&#x3BF;&#x3CD; &#x3C6;&#x3C9;&#x3C4;&#x3B9;&#x3C3;&#x3BC;&#x3BF;&#x3CD; &#x3C0;&#x3BF;&#x3BB;&#x3CD; &#x3B5;&#x3CD;&#x3BA;&#x3BF;&#x3BB;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B1; &#x3BC;&#x3AC;&#x3C4;&#x3B9;&#x3B1;. &#x39C;&#x3B5; &#x3B1;&#x3C5;&#x3C4;&#x3AC; &#x3C4;&#x3B1; &#x3C7;&#x3B1;&#x3C1;&#x3B1;&#x3BA;&#x3C4;&#x3B7;&#x3C1;&#x3B9;&#x3C3;&#x3C4;&#x3B9;&#x3BA;&#x3AC;, &#x3BA;&#x3B1;&#x3B9; &#x3C0;&#x3BF;&#x3BB;&#x3BB;&#x3AC; &#x3AC;&#x3BB;&#x3BB;&#x3B1;, &#x3C4;&#x3BF; ZAGGkeys Folio &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B7; - &#x3CC;&#x3BB;&#x3B1; &#x3C3;&#x3B5; &#x3AD;&#x3BD;&#x3B1; - &#x3BB;&#x3CD;&#x3C3;&#x3B7; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3BD; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3CC;&#x3B3;&#x3B7;&#x3C3;&#x3B7; &#x3CC;&#x3C0;&#x3BF;&#x3C5; &#x3BA;&#x3B9; &#x3B1;&#x3BD; &#x3B2;&#x3C1;&#x3AF;&#x3C3;&#x3BA;&#x3B5;&#x3C3;&#x3C4;&#x3B5;.</Description><Price>99.99</Price><Image>http://www.gricgroup.gr/media/catalog/product/z/3/z34zkmhcbklit103_1.png</Image></product><product><SKU>ZAGG-KP+-ALU</SKU><Manufacturer>zagg</Manufacturer><Name>ZAGGkeys - ProPlus Aluminium (Apple iPad 2/3/4th Gen)</Name><Description>&#x3A4;&#x3BF; PRO &#x3BA;&#x3B1;&#x3B9; PROPLUS &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3AD;&#x3BD;&#x3B1; &#x3B5;&#x3BE;&#x3B1;&#x3B9;&#x3C1;&#x3B5;&#x3C4;&#x3B9;&#x3BA;&#x3AC; &#x3BB;&#x3B5;&#x3C0;&#x3C4;&#x3AC; Bluetooth &#xAE; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3CC;&#x3B3;&#x3B9;&#x3B1; &#x3C0;&#x3BF;&#x3C5; &#x3B4;&#x3B9;&#x3B1;&#x3B8;&#x3AD;&#x3C4;&#x3BF;&#x3C5;&#x3BD; &#x3C4;&#x3CC;&#x3C3;&#x3BF; &#x3BB;&#x3B5;&#x3B9;&#x3C4;&#x3BF;&#x3C5;&#x3C1;&#x3B3;&#x3B9;&#x3BA;&#x3CC;&#x3C4;&#x3B7;&#x3C4;&#x3B1; &#x3CC;&#x3C3;&#x3BF; &#x3BA;&#x3B1;&#x3B9; &#x3C3;&#x3C4;&#x3C5;&#x3BB;. &#x3A3;&#x3B5; &#x3BC;&#x3CC;&#x3BB;&#x3B9;&#x3C2; 0.24 " &#x3BB;&#x3B5;&#x3C0;&#x3C4;&#x3AC; , &#x3AD;&#x3C7;&#x3BF;&#x3C5;&#x3BD; &#x3C3;&#x3C7;&#x3B5;&#x3B4;&#x3B9;&#x3B1;&#x3C3;&#x3C4;&#x3B5;&#x3AF; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3C3;&#x3C5;&#x3BC;&#x3C0;&#x3BB;&#x3B7;&#x3C1;&#x3CE;&#x3BD;&#x3BF;&#x3C5;&#x3BD; &#x3C4;&#x3AD;&#x3BB;&#x3B5;&#x3B9;&#x3B1; &#x3C4;&#x3B7;&#x3BD; &#x3B5;&#x3BC;&#x3C6;&#x3AC;&#x3BD;&#x3B9;&#x3C3;&#x3B7; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3B7;&#x3BD; &#x3B5;&#x3C5;&#x3BA;&#x3BF;&#x3BB;&#x3AF;&#x3B1; &#x3C4;&#x3B7;&#x3C2; Apple &#xAE;. &#x39C;&#x3B5; &#x3C4;&#x3BF; &#x3B1;&#x3BD;&#x3B8;&#x3B5;&#x3BA;&#x3C4;&#x3B9;&#x3BA;&#x3CC; &#x3C0;&#x3B5;&#x3C1;&#x3AF;&#x3B2;&#x3BB;&#x3B7;&#x3BC;&#x3B1; &#x3B1;&#x3C0;&#x3CC; &#x3B1;&#x3BB;&#x3BF;&#x3C5;&#x3BC;&#x3AF;&#x3BD;&#x3B9;&#x3BF; &#x3C0;&#x3BF;&#x3C5; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3C4;&#x3B1;&#x3C4;&#x3B5;&#x3CD;&#x3B5;&#x3B9; &#x3C4;&#x3B7;&#x3BD; &#x3BF;&#x3B8;&#x3CC;&#x3BD;&#x3B7; &#x3C3;&#x3B1;&#x3C2; &#x3B1;&#x3C0;&#x3CC; &#x3B3;&#x3C1;&#x3B1;&#x3C4;&#x3B6;&#x3BF;&#x3C5;&#x3BD;&#x3B9;&#x3AD;&#x3C2; , &#x3C4;&#x3BF; PRO &#x3BA;&#x3B1;&#x3B9; PROPLUS &#x3B5;&#x3AF;&#x3BD;&#x3B1;&#x3B9; &#x3B9;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3CC; &#x3B3;&#x3B9;&#x3B1; &#x3CC;&#x3C0;&#x3BF;&#x3B9;&#x3BF;&#x3BD; &#x3B8;&#x3AD;&#x3BB;&#x3B5;&#x3B9; &#x3BD;&#x3B1; &#x3B1;&#x3BE;&#x3B9;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3AE;&#x3C3;&#x3B5;&#x3B9; &#x3C3;&#x3C4;&#x3BF; &#x3AD;&#x3C0;&#x3B1;&#x3BA;&#x3C1;&#x3BF; &#x3C4;&#x3BF; iPad.&#xD;
&#x395;&#x3BA;&#x3C4;&#x3CC;&#x3C2; &#x3B1;&#x3C0;&#x3CC; &#x3C4;&#x3B7;&#x3BD; &#x3AC;&#x3BD;&#x3B5;&#x3C3;&#x3B7; &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3B7;&#x3BD; &#x3BA;&#x3BF;&#x3BC;&#x3C8;&#x3AE; &#x3B5;&#x3BC;&#x3C6;&#x3AC;&#x3BD;&#x3B9;&#x3C3;&#x3B7; , &#x3C4;&#x3BF; &#x3BC;&#x3BF;&#x3BD;&#x3C4;&#x3AD;&#x3BB;&#x3BF; PROPLUS &#x3AD;&#x3C7;&#x3B5;&#x3B9; &#x3BA;&#x3B1;&#x3C4;&#x3B1;&#x3C3;&#x3BA;&#x3B5;&#x3C5;&#x3B1;&#x3C3;&#x3C4;&#x3B5;&#x3AF; &#x3BC;&#x3B5; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3B1;&#x3C1;&#x3BC;&#x3CC;&#x3C3;&#x3B9;&#x3BC;&#x3B1; &#x3C6;&#x3C9;&#x3C4;&#x3B9;&#x3B6;&#x3CC;&#x3BC;&#x3B5;&#x3BD;&#x3B1; &#x3C0;&#x3BB;&#x3AE;&#x3BA;&#x3C4;&#x3C1;&#x3B1; , &#x3CE;&#x3C3;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3BC;&#x3C0;&#x3BF;&#x3C1;&#x3B5;&#x3AF;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3C0;&#x3C1;&#x3BF;&#x3C3;&#x3B1;&#x3C1;&#x3BC;&#x3CC;&#x3C3;&#x3B5;&#x3C4;&#x3B5; &#x3C4;&#x3B7;&#x3BD; &#x3B5;&#x3BC;&#x3C0;&#x3B5;&#x3B9;&#x3C1;&#x3AF;&#x3B1; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3CC;&#x3B3;&#x3B7;&#x3C3;&#x3B7;&#x3C2; &#x3C3;&#x3B1;&#x3C2; &#x3BA;&#x3B1;&#x3B9; &#x3BD;&#x3B1; &#x3B5;&#x3C1;&#x3B3;&#x3AC;&#x3B6;&#x3B5;&#x3C3;&#x3C4;&#x3B5; &#x3C3;&#x3B5; &#x3C0;&#x3B5;&#x3C1;&#x3B9;&#x3BF;&#x3C7;&#x3AD;&#x3C2; &#x3C7;&#x3B1;&#x3BC;&#x3B7;&#x3BB;&#x3BF;&#x3CD; &#x3C6;&#x3C9;&#x3C4;&#x3B9;&#x3C3;&#x3BC;&#x3BF;&#x3CD; &#x3BC;&#x3B5; &#x3B5;&#x3C5;&#x3BA;&#x3BF;&#x3BB;&#x3AF;&#x3B1; . &#x39A;&#x3B1;&#x3B9; &#x3C4;&#x3B1; &#x3B4;&#x3CD;&#x3BF; &#x3BC;&#x3BF;&#x3BD;&#x3C4;&#x3AD;&#x3BB;&#x3B1; &#x3B4;&#x3B9;&#x3B1;&#x3B8;&#x3AD;&#x3C4;&#x3BF;&#x3C5;&#x3BD; &#x3C0;&#x3BB;&#x3AE;&#x3BA;&#x3C4;&#x3C1;&#x3B1; &#x3C0;&#x3BF;&#x3C5; &#x3C3;&#x3B1;&#x3C2; &#x3B5;&#x3C0;&#x3B9;&#x3C4;&#x3C1;&#x3AD;&#x3C0;&#x3BF;&#x3C5;&#x3BD; &#x3BD;&#x3B1; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3B5;&#x3AF;&#x3C4;&#x3B5; &#x3C4;&#x3B1;&#x3C7;&#x3CD;&#x3C4;&#x3B5;&#x3C1;&#x3B1; &#x3BA;&#x3B1;&#x3B9; &#x3BC;&#x3B5; &#x3C0;&#x3B9;&#x3BF; &#x3C6;&#x3C5;&#x3C3;&#x3B9;&#x3BA;&#x3CC; &#x3C4;&#x3C1;&#x3CC;&#x3C0;&#x3BF; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3B2;&#x3BF;&#x3B7;&#x3B8;&#x3AE;&#x3C3;&#x3BF;&#x3C5;&#x3BD; &#x3C3;&#x3C4;&#x3B7; &#x3BC;&#x3B5;&#x3AF;&#x3C9;&#x3C3;&#x3B7; &#x3C4;&#x3C9;&#x3BD; &#x3BB;&#x3B1;&#x3B8;&#x3CE;&#x3BD;. &#x395;&#x3B9;&#x3B4;&#x3B9;&#x3BA;&#x3AC; &#x3C0;&#x3BB;&#x3AE;&#x3BA;&#x3C4;&#x3C1;&#x3B1; &#x3C3;&#x3C5;&#x3BD;&#x3C4;&#x3CC;&#x3BC;&#x3B5;&#x3C5;&#x3C3;&#x3B7;&#x3C2; &#x3B5;&#x3BA;&#x3C4;&#x3B5;&#x3BB;&#x3BF;&#x3CD;&#x3BD; &#x3B2;&#x3B1;&#x3C3;&#x3B9;&#x3BA;&#x3AD;&#x3C2; &#x3BB;&#x3B5;&#x3B9;&#x3C4;&#x3BF;&#x3C5;&#x3C1;&#x3B3;&#x3AF;&#x3B5;&#x3C2; &#x3C0;&#x3BB;&#x3B7;&#x3BA;&#x3C4;&#x3C1;&#x3BF;&#x3BB;&#x3BF;&#x3B3;&#x3CE;&#x3BD;&#x3C4;&#x3B1;&#x3C2; &#x3B3;&#x3C1;&#x3AE;&#x3B3;&#x3BF;&#x3C1;&#x3B1; , &#x3BA;&#x3B1;&#x3B9; &#x3C4;&#x3BF; &#x3B5;&#x3BD;&#x3C3;&#x3C9;&#x3BC;&#x3B1;&#x3C4;&#x3C9;&#x3BC;&#x3AD;&#x3BD;&#x3BF; &#x3BA;&#x3BB;&#x3B9;&#x3C0; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AC; &#x3C4;&#x3BF; iPad &#x3C3;&#x3B1;&#x3C2; &#x3C3;&#x3B5; &#x3BC;&#x3B9;&#x3B1; &#x3B9;&#x3B4;&#x3B1;&#x3BD;&#x3B9;&#x3BA;&#x3AE; &#x3B3;&#x3C9;&#x3BD;&#x3AF;&#x3B1; , &#x3CE;&#x3C3;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3BC;&#x3C0;&#x3BF;&#x3C1;&#x3B5;&#x3AF;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3B5;&#x3C0;&#x3B9;&#x3BA;&#x3B5;&#x3BD;&#x3C4;&#x3C1;&#x3C9;&#x3B8;&#x3B5;&#x3AF;&#x3C4;&#x3B5; &#x3C3;&#x3C4;&#x3B7;&#x3BD; &#x3B5;&#x3C1;&#x3B3;&#x3B1;&#x3C3;&#x3AF;&#x3B1; &#x3C3;&#x3B1;&#x3C2; .&#xD;
&#x388;&#x3BE;&#x3C5;&#x3C0;&#x3BD;&#x3B1; &#x3C4;&#x3BF;&#x3C0;&#x3BF;&#x3B8;&#x3B5;&#x3C4;&#x3B7;&#x3B8;&#x3B5;&#x3AF; &#x3BC;&#x3B1;&#x3B3;&#x3BD;&#x3AE;&#x3C4;&#x3B5;&#x3C2; &#x3BA;&#x3C1;&#x3B1;&#x3C4;&#x3AE;&#x3C3;&#x3B5;&#x3B9; iPad &#x3C3;&#x3B1;&#x3C2; &#x3B1;&#x3C3;&#x3C6;&#x3B1;&#x3BB;&#x3AE; &#x3BA;&#x3B1;&#x3B8;&#x3CE;&#x3C2; &#x3C4;&#x3B1;&#x3BE;&#x3B9;&#x3B4;&#x3B5;&#x3CD;&#x3B5;&#x3C4;&#x3B5; . &#x391;&#x3C5;&#x3C4;&#x3BF;&#x3AF; &#x3BF;&#x3B9; &#x3AF;&#x3B4;&#x3B9;&#x3BF;&#x3B9; &#x3BC;&#x3B1;&#x3B3;&#x3BD;&#x3AE;&#x3C4;&#x3B5;&#x3C2; &#x3B5;&#x3BD;&#x3B5;&#x3C1;&#x3B3;&#x3BF;&#x3C0;&#x3BF;&#x3B9;&#x3BF;&#x3CD;&#x3BD; &#x3C4;&#x3BF;&#x3BD; &#x3CD;&#x3C0;&#x3BD;&#x3BF; iPad &#x3C3;&#x3B1;&#x3C2; / &#x3BB;&#x3B5;&#x3B9;&#x3C4;&#x3BF;&#x3C5;&#x3C1;&#x3B3;&#x3AF;&#x3B1; &#x3B1;&#x3C6;&#x3CD;&#x3C0;&#x3BD;&#x3B9;&#x3C3;&#x3B7;&#x3C2; &#x3B3;&#x3B9;&#x3B1; &#x3BD;&#x3B1; &#x3C0;&#x3B1;&#x3C1;&#x3B1;&#x3C4;&#x3B5;&#x3AF;&#x3BD;&#x3B5;&#x3B9; &#x3C4;&#x3B7; &#x3B4;&#x3B9;&#x3AC;&#x3C1;&#x3BA;&#x3B5;&#x3B9;&#x3B1; &#x3B6;&#x3C9;&#x3AE;&#x3C2; &#x3C4;&#x3B7;&#x3C2; &#x3BC;&#x3C0;&#x3B1;&#x3C4;&#x3B1;&#x3C1;&#x3AF;&#x3B1;&#x3C2; &#x3C4;&#x3BF;&#x3C5; . &#x39A;&#x3B1;&#x3B9; &#x3BC;&#x3B5; &#x3AD;&#x3BD;&#x3B1; &#x3B9;&#x3C3;&#x3C7;&#x3C5;&#x3C1;&#x3CC; , &#x3BC;&#x3B1;&#x3BA;&#x3C1;&#x3AC;&#x3C2; &#x3B4;&#x3B9;&#x3AC;&#x3C1;&#x3BA;&#x3B5;&#x3B9;&#x3B1;&#x3C2; &#x3BC;&#x3C0;&#x3B1;&#x3C4;&#x3B1;&#x3C1;&#x3AF;&#x3B1; &#x3C0;&#x3BF;&#x3C5; &#x3B5;&#x3BA;&#x3C4;&#x3B5;&#x3BB;&#x3B5;&#x3AF; &#x3C3;&#x3C4;&#x3B1;&#x3B8;&#x3B5;&#x3C1;&#x3AC; &#x3B3;&#x3B9;&#x3B1; &#x3BC;&#x3AD;&#x3C7;&#x3C1;&#x3B9; &#x3C4;&#x3C1;&#x3B5;&#x3B9;&#x3C2; &#x3BC;&#x3AE;&#x3BD;&#x3B5;&#x3C2; &#x3C4;&#x3BF;&#x3C5; &#x3C0;&#x3C1;&#x3BF;&#x3C4;&#x3CD;&#x3C0;&#x3BF;&#x3C5; &#x3C7;&#x3C1;&#x3AE;&#x3C3;&#x3B7;&#x3C2; , &#x3B4;&#x3B5;&#x3BD; &#x3B8;&#x3B1; &#x3AD;&#x3C7;&#x3B5;&#x3C4;&#x3B5; &#x3BD;&#x3B1; &#x3B1;&#x3BD;&#x3B7;&#x3C3;&#x3C5;&#x3C7;&#x3B5;&#x3AF;&#x3C4;&#x3B5; &#x3B3;&#x3B9;&#x3B1; &#x3C4;&#x3BF; PRO &#x3AE; PROPLUS &#x3C7;&#x3AC;&#x3BD;&#x3B5;&#x3B9; &#x3C4;&#x3BF; &#x3C6;&#x3BF;&#x3C1;&#x3C4;&#x3AF;&#x3BF; &#x3C4;&#x3BF;&#x3C5; &#x3C3;&#x3C4;&#x3B7; &#x3BC;&#x3AD;&#x3C3;&#x3B7; &#x3C4;&#x3BF;&#x3C5; &#x3BA;&#x3AC;&#x3C4;&#x3B9; &#x3C3;&#x3B7;&#x3BC;&#x3B1;&#x3BD;&#x3C4;&#x3B9;&#x3BA;&#x3CC; .</Description><Price>99.99</Price><Image>http://www.gricgroup.gr/media/catalog/product/z/3/z34zkproalulit101_1.png</Image></product></xml>
